{"status":"ok","totalResults":65,"articles":[{"source":{"id":null,"name":"ScienceAlert"},"author":"David Nield","title":"This Diet Change Cuts Over 300 Calories a Day, Without Decreasing Meal Size - ScienceAlert","description":"With dieting, we usually think of smaller portions and periods of fasting, but new research shows that there is a way to stick to standard meal sizes, or even eat more, while still substantially cutting the number of calories you take in.","url":"https://www.sciencealert.com/this-diet-change-cuts-over-300-calories-a-day-without-decreasing-meal-size","urlToImage":"https://www.sciencealert.com/images/2026/02/HealthyFoods.jpg","publishedAt":"2026-02-17T00:14:04Z","content":"With dieting, we usually think of smaller portions and periods of fasting, but new research shows that there is a way to stick to standard meal sizes, or even eat more, while still substantially cutt… [+4589 chars]"},{"source":{"id":null,"name":"WTOP"},"author":"Jessica Kronzer","title":"Adult with measles possibly exposed others in Fairfax County - WTOP","description":"Health officials say a Northern Virginian with the measles may have exposed others to the virus in Fairfax County last week.","url":"https://wtop.com/virginia/2026/02/adult-with-measles-possibly-exposed-others-in-fairfax-county/","urlToImage":"https://wtop.com/wp-content/uploads/2025/07/Measles_Outbreak_Explainer_94875-scaled.jpg","publishedAt":"2026-02-16T23:30:19Z","content":"Eight Virginians have come down with measles in 2026. The latest case involves an adult who possibly exposed others to the virus in Fairfax County last week, according to Virginia health officials wh… [+2800 chars]"},{"source":{"id":null,"name":"Thetimes.com"},"author":"Jack Mosley","title":"My dad, Dr Michael Mosley, knew that intermittent fasting really does work - The Times","description":"The latest study claims that losing weight by fasting isn’t better than conventional diets. There are so many other benefits, says Dr Jack Mosley","url":"https://www.thetimes.com/life-style/health-fitness/article/jack-michael-mosley-food-noise-intermittent-fasting-health-advice-kb02zvtjs","urlToImage":"https://www.thetimes.com/imageserver/image/%2F11b74ade-1ae8-488a-a10f-86282d4ca7ca.jpg?crop=2762%2C1554%2C112%2C346&resize=1200","publishedAt":"2026-02-16T23:00:00Z","content":"According to a major review published yesterday, intermittent fasting is no better for weight loss than the traditional dieting style of cutting calories daily. Researchers analysed 22 global studies… [+6439 chars]"},{"source":{"id":null,"name":"Neurosciencenews.com"},"author":"Neuroscience News","title":"Moderate Cannabis Use May Protect the Aging Brain - Neuroscience News","description":"A study of 26,000 older adults finds that moderate cannabis use is associated with larger brain volumes and better memory, attention, and processing speed.","url":"https://neurosciencenews.com/cannabis-brain-volume-aging-30120/","urlToImage":"https://neurosciencenews.com/files/2026/02/cannabis-brain-aging-neuroscience.jpg","publishedAt":"2026-02-16T17:34:58Z","content":"Summary: New research has uncovered a surprising link between cannabis use and brain health in middle-aged and older adults. In a large-scale study involving over 26,000 participants from the UK Biob… [+14491 chars]"},{"source":{"id":null,"name":"The-independent.com"},"author":"Amber Raiken","title":"‘I spent a week at a luxury gut health retreat — was it worth it’? - The Independent","description":"As the multi-billion-dollar wellness industry continues to grow, all-new medical spas are popping up across Europe, delivering week-long escapes completely focused on nurturing your gut. Amber Raiken explores the growing business of these luxury health retrea…","url":"https://www.the-independent.com/life-style/luxury-gut-health-retreat-digestion-wellness-b2921413.html","urlToImage":"https://static.the-independent.com/2026/02/11/18/00/MixCollage-11-Feb-2026-01-19-PM-3565.jpeg?trim=0,0,0,0&width=1200&height=800&crop=1200:800","publishedAt":"2026-02-16T17:28:00Z","content":"Your support helps us to tell the story\r\nFrom reproductive rights to climate change to Big Tech, The Independent is on the ground when the story is developing. Whether it's investigating the financia… [+11407 chars]"},{"source":{"id":null,"name":"Eatingwell.com"},"author":"https://www.facebook.com/EatingWell/","title":"5 Foods That Are Surprisingly Considered Ultra-Processed - EatingWell","description":"Dietitians share five foods that are considered ultra-processed and explain whether they can still fit within a healthy, balanced diet.","url":"https://www.eatingwell.com/foods-surprisingly-considered-ultra-processed-11901826","urlToImage":"https://www.eatingwell.com/thmb/7hHycBuTIxPBfrbPUVFDh6gc8SA=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/5-Foods-That-Are-Surprisingly-Considered-Ultraprocessed-d70a62ac6ce04e619a5d26bdc908b92c.jpg","publishedAt":"2026-02-16T16:30:00Z","content":"Ultra-processed foods and research into their health effects has gained attention in recent years. Yet despite growing interest, confusionand even controversyremains about how these foods fit into a … [+8807 chars]"},{"source":{"id":null,"name":"Financial Times"},"author":"Michael Peel","title":"Psychedelic found in ayahuasca shows anti-depression promise - Financial Times","description":"Single dose of dimethyltryptamine curbed symptoms in small-scale trial","url":"https://www.ft.com/content/492f3a15-6c5d-4e26-8e1e-a24902d0bed3","urlToImage":"https://images.ft.com/v3/image/raw/https%3A%2F%2Fd1e00ek4ebabms.cloudfront.net%2Fproduction%2F032e3cfb-4305-40b9-881f-cf8155c4a7e2.jpg?source=next-barrier-page","publishedAt":"2026-02-16T16:00:05Z","content":"was $409now $149 for your first year\r\nDelivery Monday - Saturday, including FT Weekend and FT Digital Edition: all the content of the FT newspaper on any device. Savings based on annual price.\r\n<ul><… [+221 chars]"},{"source":{"id":null,"name":"PsyPost"},"author":"Karina Petrova","title":"Standard mental health tests may be inaccurate for highly intelligent people - PsyPost","description":"A new study suggests that standard depression screenings might not work for people with high IQs. Researchers found that as intelligence rises, the questions on these tests lose their ability to measure mental health accurately.","url":"https://www.psypost.org/standard-mental-health-tests-may-be-inaccurate-for-highly-intelligent-people/","urlToImage":"https://www.psypost.org/wp-content/uploads/2026/02/sad-professor-man.jpg","publishedAt":"2026-02-16T15:05:53Z","content":"Psychologists and the public alike have frequently debated whether exceptional cognitive ability comes with a cost to emotional well-being. A new analysis suggests that we may not be able to answer t… [+8167 chars]"},{"source":{"id":null,"name":"Medical Xpress"},"author":"Paul Arnold","title":"The five healthy diets that could add extra years to your life - Medical Xpress","description":"The old saying \"you are what you eat\" suggests that our food choices determine our health and longevity. Now, a study published in the journal Science Advances has put some specifics on it by estimating how many extra years can be gained through a healthy die…","url":"https://medicalxpress.com/news/2026-02-healthy-diets-extra-years-life.html","urlToImage":"https://scx2.b-cdn.net/gfx/news/hires/2026/eating-healthy.jpg","publishedAt":"2026-02-16T14:40:01Z","content":"The old saying \"you are what you eat\" suggests that our food choices determine our health and longevity. Now, a study published in the journal Science Advances has put some specifics on it by estimat… [+3287 chars]"},{"source":{"id":null,"name":"Newser"},"author":"Arden Dier","title":"Some GLP-1 Users Are Getting Scurvy - Newser","description":"Expert warns of vitamin deficiencies, too little research on dietary intake","url":"https://www.newser.com/story/383739/glp-1-drugs-linked-to-vitamin-deficiencies.html","urlToImage":"https://img2-azrcdn.newser.com/image/1665177-12-20260216081202.jpeg","publishedAt":"2026-02-16T13:52:00Z","content":"Some patients taking popular weight-loss drugs are ending up with a condition associated with 18th-century sea voyages: scurvy. GLP-1 medications such as Ozempic suppress appetite so effectively that… [+1406 chars]"},{"source":{"id":null,"name":"Interesting Engineering"},"author":"Mrigakshi Dixit","title":"Lab-grown retina reveals secret of sharp human vision growth in eyes - Interesting Engineering","description":"Researchers at Johns Hopkins University have discovered a new cellular mechanism behind how humans develop sharp, high-acuity vision.","url":"https://interestingengineering.com/science/cellular-process-behind-sharp-human-vision","urlToImage":"https://cms.interestingengineering.com/wp-content/uploads/2026/02/IE-60.jpg","publishedAt":"2026-02-16T13:47:00Z","content":"Researchers at Johns Hopkins University have discovered a new cellular mechanism behind how humans develop sharp, high-acuity vision. \r\nUsing lab-grown retinal organoids, the team identified how the … [+3336 chars]"},{"source":{"id":null,"name":"Parade"},"author":"Korin Miller","title":"Doctors Warn: Common Daily Supplement Mistake Could Harm Your Health - AOL.com","description":"It could have a big impact on your health.","url":"https://parade.com/health/worst-supplement-mistake-according-to-doctors","urlToImage":"https://s.yimg.com/os/en/aol_parade_744/f0644118e8d948632f11a07b1d4a72fb","publishedAt":"2026-02-16T13:43:40Z","content":"About 75% of Americans take some kind of supplement regularly, making it a common practice in the U.S.\r\nIf you're part of that group, it's understandable to wonder about your own supplement intake af… [+5820 chars]"},{"source":{"id":null,"name":"Science Daily"},"author":null,"title":"One in three people carry this brain parasite but the body has a kill switch - ScienceDaily","description":"A parasite that may already be hiding in your brain has a shocking survival trick: it can infect the very immune cells sent to destroy it. Yet most people never get sick, and new research from UVA Health reveals why. Scientists discovered that when Toxoplasma…","url":"https://www.sciencedaily.com/releases/2026/02/260215225602.htm","urlToImage":"https://www.sciencedaily.com/images/1920/brain-abscess-caused-by-parasitic-protozoan-toxoplasma-gondii.webp","publishedAt":"2026-02-16T13:34:41Z","content":"A parasite that may already be living in your brain has the ability to infect the very immune cells designed to eliminate it. New research from UVA Health explains how the body still manages to keep … [+3732 chars]"},{"source":{"id":null,"name":"IFLScience"},"author":"Laura Simmons","title":"Mystery Of Rare Blood Clots After COVID Vaccines Finally Solved After Years-Long Scientific Quest - IFLScience","description":"Vaccine developers of the future should now be able to eliminate this particular risk.","url":"https://www.iflscience.com/mystery-of-rare-blood-clots-after-covid-vaccines-finally-solved-after-years-long-scientific-quest-82568","urlToImage":"https://assets.iflscience.com/assets/articleNo/82568/aImg/89093/blood-clot-meta.jpg","publishedAt":"2026-02-16T13:05:07Z","content":"After years of work, scientists have solved the mystery of an unusual side effect that impacted some recipients of the Oxford/AstraZeneca and Johnson &amp; Johnson COVID-19 vaccines. Most importantly… [+4233 chars]"},{"source":{"id":null,"name":"Science Daily"},"author":null,"title":"Brain inflammation may be driving compulsive behavior - ScienceDaily","description":"For years, compulsive behaviors have been viewed as bad habits stuck on autopilot. But new research in rats found the opposite: inflammation in a key decision-making brain region actually made behavior more deliberate, not more automatic. The change was linke…","url":"https://www.sciencedaily.com/releases/2026/02/260215225606.htm","urlToImage":"https://www.sciencedaily.com/images/1920/brain-on-fire.webp","publishedAt":"2026-02-16T12:34:21Z","content":"For years, scientists have believed that compulsive behaviors happen when people become trapped in a \"habit loop\" that overrides self-control. But new research in rats from the University of Technolo… [+3500 chars]"},{"source":{"id":"the-washington-post","name":"The Washington Post"},"author":"Mikkael A. Sekeres, MD","title":"Column | As an oncologist, these are the foods I recommend to lower cancer risk - The Washington Post","description":"Making a few changes to your diet can lower your chance of developing cancer. Here’s what to eat — and what to avoid.","url":"https://www.washingtonpost.com/wellness/2026/02/16/diet-cancer-risk/","urlToImage":"https://www.washingtonpost.com/wp-apps/imrs.php?src=https://cloudfront-us-east-1.images.arcpublishing.com/wapo/7S2BQO5PCBDPTMJWHMEAOPZY4A.jpg&w=1440","publishedAt":"2026-02-16T12:31:57Z","content":"Are there changes I can make to my diet that lower my chances of developing cancer?\r\nAs an oncologist, this is one of the most common questions I hear from my patients and their families and friends … [+35 chars]"},{"source":{"id":null,"name":"ScienceAlert"},"author":"David Nield","title":"Depression May Warn of Parkinson's or Dementia, Years Before Diagnosis - ScienceAlert","description":"Researchers have found compelling evidence that depression points to the development of Parkinson's disease or Lewy body dementia later in life, with depressive symptoms often appearing several years before signs of a neurological condition.","url":"https://www.sciencealert.com/depression-may-warn-of-parkinsons-or-dementia-years-before-diagnosis","urlToImage":"https://www.sciencealert.com/images/2026/02/SeniorManLookingOutWindowWithSadness.jpg","publishedAt":"2026-02-16T12:04:10Z","content":"Researchers have found compelling evidence that depression points to the development of Parkinson's disease or Lewy body dementia later in life, with depressive symptoms often appearing several years… [+4753 chars]"},{"source":{"id":null,"name":"The Conversation Africa"},"author":"Jenny Graves","title":"Many men lose their Y chromosomes as they age. It may shorten their lives. - Live Science","description":"A researcher explores why men lose their Y chromosomes in cells as they age and the health implications associated with this loss.","url":"https://theconversation.com/men-lose-their-y-chromosome-as-they-age-scientists-thought-it-didnt-matter-but-now-were-learning-more-275823","urlToImage":"https://cdn.mos.cms.futurecdn.net/DTaxEGHnFsLXZ2KzdX8tb6-1920-80.jpg","publishedAt":"2026-02-16T12:00:00Z","content":null},{"source":{"id":null,"name":"BBC News"},"author":null,"title":"Measles outbreak could see unvaccinated pupils excluded from schools in north London - BBC","description":"Children identified as close contacts of people with the disease could be excluded for three weeks","url":"https://www.bbc.com/news/articles/c99jyexve1jo","urlToImage":"https://ichef.bbci.co.uk/news/1024/branded_news/fd95/live/62d51520-0b35-11f1-b7e1-afb6d0884c18.jpg","publishedAt":"2026-02-16T11:55:48Z","content":"\"We've been working closely to contain the infection, the spread, but also increase public knowledge and awareness,\" she said."},{"source":{"id":null,"name":"PsyPost"},"author":"Eric W. Dolan","title":"Cannabis use associated with better decision-making skills in people with bipolar disorder - PsyPost","description":"A new study published in Translational Psychiatry finds that chronic cannabis use is associated with better decision-making in people with bipolar disorder, contrasting with the cognitive impairment typically observed in healthy users.","url":"https://www.psypost.org/cannabis-use-associated-with-better-decision-making-skills-in-people-with-bipolar-disorder/","urlToImage":"https://www.psypost.org/wp-content/uploads/2026/02/cannabis-brain.jpg","publishedAt":"2026-02-16T11:09:45Z","content":"A new study published in Translational Psychiatry suggests that chronic cannabis use may not be associated with cognitive impairment in people with bipolar disorder, contrasting with its effects on h… [+10439 chars]"}]}