{"status":"ok","totalResults":67,"articles":[{"source":{"id":null,"name":"Eatingwell.com"},"author":"https://www.facebook.com/EatingWell/","title":"These Hobbies Could Delay Alzheimer’s by 5 Years, New Study Suggests - EatingWell","description":"A new study links lifelong cognitive enrichment from hobbies and activities to a 5-year delay in Alzheimer’s onset. Learn about brain health benefits.","url":"https://www.eatingwell.com/hobbies-to-delay-alzheimers-study-11916457","urlToImage":"https://www.eatingwell.com/thmb/0gFRbmOuJMTUxtXZxivXB5gVeWc=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/These-Hobbies-Could-Delay-Alzheimers-by-5-Years-New-Study-Suggests-ef27b5c8c9b84b77aa2405a7456d1242.jpg","publishedAt":"2026-02-27T23:16:41Z","content":"Weve all heard that keeping our minds active by reading, learning or taking on new challenges can help keep our brains healthier as we age. But what counts as meaningful \"cognitive enrichment,\" and h… [+5914 chars]"},{"source":{"id":null,"name":"Eatingwell.com"},"author":"https://www.facebook.com/EatingWell/","title":"The Surprising Food You Should Eat More of As You Age, According to a New Study - EatingWell","description":"A six-month trial suggests daily peanut butter may boost lower-body power in older adults—without weight gain. Here’s what it means.","url":"https://www.eatingwell.com/new-study-why-you-should-eat-peanut-butter-after-65-11915566","urlToImage":"https://www.eatingwell.com/thmb/cDLhcgR0-vHqQ8u41bSjdl5TYp0=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/The-Surprising-Food-You-Should-Eat-More-of-as-You-Age-According-to-a-New-Study-32d1ef205ff4498b92e9412af0dac93b.jpg","publishedAt":"2026-02-27T22:45:18Z","content":"While getting older is a privilege, some of the changes that come with it? Not so much. Muscle mass and strength naturally begin to decline as early as your 30sand the process tends to accelerate aft… [+7243 chars]"},{"source":{"id":null,"name":"nj.com"},"author":"Matthew Enuco | NJ.com","title":"Rabid skunk trapped by N.J. residents after encounter with two dogs - NJ.com","description":"The skunk was discovered in the backyard with the resident's two dogs, officials said.","url":"https://www.nj.com/camden/2026/02/rabid-skunk-trapped-by-nj-residents-after-encounter-with-two-dogs.html","urlToImage":"https://www.nj.com/resizer/v2/ISQD4DFOIFCJHB7H7M6JIADVYA.jpg?auth=8bd647d06a6af0e5ffc7e9e2f3fd58fc3b3676eb6b0df7e54cbcd3d04fcc15e2&width=1280&smart=true&quality=90","publishedAt":"2026-02-27T22:35:00Z","content":"A rabid skunk was trapped by two Camden County residents after an encounter with two dogs, county officials said. \r\nOn Feb. 20, Cherry Hill residents found a skunk with their two dogs in their backya… [+701 chars]"},{"source":{"id":null,"name":"WCVB Boston"},"author":"David Bienick","title":"Health officials confirm 2 measles cases linked to Mass. - WCVB","description":"The cases are the first two with ties to the state this year, but they come amid a large national outbreak.","url":"https://www.wcvb.com/article/measles-cases-massachusetts-2026-child-adult/70535315","urlToImage":"https://kubrick.htvapps.com/htv-prod-media.s3.amazonaws.com/images/measles-gettyimages-462803922-69a1dbdb13a6d.jpg?crop=1.00xw:0.844xh;0,0.115xh&resize=1200:*","publishedAt":"2026-02-27T22:15:00Z","content":"BOSTON —Two cases of measles were recently diagnosed in Massachusetts residents, according to the Department of Public Health. The cases are the first two with ties to the state this year, but they c… [+3242 chars]"},{"source":{"id":null,"name":"Smcgov.org"},"author":"Undefined","title":"San Mateo County Health Announces Potential Measles Exposure - County of San Mateo, CA","description":"San Mateo County, Calif. – San Mateo County Health is working with Santa Clara County Public Health to notify the public of a confirmed case of measles in the area. The case is an adult who recently returned from international travel. The individual, a Santa …","url":"https://www.smcgov.org/ceo/news/san-mateo-county-health-announces-potential-measles-exposure","urlToImage":null,"publishedAt":"2026-02-27T20:10:40Z","content":"San Mateo County, Calif. San Mateo County Health is working with Santa Clara County Public Health to notify the public of a confirmed case of measles in the area. The case is an adult who recently re… [+1516 chars]"},{"source":{"id":null,"name":"Futurism"},"author":"Maggie Harrison Dupré","title":"Chatbot Use Can Cause Mental Illness to Get Worse, Research Finds - Futurism","description":"A Danish study found that chatbot likely worsened symptoms of mental illness including delusions and mania, among other conditions.","url":"http://futurism.com/artificial-intelligence/chatbot-use-mental-illness","urlToImage":"https://futurism.com/wp-content/uploads/2026/02/chatbot-use-mental-illness.jpg?w=1200","publishedAt":"2026-02-27T20:02:52Z","content":"Can’t-miss innovations from the bleeding edge of science and tech\r\nA new study found that chatbot use appeared to worsen symptoms of mental illness in people struggling with an array of conditions, a… [+4686 chars]"},{"source":{"id":null,"name":"Martha Stewart"},"author":"https://www.facebook.com/marthastewart/","title":"The Surprising Health Benefits of Prunes—the Most Overlooked Superfood in Your Pantry - marthastewart.com","description":"Find out about the health benefits of prunes. Nutrition experts share that this superfood aids with much more than constipation. Learn how eating dried plums can help with inflammation, bone health, and more.","url":"https://www.marthastewart.com/health-benefits-of-prunes-11916089","urlToImage":"https://www.marthastewart.com/thmb/uj36HmXSNDF24zitjjSongM5gt0=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/GettyImages-1460263563-fb0ada28764f4916ada2eb7f5e847eb5.jpg","publishedAt":"2026-02-27T20:00:00Z","content":"You've likely heard about the benefits of prunesafter all, their reputation as a digestive aid in issues like constipation is practically common knowledge. But these dried stone fruits are actually c… [+6690 chars]"},{"source":{"id":null,"name":"KSL.com"},"author":"Deidre McPhillips, CNN","title":"US surpasses 1,100 measles cases in 2 months. Expect more deaths next - KSL.com","description":"The US has recorded more than 1,100 measles cases so far this year, according to data published Friday by the U.S. Centers for Disease Control and Prevention. It's a troubling milestone that has many in public health bracing for the worst.","url":"https://www.ksl.com/article/51454796/us-surpasses-1100-measles-cases-in-2-months-expect-more-deaths-next","urlToImage":"https://img.ksl.com/slc/3146/314609/31460935.jpg?filter=kslv2/responsive_story_lg","publishedAt":"2026-02-27T19:40:03Z","content":"ATLANTA The U.S. has recorded more than 1,100 measles cases so far this year, according to data published Friday by the U.S. Centers for Disease Control and Prevention. It's a troubling milestone tha… [+8954 chars]"},{"source":{"id":null,"name":"Self"},"author":"Korin Miller","title":"How Often You Poop Reveals a Lot About Your Health, Study Shows - SELF Magazine","description":"A study published in the journal “Cell Reports Medicine” details how often people poop, along with what your pooping frequency suggests about your overall health. GI experts explain.","url":"https://www.self.com/story/how-often-you-poop-overall-health","urlToImage":"https://media.self.com/photos/69a1e7f21d3550f2ef533282/2:1/w_1280,c_limit/GettyImages-1138699444.jpg","publishedAt":"2026-02-27T19:19:25Z","content":"If were being totally honest here, most people are a little obsessed with poop. It makes sense. While talking about poop is considered taboo in pop culture, its a consistent activity in your lifethat… [+2284 chars]"},{"source":{"id":"the-washington-post","name":"The Washington Post"},"author":"Tamar Haspel","title":"Column | New dietary guidelines promise science over bias — but come up short - The Washington Post","description":"The Trump administration says it wants evidence driving nutrition conclusions, but bias keeps getting in the way.","url":"https://www.washingtonpost.com/food/2026/02/27/american-dietary-guidelines-rfk-saturated-fats/","urlToImage":"https://www.washingtonpost.com/wp-apps/imrs.php?src=https://cloudfront-us-east-1.images.arcpublishing.com/wapo/ETROUQEEYBH4ZPT7GATJ7UUVXM.jpg&w=1440","publishedAt":"2026-02-27T18:31:52Z","content":"By now, youve probably read the criticism of the Trump administrations new Dietary Guidelines for Americans. Red meat and butter feature prominently in the upside-down pyramid introduced under the le… [+102 chars]"},{"source":{"id":null,"name":"ScienceAlert"},"author":"David Nield","title":"Hidden Virus Found in Gut Bacteria Is Linked to Colorectal Cancer - ScienceAlert","description":"Researchers have made a significant step forward in understanding how gut bacteria, and specifically a newly discovered virus, can contribute to colorectal cancer – one of the most common forms of cancer in the developed world.","url":"https://www.sciencealert.com/hidden-virus-found-in-gut-bacteria-is-linked-to-colorectal-cancer","urlToImage":"https://www.sciencealert.com/images/2026/02/BacteriophageGraphic.jpg","publishedAt":"2026-02-27T18:01:29Z","content":"Researchers have made a significant step forward in understanding how gut bacteria, and specifically a newly discovered virus, can contribute to colorectal cancer one of the most common forms of canc… [+3977 chars]"},{"source":{"id":null,"name":"AOL"},"author":"Emily Goldman","title":"I Ate Blueberries Every Day for 2 Weeks and This Is What Happened to My Body—and Blood Sugars - AOL.com","description":"Blueberries are full of health benefits, like antioxidants, polyphenols, and more. Here, one editor explains what happened when she ate blueberries every day...","url":"https://www.aol.com/articles/ate-blueberries-every-day-2-191100051.html","urlToImage":"https://s.yimg.com/ny/api/res/1.2/H5qqDpdfg3YU1QJCfbVkfQ--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02NzU-/https://media.zenfs.com/en/aol_prevention_182/afdc1ccc0ce1e7361e211e33a3fc22e4","publishedAt":"2026-02-27T17:49:34Z","content":"Ive been on a quest to find low-carb snacks for years. As a type 1 diabetic, so much of what I eat affects my day-to-day life. Anything from a banana to a slice of pizza can send me into a blood suga… [+5151 chars]"},{"source":{"id":null,"name":"New York Post"},"author":"Ethan Stone","title":"Eating for gut health: Simple, nutritious choices that help promote overall health - New York Post","description":"You have to care for your gut biome so it can care for you","url":"https://nypost.com/contributor-content/eating-for-gut-health-simple-nutritious-choices-that-help-promote-overall-health/","urlToImage":"https://nypost.com/wp-content/uploads/sites/2/2026/02/GutHealth.jpg?quality=75&strip=all&w=1200","publishedAt":"2026-02-27T17:30:00Z","content":"New York Post newsroom and editorial staff were not involved in the creation of this content. \r\nNurturing your gut doesnt have to be complicated. It starts with simple, everyday food choices that hel… [+5183 chars]"},{"source":{"id":null,"name":"PsyPost"},"author":"Vladimir Hedrih","title":"New study suggests binge-watching and marathon reading may have hidden psychological benefits - PsyPost","description":"A new study reveals that binge-watching TV or marathon reading helps build strong mental models of fictional worlds, leading viewers to vividly daydream and expand on those stories long after they finish.","url":"https://www.psypost.org/new-study-suggests-binge-watching-and-marathon-reading-may-have-hidden-psychological-benefits/","urlToImage":"https://www.psypost.org/wp-content/uploads/2026/02/woman-reading-book.jpg","publishedAt":"2026-02-27T17:06:48Z","content":"Two studies found that TV shows watched consecutively for longer durations or books read in long reading bouts were more memorable and more likely to be targets of retrospective imaginative involveme… [+6040 chars]"},{"source":{"id":null,"name":"Gizmodo.com"},"author":"Ed Cara","title":"Scientists Injected Stem Cells Into Fetuses to Treat a Birth Defect. Here’s What Happened - Gizmodo","description":"In a Phase I trial, the treatment appeared to be safe in children with spina bifida.","url":"https://gizmodo.com/scientists-injected-stem-cells-into-fetuses-to-treat-a-birth-defect-heres-what-happened-2000727597","urlToImage":"https://gizmodo.com/app/uploads/2026/02/CuRetrial_20260227_111042_0000-1200x675.jpg","publishedAt":"2026-02-27T17:05:12Z","content":"Stem cell therapy could represent a new frontier in the treatment of certain birth defects. Preliminary research published today suggests that donor stem cells received in the womb can help children … [+3685 chars]"},{"source":{"id":null,"name":"Indiandefencereview.com"},"author":"Evelyn Hart","title":"A Snake Parasite Never Seen in Humans Was Found Living Inside a Woman's Brain After Months of Lung Damage and Memory Loss - Indian Defence Review","description":"Surgeons were stunned when a routine brain biopsy revealed a living, 80mm predator thriving inside a patient’s frontal lobe.","url":"https://indiandefencereview.com/snake-python-parasite-found-living-inside-woman-brain/","urlToImage":"https://indiandefencereview.com/wp-content/uploads/2026/02/a-womans-forgetfulness-was-caused-by-a-live-python-worm-in-her-brain-scaled.jpg","publishedAt":"2026-02-27T15:00:00Z","content":"For 12 months, physicians treated a 64-year-old Australian woman for a lung condition of unknown origin. They administered steroids, then immunosuppressants, then monoclonal antibodies. Her symptoms … [+5971 chars]"},{"source":{"id":null,"name":"Newser"},"author":"John Johnson","title":"Shingles Shot May Offer More Benefits Than Thought - Newser","description":"Studies suggest it slows biological aging in seniors and wards off dementia","url":"https://www.newser.com/story/384471/shingles-shot-may-slow-biological-aging.html","urlToImage":"https://img1-azrcdn.newser.com/image/1667752-12-20260227083917.jpeg","publishedAt":"2026-02-27T14:21:00Z","content":"Vaccinated participants had lower levels of long-term, low-grade inflammation and slower \"epigenetic\" and \"transcriptomic\" aging—changes in how genes are regulated and expressed—than their unvaccinat… [+849 chars]"},{"source":{"id":null,"name":"The Seattle Times"},"author":"Jessica Fu","title":"WA seniors scramble amid insurance dispute - The Seattle Times","description":"Some seniors were forced to switch insurance providers to keep their doctors. Behind the scenes, a giant health care group is tightening its grip on the market.","url":"https://www.seattletimes.com/business/wa-medicare-advantage-buyers-scramble-amid-humana-optum-dispute/","urlToImage":"https://images.seattletimes.com/wp-content/uploads/2026/02/02252026_tzr_tzr_124505.jpg?d=1200x630","publishedAt":"2026-02-27T14:00:00Z","content":"This story is part of a Seattle Times focus on the affordability crisis in the Northwest. We explore the high cost of living and wealth disparities that shape our region; examine policies that impact… [+10938 chars]"}]}