{"status":"ok","totalResults":67,"articles":[{"source":{"id":null,"name":"KSL.com"},"author":"Intermountain LiveWell","title":"Intermountain Health expands care statewide to combat growing silent epidemic of arrhythmias - KSL.com","description":"Intermountain Health is adding heart specialists in Central Utah, Utah County, Salt Lake County, Davis County, Weber County, Washington County, and Cache County – to improve access to care for patients.","url":"https://www.ksl.com/article/51447009/intermountain-health-expands-care-statewide-to-combat-growing-silent-epidemic-of-arrhythmias","urlToImage":"https://img.ksl.com/slc/3144/314415/31441545.jpeg?filter=kslv2/responsive_story_lg","publishedAt":"2026-02-18T03:03:03Z","content":"As heart rhythm disorders continue to affect a record number of Americans, Intermountain Health is expanding specialized electrophysiology services and additional cardiovascular specialists across th… [+4718 chars]"},{"source":{"id":null,"name":"nj.com"},"author":"Nicolas Fernandes | NJ.com","title":"Bird flu suspected as dead geese are found at multiple parks across New Jersey, officials say - NJ.com","description":"The cause of the geese deaths is suspected to be bird flu, officials said.","url":"https://www.nj.com/news/2026/02/bird-flu-suspected-as-dead-geese-are-found-at-multiple-parks-across-new-jersey-officials-say.html","urlToImage":"https://www.nj.com/resizer/v2/ND47EH5BIJBLJO2GJRVVKWHP2E.JPG?auth=e2fe849d0074470146eb2fe055f4ef484a10f45ee4f6e5246d2d2765b8de72e5&width=1280&smart=true&quality=90","publishedAt":"2026-02-17T23:22:00Z","content":"Large numbers of dead or dying geese have been found at parks across New Jersey in recent days. \r\nNo cause was confirmed, but the Monmouth County Park System said in a statement on Tuesday that Avian… [+1798 chars]"},{"source":{"id":null,"name":"Stlpr.org"},"author":"Katie Grawitch","title":"Health officials warn of possible measles exposure at St. Louis Lambert Airport, Collinsville church - STLPR","description":"An individual with a confirmed measles case was in the airport on Feb. 7. Meanwhile, Illinois health officials say the same person may have exposed people at Good Shepherd Lutheran Church in Collinsville.","url":"https://www.stlpr.org/health-science-environment/2026-02-17/possible-measles-exposure-at-st-louis-lambert-airport-collinsville-church","urlToImage":"https://npr.brightspotcdn.com/dims4/default/29ece89/2147483647/strip/true/crop/1194x627+0+0/resize/1200x630!/quality/90/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F49%2Fc0%2F9ed85a674afd95c7d0875193e3f3%2F0418-measles-cdc1.jpg","publishedAt":"2026-02-17T22:36:39Z","content":"Missouri and Illinois health officials are warning of a possible measles exposure at St. Louis Lambert International Airport and a church in Collinsville.\r\nThe Missouri Department of Health and Senio… [+3267 chars]"},{"source":{"id":null,"name":"Medical Xpress"},"author":null,"title":"A gel for wounds that won't heal: Oxygen-delivering technology can prevent amputations - Medical Xpress","description":null,"url":"https://medicalxpress.com/news/2026-02-gel-wounds-wont-oxygen-technology.html","urlToImage":null,"publishedAt":"2026-02-17T21:59:39Z","content":null},{"source":{"id":null,"name":"Medical Xpress"},"author":"Medical Xpress","title":"Weight-loss wonder pills prompt scrutiny of their key ingredient - Medical Xpress","description":null,"url":"https://medicalxpress.com/news/2026-02-weight-loss-pills-prompt-scrutiny.html","urlToImage":null,"publishedAt":"2026-02-17T21:52:36Z","content":null},{"source":{"id":null,"name":"Gizmodo.com"},"author":"Ed Cara","title":"Intermittent Fasting Doesn’t Budge the Scale, Major Review Finds - Gizmodo","description":"A new review fails to find much of any added weight loss benefit from intermittent fasting compared to typical diet advice.","url":"https://gizmodo.com/intermittent-fasting-doesnt-budge-the-scale-major-review-finds-2000722920","urlToImage":"https://gizmodo.com/app/uploads/2026/02/intermittent-fasting-1200x675.jpg","publishedAt":"2026-02-17T20:45:15Z","content":"Looking to lose weight as effectively as possible? You probably don’t need to try intermittent fasting then, research published this month shows.\r\nScientists examined data from nearly two dozen rando… [+3272 chars]"},{"source":{"id":null,"name":"Dailykos.com"},"author":null,"title":"Domino's Pizza Mogul’s Ultra-Conservative Catholic Ave Maria University Plagued by Measles Outbreak - Daily Kos","description":"A measles outbreak at Ave Maria University was confirmed in late January with two cases, which had grown to nearly 60 by February 11. In response, Ave Maria University is no longer releasing data on how many students are recovering from the outbreak...","url":"https://www.dailykos.com/stories/2026/2/17/2369201/-Domino-s-Pizza-Mogul-s-Ultra-Conservative-Catholic-Ave-Maria-University-Plagued-by-Measles-Outbreak","urlToImage":"https://cdn.prod.dailykos.com/images/1408437/story_image/RFKMeasles.jpg?1741891785","publishedAt":"2026-02-17T20:43:55Z","content":null},{"source":{"id":null,"name":"Phys.Org"},"author":"Free University of Brussels","title":"Rhythm during sex in bonobos provides new insights into the evolution of communication - Phys.org","description":"An international research team, including VUB data scientist Yannick Jadoul, has shed new light on the rhythmic nature of sexual behavior in bonobos. By precisely analyzing the tempo of movements during sex, researchers aim to better understand which building…","url":"https://phys.org/news/2026-02-rhythm-sex-bonobos-insights-evolution.html","urlToImage":"https://scx2.b-cdn.net/gfx/news/hires/2026/bonobos.jpg","publishedAt":"2026-02-17T19:20:01Z","content":"An international research team, including VUB data scientist Yannick Jadoul, has shed new light on the rhythmic nature of sexual behavior in bonobos. By precisely analyzing the tempo of movements dur… [+3925 chars]"},{"source":{"id":null,"name":"Financial Times"},"author":"Kenza Bryan","title":"Air pollution directly linked to Alzheimer’s risk, scientists say - Financial Times","description":"Particles from combustion of fossil fuels may damage brain health more than thought, research suggests","url":"https://www.ft.com/content/35c5904e-c1bc-452c-9f38-29b6b1b77066","urlToImage":"https://images.ft.com/v3/image/raw/https%3A%2F%2Fd1e00ek4ebabms.cloudfront.net%2Fproduction%2Fae4162ff-9cf2-4299-9726-17f3da4c193c.jpg?source=next-barrier-page","publishedAt":"2026-02-17T19:05:56Z","content":"was $409now $149 for your first year\r\nDelivery Monday - Saturday, including FT Weekend and FT Digital Edition: all the content of the FT newspaper on any device. Savings based on annual price.\r\n<ul><… [+221 chars]"},{"source":{"id":null,"name":"Live Science"},"author":"Sahana Sitaraman","title":"Sleep deprivation harms the gut via the vagus nerve, early study reveals - Live Science","description":"New research reveals that sleep deprivation sends aberrant signals through the vagus nerve, triggering a serotonin surge that can kill gut stem cells.","url":"https://www.livescience.com/health/sleep/sleep-deprivation-harms-the-gut-via-the-vagus-nerve-early-study-reveals","urlToImage":"https://cdn.mos.cms.futurecdn.net/RDEr3MZzWVDnXRKbFzLhPE-1920-80.jpg","publishedAt":"2026-02-17T18:40:00Z","content":null},{"source":{"id":null,"name":"Fodor's Travel"},"author":"Apeksha Bhateja","title":"CDC Issues Travel Warning for Three Countries - Fodors Travel Guide","description":"Catch up on this week’s travel news: a heroic pilot in Somalia, CDC advisories on Chikungunya, TSA staff working without pay during a shutdown, postponed strikes in Italy, and Jet2’s lifetime bans for unruly passengers.","url":"https://www.fodors.com/news/photos/cdc-issues-travel-warning-for-three-countries","urlToImage":"https://www.fodors.com/wp-content/uploads/2025/09/Georgia_Atlanta_CDC-Centers-for-Disease-Control_bear_productionsshutterstock_1672254100.jpg","publishedAt":"2026-02-17T17:31:45Z","content":"British budget airline Jet2 announced a lifetime ban for two fliers for causing a flight diversion. The passengers started a brawl on a flight bound for Manchester, England, from Antalya, Turkey, las… [+613 chars]"},{"source":{"id":null,"name":"GQ Magazine"},"author":"Tom Ward","title":"How to Get Stronger So You Can Live a Long, Healthy Life - GQ","description":"Looking to build resilience for everyday activities? Strength training holds the key. These are our experts’ tips for getting strong where it matters most.","url":"https://www.gq.com/story/how-to-get-stronger-so-you-can-live-a-long-healthy-life-1","urlToImage":"https://media.gq.com/photos/6924d95ab971cfecb0146e4a/16:9/w_1280,c_limit/how%20to%20get%20stronger.jpg","publishedAt":"2026-02-17T17:24:43Z","content":"Your core is not just abs, says Morgan. Strong core muscles stabilize the lower back, reduce common desk-related pain, and allow you to transmit force efficiently in lifts, sprints, and contact sport… [+2489 chars]"},{"source":{"id":null,"name":"SciTechDaily"},"author":null,"title":"Scientists Discover How To “Switch Off” Cancer Genes for Good - SciTechDaily","description":"A new study shows that targeting key epigenetic proteins may permanently switch off cancer genes. Scientists at Monash University, working with Harvard University, report they have found a way to permanently ‘switch off’ genes that help cancers survive. If th…","url":"https://scitechdaily.com/scientists-discover-how-to-switch-off-cancer-genes-for-good/","urlToImage":"https://scitechdaily.com/images/DNA-Helix-Destruction-Cancer-Mutation-Carcinogen-Particle.jpg","publishedAt":"2026-02-17T17:24:43Z","content":"Researchers have uncovered a way to permanently silence cancer-driving genes in certain aggressive leukaemias by targeting the epigenetic machinery that controls gene activity. Credit: Shutterstock\r\n… [+4121 chars]"},{"source":{"id":null,"name":"Real Simple"},"author":"https://www.facebook.com/realsimple/","title":"Here’s What Happens When You Eat an Apple Every Day, According to Registered Dietitians - Real Simple","description":"Is it good to eat at least one apple every day? Registered dietitians break down the potential health benefits (and drawbacks) of making apples a daily habit.","url":"https://www.realsimple.com/what-happens-when-you-eat-an-apple-every-day-11904292","urlToImage":"https://www.realsimple.com/thmb/yOuclTzsbefNFQ20vpPe4BNzqRw=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/WhatHappensWhenYouEatAnAppleEveryDay-e9d843b848a34d249861d5b9b63d6c43.jpg","publishedAt":"2026-02-17T17:02:00Z","content":"Apples are one of the most consumed fruits you can find in the grocery store, and for good reason. Theyre affordable, widely available year-round, and come in several popular varieties. But eating he… [+5375 chars]"},{"source":{"id":null,"name":"Gizmodo.com"},"author":"Ed Cara","title":"The Link Between GLP-1 Drugs and Thyroid Cancer Could Be Smoke and Mirrors - Gizmodo","description":"A new review finds no convincing evidence that drugs like Ozempic raise people's risk of common thyroid cancers.","url":"https://gizmodo.com/the-link-between-glp-1-drugs-and-thyroid-cancer-could-be-smoke-and-mirrors-2000722797","urlToImage":"https://gizmodo.com/app/uploads/2025/11/injectable-pens-1-1200x675.jpg","publishedAt":"2026-02-17T17:00:39Z","content":"If you’ve ever thought about taking GLP-1 drugs like Ozempic, you might have been scared off by the possibility of thyroid cancer. Recent research, however, finds that this potential danger could act… [+3803 chars]"},{"source":{"id":null,"name":"SciTechDaily"},"author":null,"title":"This Simple Exercise Habit May Keep Your Brain Younger - SciTechDaily","description":"Adults who exercised regularly for a year had brains that appeared nearly a year younger on MRI scans. Protecting brain health is a lifelong effort, and new findings from the AdventHealth Research Institute suggest that regular exercise could play a meaningfu…","url":"https://scitechdaily.com/this-simple-exercise-habit-may-keep-your-brain-younger/","urlToImage":"https://scitechdaily.com/images/Brain-Support-Hand-Holding-Neuroscience-Treatment.jpg","publishedAt":"2026-02-17T16:49:42Z","content":"Sticking to a regular aerobic exercise routine may do more than strengthen your heart. New research suggests it can actually make your brain appear younger. Credit: Shutterstock\r\nAdults who exercised… [+7536 chars]"},{"source":{"id":null,"name":"Earth.com"},"author":null,"title":"Artificial sweeteners and sugar substitutes directly linked to heart attacks and strokes - Earth.com","description":"Sugar substitutes and artificial sweeteners show up in many diets and \"low-calorie\" products. Now we're seeing the long-term health effects.","url":"https://www.earth.com/news/artificial-sweeteners-like-erythritol-directly-linked-to-heart-attacks-and-strokes/","urlToImage":"https://cff2.earth.com/uploads/2025/03/17092133/artificial-sweeteners_sugar-substitutes_erythritol_heart-attack-stroke_1m.jpg","publishedAt":"2026-02-17T16:39:09Z","content":"Sugar substitutes and artificial sweeteners are used in many diets and “low-calorie” products, promoted as a way to help people enjoy sweet flavors without the usual calories.\r\nMany people choose the… [+6666 chars]"},{"source":{"id":null,"name":"Medical Xpress"},"author":"SUNY College of Optometry","title":"Myopia is driven by how we use our eyes indoors, new research suggests - Medical Xpress","description":"For years, rising rates of myopia—or nearsightedness—have been widely attributed to increased screen time, especially among children and young adults. But new research from scientists at the SUNY College of Optometry suggests the story may be more complicated…","url":"https://medicalxpress.com/news/2026-02-myopia-driven-eyes-indoors.html","urlToImage":"https://scx2.b-cdn.net/gfx/news/hires/2023/myopia.jpg","publishedAt":"2026-02-17T16:19:34Z","content":"For years, rising rates of myopiaor nearsightednesshave been widely attributed to increased screen time, especially among children and young adults. But new research from scientists at the SUNY Colle… [+6342 chars]"},{"source":{"id":null,"name":"Futurism"},"author":"Maggie Harrison Dupré","title":"AI Delusions Are Leading to Domestic Abuse, Harassment, and Stalking - Futurism","description":"ChatGPT and other AI chatbots are reinforcing users' delusions about other people — fueling fixations linked to stalking and abuse.","url":"http://futurism.com/artificial-intelligence/ai-abuse-harassment-stalking","urlToImage":"https://futurism.com/wp-content/uploads/2026/02/ai-abuse-harassment-stalking_6219aa.jpg?w=1200","publishedAt":"2026-02-17T15:30:21Z","content":"By the time the public harassment started, a woman told Futurism, she was already living in a nightmare.\r\nFor months, her then-fiancé and partner of several years had been fixating on her and their r… [+21220 chars]"}]}