{"status":"ok","totalResults":44,"articles":[{"source":{"id":"cnn","name":"CNN"},"author":"Jackie Wattles","title":"NASA opts to roll back moon rocket and delay crew’s historic trip into deep space - CNN","description":"NASA’s efforts to get the Artemis II mission off the ground have stalled once again, as engineers navigate a new issue with the rocket set to launch four astronauts around the moon.","url":"https://www.cnn.com/2026/02/24/science/artemis-2-roll-back-launch-date","urlToImage":"https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-2259771347.jpg?c=16x9&q=w_800,c_fill","publishedAt":"2026-02-24T13:46:16Z","content":"Efforts to get NASAs historic moon mission off the ground have stalled once again, as engineers navigate a new issue with the rocket set to propel four astronauts on an unprecedented path.\r\nThe agenc… [+6831 chars]"},{"source":{"id":null,"name":"Earth.com"},"author":null,"title":"Remote volcano is waking up after being dormant for 700,000 years - Earth.com","description":"Taftan volcano in southeastern Iran rose 3.5 inches over 10 months, signaling that it is waking up after 700,000 years of dormancy.","url":"https://www.earth.com/news/remote-vocano-taftan-iran-wakes-up-after-700000-year-dormancy/","urlToImage":"https://cff2.earth.com/uploads/2026/01/21131242/taftan-volcano_iran_wakes-up_700000-years-dormancy_1m.jpg","publishedAt":"2026-02-24T08:08:18Z","content":"A volcano in southeastern Iran has nudged upward by about 3.5 inches (9 centimeters) in 10 months. This might sound like a small rise but it has big significance. \r\nA new study used satellite data to… [+6398 chars]"},{"source":{"id":null,"name":"Nature.com"},"author":null,"title":"ChatGPT Health performance in a structured test of triage recommendations - Nature","description":"A stress test of ChatGPT Health triage revealed missed high-risk emergencies and inconsistent activation of suicide-crisis safeguards, raising safety concerns for consumer-scale deployment.","url":"https://www.nature.com/articles/s41591-026-04297-7","urlToImage":null,"publishedAt":"2026-02-24T00:00:00Z","content":"<li>The Milton and Carroll Petrie Department of Urology, Icahn School of Medicine at Mount Sinai and Mount Sinai Health System, New York, NY, USA\r\nAshwin Ramaswamy, Alvira Tyagi, Alexis E. Te, Steven… [+1357 chars]"},{"source":{"id":null,"name":"Phys.Org"},"author":"King's College London","title":"A new form of aluminum unlocks sustainable and cheaper catalysts - Phys.org","description":"A research team at King's College London has isolated a new form of aluminum—a highly abundant metal, that could provide a far cheaper and more sustainable alternative to commonly used rare earth metals. Dr. Clare Bakewell, Senior Lecturer in the Department o…","url":"https://phys.org/news/2026-02-aluminum-sustainable-cheaper-catalysts.html","urlToImage":"https://scx2.b-cdn.net/gfx/news/hires/2026/scientists-create-sust.jpg","publishedAt":"2026-02-23T21:48:15Z","content":"A research team at King's College London has isolated a new form of aluminuma highly abundant metal, that could provide a far cheaper and more sustainable alternative to commonly used rare earth meta… [+3518 chars]"},{"source":{"id":null,"name":"ExtremeTech"},"author":"Graham Templeton","title":"James Webb Telescope Takes a First Peek Inside Uranus - extremetech.com","description":"The planet's upper atmosphere has been mapped for the first time, revealing one of the solar system's most enigmatic members.","url":"https://www.extremetech.com/science/james-webb-telescope-takes-a-first-peek-inside-uranus","urlToImage":"https://i.extremetech.com/imagery/content-types/06W9k8jtZ5xLnZnwCSdrtT5/hero-image.fill.size_1200x675.jpg","publishedAt":"2026-02-23T21:39:00Z","content":"The European Space Agency announced Thursday that a study using the joint NASA/ESA-built James Webb Space Telescope has peered into Uranus's upper atmosphere. It's an important first step in revealin… [+2019 chars]"},{"source":{"id":null,"name":"Gizmodo.com"},"author":"Gayoung Lee","title":"Wild Study Proposes Possible Link Between Solar Flares and Earthquakes - Gizmodo","description":"Researchers say a deadly earthquake in Japan and 2023’s most powerful solar flare occurring back-to-back can’t be a coincidence—but other experts say it probably was.","url":"https://gizmodo.com/wild-study-proposes-possible-link-between-solar-flares-and-earthquakes-2000724708","urlToImage":"https://gizmodo.com/app/uploads/2026/02/x5-flare-231231-1200x675.jpg","publishedAt":"2026-02-23T21:35:27Z","content":"Earthquakes are one of many natural phenomena that, despite technological advances, weve yet to predict in advance. Researchers in Japana country frequently hit by devastating earthquakespropose we l… [+5434 chars]"},{"source":{"id":null,"name":"Indiandefencereview.com"},"author":"Rania Hadid","title":"Archaeologists Discover Mysterious Collections of Animal Skulls in Neanderthal Cave - Indian Defence Review","description":"Archaeologists have uncovered mysterious collections of animal skulls in a Neanderthal cave, raising new questions about their rituals and symbolic practices.","url":"https://indiandefencereview.com/collections-animal-skulls-neanderthal-cave/","urlToImage":"https://indiandefencereview.com/wp-content/uploads/2026/02/archaeologists-discover-mysterious-collections-of-animal-skulls-in-neanderthal-cave-scaled.png","publishedAt":"2026-02-23T21:30:00Z","content":"Archaeologists recently unearthed a series of animal skulls in a Neanderthal cave in Spain, sparking new questions about the rituals and symbolic practices of early humans. The skulls, some of which … [+5354 chars]"},{"source":{"id":null,"name":"Indiandefencereview.com"},"author":"Emily Carter","title":"5,000-Year-Old Seals Found in Iran Reveal Complex Trade Networks in Prehistoric Western Asia - Indian Defence Review","description":"A new discovery in western Iran reveals the role of seals in early bureaucracy, showing how prehistoric societies managed trade and resources.","url":"https://indiandefencereview.com/5000-year-old-seals-in-iran-trade-networks/","urlToImage":"https://indiandefencereview.com/wp-content/uploads/2026/02/5000-year-old-seals-found-in-iran-reveal-complex-trade-networks-in-prehistoric-western-asia-scaled.png","publishedAt":"2026-02-23T20:15:00Z","content":"In the rugged hills of western Iran, an ancient discovery is challenging everything we thought we knew about early human societies. What was once considered a minor site has now revealed a fascinatin… [+4042 chars]"},{"source":{"id":null,"name":"NASA"},"author":"Lee Mohon","title":"Young ‘Sun’ Caught Blowing Bubbles by NASA’s Chandra - NASA (.gov)","description":"For the first time, a much younger version of the Sun has been caught red-handed blowing bubbles in the galaxy, by astronomers using NASA’s Chandra X-ray","url":"https://www.nasa.gov/missions/chandra/young-sun-caught-blowing-bubbles-by-nasas-chandra/","urlToImage":"https://www.nasa.gov/wp-content/uploads/2026/02/astrosphere-xray-infrared.jpg","publishedAt":"2026-02-23T20:07:28Z","content":"For the first time, a much younger version of the Sun has been caught red-handed blowing bubbles in the galaxy, by astronomers using NASAs Chandra X-ray Observatory.\r\nThe bubble called an astrosphere… [+7487 chars]"},{"source":{"id":null,"name":"404media.co"},"author":"Becky Ferreira","title":"A Billion Years Are Mysteriously Missing From Earth’s History. Now, We Know Why. - 404 Media","description":"The Great Unconformity — a gap in Earth’s geological record — has puzzled scientists for 150 years. New research suggests it was created by shifting continents, rather than “snowball Earths” or Cambrian life.","url":"https://www.404media.co/great-unconformity-gap-geological-record-study-columbia/","urlToImage":"https://www.404media.co/content/images/size/w1200/2026/02/25-23891-2.jpg","publishedAt":"2026-02-23T20:04:13Z","content":"Scientists have resolved a longstanding mystery about the Great Unconformity, a huge gap in the geological record that shows up across the world and has inspired speculation for more than 150 years, … [+4406 chars]"},{"source":{"id":null,"name":"Phys.Org"},"author":"Southwest Research Institute","title":"Jupiter's Galilean moons may have gained life's building blocks at birth - Phys.org","description":"Southwest Research Institute was part of an international team that demonstrated how complex organic molecules (COMs), key chemical precursors to life, could have been incorporated into Jupiter's Galilean moons during their formation. The team's findings have…","url":"https://phys.org/news/2026-02-jupiter-galilean-moons-gained-life.html","urlToImage":"https://scx2.b-cdn.net/gfx/news/hires/2026/swri-collaborators-off.jpg","publishedAt":"2026-02-23T19:39:43Z","content":"Southwest Research Institute was part of an international team that demonstrated how complex organic molecules (COMs), key chemical precursors to life, could have been incorporated into Jupiter's Gal… [+5506 chars]"},{"source":{"id":null,"name":"Phys.Org"},"author":"Paul Arnold","title":"Finding the honey bee dance floor: New method shows how it moves within the hive - Phys.org","description":"When honey bees find a good source of food, they return to their hive and perform a waggle dance. It consists of a series of movements that communicate the direction and distance to nectar, pollen or water relative to the sun. For years, scientists had a vagu…","url":"https://phys.org/news/2026-02-honey-bee-floor-method-hive.html","urlToImage":"https://scx2.b-cdn.net/gfx/news/2026/mapping-where-bees-per.jpg","publishedAt":"2026-02-23T19:20:01Z","content":"When honey bees find a good source of food, they return to their hive and perform a waggle dance. It consists of a series of movements that communicate the direction and distance to nectar, pollen or… [+3284 chars]"},{"source":{"id":null,"name":"Space.com"},"author":"Mike Wall","title":"China's mysterious Shenlong space plane recently launched on its 4th mission. What is it doing up there? - Space","description":"We don't know for sure, but there are some intriguing clues.","url":"https://www.space.com/space-exploration/launches-spacecraft/chinas-mysterious-shenlong-space-plane-recently-launched-on-its-4th-mission-what-is-it-doing-up-there","urlToImage":"https://cdn.mos.cms.futurecdn.net/9tudPXxpRYhr6KeLCNT9xL-2000-80.jpg","publishedAt":"2026-02-23T19:00:00Z","content":null},{"source":{"id":null,"name":"NASA"},"author":"Jessica Taveau","title":"NASA to Cover 33rd SpaceX Resupply Mission Station Departure - NASA (.gov)","description":"Watch NASA’s live coverage of the undocking and departure of the agency’s 33rd SpaceX Commercial Resupply Services mission starting at 11:45 a.m. EST on","url":"https://www.nasa.gov/news-release/nasa-to-cover-33rd-spacex-resupply-mission-station-departure/","urlToImage":"https://images-assets.nasa.gov/image/iss073e0545540/iss073e0545540~large.jpg","publishedAt":"2026-02-23T18:48:28Z","content":"NASA and its international partners will receive scientific research samples and hardware when a SpaceX Dragon spacecraft departs the International Space Station on Thursday, Feb. 26, and returns to … [+3559 chars]"},{"source":{"id":null,"name":"Phys.Org"},"author":"Andrew Good, Karen Fox, Molly Wasser","title":"Curiosity rover captures Martian spiderwebs up close - Phys.org","description":"For about six months, NASA's Curiosity Mars rover has been exploring a region full of geologic formations called boxwork, low ridges standing roughly 3 to 6 feet (1 to 2 meters) tall with sandy hollows in between. Crisscrossing the surface for miles, the form…","url":"https://phys.org/news/2026-02-curiosity-rover-captures-martian-spiderwebs.html","urlToImage":"https://scx2.b-cdn.net/gfx/news/hires/2026/curiosity-rover-captur.jpg","publishedAt":"2026-02-23T18:20:05Z","content":"For about six months, NASA's Curiosity Mars rover has been exploring a region full of geologic formations called boxwork, low ridges standing roughly 3 to 6 feet (1 to 2 meters) tall with sandy hollo… [+5689 chars]"},{"source":{"id":null,"name":"New York Post"},"author":"Ben Cost","title":"‘Extremely rare’ fossilized anus could reveal reptile evolution breakthrough - New York Post","description":"It’s a tail as old as time.","url":"https://nypost.com/2026/02/23/science/extremely-rare-fossilized-anus-discovered-after-300-million-years/","urlToImage":"https://nypost.com/wp-content/uploads/sites/2/2026/02/newspress-collage-93eoqfzq6-1771861230504.jpg?quality=75&strip=all&1771843301&w=1200","publishedAt":"2026-02-23T17:24:00Z","content":"It’s a tail as old as time.\r\nScientists may have discovered the world’s oldest butthole after unearthing the nearly 300-million-year-old impression of a reptile’s backend in Germany, per an upcoming … [+2634 chars]"},{"source":{"id":"associated-press","name":"Associated Press"},"author":"Adithi Ramakrishnan","title":"A horse’s neigh may be unique in the animal kingdom. Now scientists know how they do it - AP News","description":"A horse's signature whinny comes from a combination of whistling and singing. The whinny is a unique combination of both high and low pitched sounds. The low tones come from vibration of tissue in the voice box. But what about the high ones? Scientists found …","url":"https://apnews.com/article/horse-neigh-whinny-voice-box-whistle-1cd9c808a07e8dd96afe185774706a0d","urlToImage":"https://dims.apnews.com/dims4/default/9fa8d81/2147483647/strip/true/crop/2144x1429+0+0/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F32%2F79%2F3f8a9902c613c81f6390d10cc792%2F9cdb2fcbb1e5474f8991ce4dcd786c51","publishedAt":"2026-02-23T17:17:00Z","content":"NEW YORK (AP) Horses whinny to find new friends, greet old ones and celebrate happy moments like feeding time.\r\nHow exactly horses produce that distinctive sound also called a neigh has long eluded s… [+3055 chars]"},{"source":{"id":null,"name":"The Daily Galaxy --Great Discoveries Channel"},"author":"Lydia Amazouz","title":"Cosmologists Achieve Unprecedented Accuracy in Measuring Universe’s Expansion - The Daily Galaxy","description":"An international team of cosmologists has achieved an unprecedented level of precision in measuring the Hubble constant, but their findings only deepen the mystery surrounding the universe's expansion rate.","url":"https://dailygalaxy.com/2026/02/cosmologists-measuring-universes-expansion/","urlToImage":"https://dailygalaxy.com/wp-content/uploads/2026/02/Cosmologists-Achieve-Unprecedented-Accuracy-in-Measuring-Universes-Expansion-scaled.png","publishedAt":"2026-02-23T17:15:00Z","content":"an international collaboration of cosmologists has reached a new level of precision in measuring the Hubble constant. The Hubble constant is crucial in understanding the rate of expansion of the univ… [+4546 chars]"},{"source":{"id":"cnn","name":"CNN"},"author":"Jacopo Prisco, CNN","title":"Astronomers say they have solved one of Saturn’s greatest mysteries - Yahoo","description":"Saturn’s largest moon, Titan, might have formed after a collision with a lost moon, according to new research.","url":"https://www.cnn.com/2026/02/23/science/saturn-rings-moon-cosmic-collision","urlToImage":"https://s.yimg.com/os/en/cnn_articles_875/8ea0da7c5fa12f62cf4b27669150b095","publishedAt":"2026-02-23T17:12:12Z","content":"Saturns largest moon, Titan, is one of the solar systems oddities. Now, researchers have unlocked key insights about this mysterious moon, including how it came to be. The answer may also shed light … [+8595 chars]"},{"source":{"id":null,"name":"Phys.Org"},"author":"Tomasz Nowakowski","title":"Astronomers discover rare super-Jupiter orbiting distant star - Phys.org","description":"Using NASA's Transiting Exoplanet Survey Satellite (TESS), an international team of astronomers has discovered a new exoplanet orbiting a distant star known as TIC-65910228. The newfound alien world is slightly larger and nearly five times more massive than J…","url":"https://phys.org/news/2026-02-astronomers-rare-super-jupiter-orbiting.html","urlToImage":"https://scx2.b-cdn.net/gfx/news/2026/astronomers-discover-a-3.jpg","publishedAt":"2026-02-23T16:40:01Z","content":"Using NASA's Transiting Exoplanet Survey Satellite (TESS), an international team of astronomers has discovered a new exoplanet orbiting a distant star known as TIC-65910228. The newfound alien world … [+3866 chars]"}]}