{"status":"ok","totalResults":41,"articles":[{"source":{"id":null,"name":"Space.com"},"author":"Josh Dinner","title":"Artemis 2 SLS wet dress rehearsal latest news: NASA prepares to load propellant in critical fueling test - Space","description":"Monday, Feb. 2, 2026: Follow NASA's last major test of SLS before the launch of Artemis 2 and a crew of astronauts around the moon.","url":"https://www.space.com/news/live/artemis-2-moon-rocket-nasa-fueling-test-feb-2-2026","urlToImage":"https://cdn.mos.cms.futurecdn.net/qRVhBQEibVub9oy4V3P82V-2560-80.jpg","publishedAt":"2026-02-02T13:48:00Z","content":"2026-02-02T13:48:01.373ZNon-essential personnel cleared from launchpad ahead of SLS fueling\r\n(Image credit: NASA/Sam Lott)\r\nWith the sun rising on the second day of the Artemis 2 wet dress rehearsal,… [+8420 chars]"},{"source":{"id":null,"name":"Noaa.gov"},"author":null,"title":"UPDATE! An X8.1 (Strong) flare from Region 4366 - NOAA (National Oceanic and Atmospheric Administration) (.gov)","description":null,"url":"https://www.swpc.noaa.gov/news/update-x81-strong-flare-region-4366","urlToImage":null,"publishedAt":"2026-02-02T12:27:00Z","content":"Region 4366 produced another strong X8.1 (R3) flare at 6:57 pm ET. Modeling of the associated coronal mass ejection(s) indicates that a bulk of the material will pass by Earth to the north and east l… [+231 chars]"},{"source":{"id":null,"name":"KSL.com"},"author":"Lily Hautau, CNN","title":"We asked retired astronauts about their favorite space movies. This is what they shared with us - KSL News","description":"NASA's Artemis II mission is set to launch as early as Feb. 6, putting human spaceflight to the moon back in the spotlight after a 50-plus year hiatus which may inspire future filmmakers to explore the possibilities of space travel in their own work.","url":"https://www.ksl.com/article/51441488/we-asked-retired-astronauts-about-their-favorite-space-movies-this-is-what-they-shared-with-us","urlToImage":"https://img.ksl.com/slc/3142/314286/31428670.jpg?filter=kslv2/responsive_story_lg","publishedAt":"2026-02-02T04:45:04Z","content":"LOS ANGELES NASA's Artemis II mission is set to launch as early as Feb. 6, putting human spaceflight to the moon back in the spotlight after a 50-plus year hiatus, which may inspire future filmmakers… [+7893 chars]"},{"source":{"id":null,"name":"KSL.com"},"author":"Daniel V. Ramirez, EastIdahoNews.com","title":"Museum of Idaho launches new exhibit exploring 'Life Before Dinosaurs' - KSL News","description":"From looking into the future with artificial intelligence to learning about mummies of the past, the Museum of Idaho ventures further back in time, before dinosaurs existed.","url":"https://www.ksl.com/article/51441602/museum-of-idaho-launches-new-exhibit-exploring-life-before-dinosaurs","urlToImage":"https://img.ksl.com/slc/3142/314288/31428848.jpg?filter=kslv2/responsive_story_lg","publishedAt":"2026-02-02T00:48:51Z","content":"IDAHO FALLS From looking into the future with artificial intelligence to learning about mummies of the past, the Museum of Idaho ventures further back in time, before dinosaurs existed.\r\n\"Life Before… [+4530 chars]"},{"source":{"id":null,"name":"Phys.Org"},"author":"Li Yali","title":"Satellite study reveals 24.2 billion ton annual groundwater loss in High Mountain Asia - Phys.org","description":"A recent satellite-based study has uncovered alarming declines in groundwater storage across High Mountain Asia (HMA), widely known as the \"Asian Water Tower.\" This critical water source, which sustains agricultural irrigation, urban water supplies and ecolog…","url":"https://phys.org/news/2026-01-satellite-reveals-billion-ton-annual.html","urlToImage":"https://scx2.b-cdn.net/gfx/news/2026/satellite-study-reveal.jpg","publishedAt":"2026-02-01T22:30:01Z","content":"A recent satellite-based study has uncovered alarming declines in groundwater storage across High Mountain Asia (HMA), widely known as the \"Asian Water Tower.\" This critical water source, which susta… [+3623 chars]"},{"source":{"id":null,"name":"Discoverwildlife.com"},"author":"Debbie Graham","title":"It's the size of 3 Central Parks in New York, could be 8,650 years old – and glows in the dark. Forget the blue whale this beast is the world's biggest organism - BBC Wildlife Magazine","description":"This humongous fungus is the biggest organism in the world","url":"https://www.discoverwildlife.com/plant-facts/fungi/biggest-oldest-organism","urlToImage":"https://c02.purpledshub.com/uploads/sites/62/2026/01/biggest-organism-in-the-world.jpg?w=1200","publishedAt":"2026-02-01T20:22:44Z","content":"If you ever want to pull out the big guns in a pub quiz, then do I have a fact for you! Contrary to popular belief, the biggest organism in the world is not the blue whale. Nor is it the giant sequoi… [+2466 chars]"},{"source":{"id":null,"name":"Visual Capitalist"},"author":"Nick Routley","title":"Mapped: The World’s 12 Largest Impact Craters - Visual Capitalist","description":"See Earth's largest impact craters, including the ones tied to extinction events and rare geological formations.","url":"https://www.visualcapitalist.com/cp/worlds-12-largest-impact-craters/","urlToImage":"https://www.visualcapitalist.com/wp-content/uploads/2026/02/biggest-craters-share.webp","publishedAt":"2026-02-01T20:15:06Z","content":"Ranked: The Most Reliable Car Brands in 2026\r\nSee visuals like this from many other data creators on our Voronoi app. Download it for free on iOS or Android and discover incredible data-driven charts… [+4501 chars]"},{"source":{"id":null,"name":"ScienceAlert"},"author":"Jess Cockerill","title":"250-Million-Year-Old Fossil Reveals Origins of Our Unique Hearing - ScienceAlert","description":"Modern mammals have unique hearing abilities, able to sense a broad range of volumes and frequencies using middle-ear features, including our eardrums and a few small bones.","url":"https://www.sciencealert.com/250-million-year-old-fossil-reveals-origins-of-our-unique-hearing","urlToImage":"https://www.sciencealert.com/images/2026/01/thrinaxodon-illustration.jpg","publishedAt":"2026-02-01T18:04:33Z","content":"Modern mammals have unique hearing abilities, able to sense a broad range of volumes and frequencies using middle-ear features, including our eardrums and a few small bones.\r\nA new study from paleont… [+4454 chars]"},{"source":{"id":null,"name":"Indiandefencereview.com"},"author":"Slamani Aghilas","title":"New Data Points to Massive Underground Structures Beneath Venus - Indian Defence Review","description":"Beneath Venus’s scorched surface, scientists may have found something massive—and it could rewrite planetary history.","url":"https://indiandefencereview.com/what-lies-beneath-venus-new-data-points/","urlToImage":"https://indiandefencereview.com/wp-content/uploads/2026/02/venus-surface-illustrative-image-scaled.jpg","publishedAt":"2026-02-01T17:57:51Z","content":"The surface of Venus is notoriously difficult to observe due to its thick, sulfuric atmosphere and crushing pressure. But the planets volcanic history is written across its plains, where winding chan… [+3097 chars]"},{"source":{"id":null,"name":"The Daily Galaxy --Great Discoveries Channel"},"author":"Lydia Amazouz","title":"Bright Light Streaks Across New Zealand Skyline: What Could It Be? - The Daily Galaxy","description":"A mysterious streak of light appeared over Wellington, New Zealand, on January 30, 2026.","url":"https://dailygalaxy.com/2026/02/bright-light-streaks-across-new-zealand/","urlToImage":"https://dailygalaxy.com/wp-content/uploads/2026/02/Bright-Light-Streaks-Across-New-Zealand-Skyline-What-Could-It-Be-scaled.png","publishedAt":"2026-02-01T17:16:00Z","content":"On January 30, 2026, an unusual and captivating phenomenon occurred above the city of Wellington, New Zealand. A bright streak of light was captured by a webcam at the Heretaunga Boating Club, sparki… [+3732 chars]"},{"source":{"id":null,"name":"Phys.Org"},"author":"Sandee Oster","title":"Two rare 5th millennium BC fetal burials in Iran reveal variable prehistoric practices - Phys.org","description":"In a study conducted by Dr. Mahdi Alirezazadeh and Dr. Hanan Bahranipoor, published in Archaeological Research in Asia, two exceptionally well-preserved fetal burials from Chaparabad, Iran, dating to the mid-5th millennium BC, were analyzed including burial L…","url":"https://phys.org/news/2026-01-rare-5th-millennium-bc-fetal.html","urlToImage":"https://scx2.b-cdn.net/gfx/news/2026/two-rare-centuries-old.jpg","publishedAt":"2026-02-01T16:10:03Z","content":"In a study conducted by Dr. Mahdi Alirezazadeh and Dr. Hanan Bahranipoor, published in Archaeological Research in Asia, two exceptionally well-preserved fetal burials from Chaparabad, Iran, dating to… [+6175 chars]"},{"source":{"id":null,"name":"Phys.Org"},"author":"Mario Aguilera","title":"Plastic pollution promotes hazardous water conditions, new study finds - Phys.org","description":"Dangerous concentrations of algae such as \"red tides\" have been consistently emerging in locations around the world. A region in Southern Australia is experiencing a nine-month toxic algae bloom that spans thousands of miles and has caused thousands of deaths…","url":"https://phys.org/news/2026-01-plastic-pollution-hazardous-conditions.html","urlToImage":"https://scx2.b-cdn.net/gfx/news/2026/plastic-pollution-prom.jpg","publishedAt":"2026-02-01T16:10:01Z","content":"Dangerous concentrations of algae such as \"red tides\" have been consistently emerging in locations around the world. A region in Southern Australia is experiencing a nine-month toxic algae bloom that… [+6099 chars]"},{"source":{"id":null,"name":"Phys.Org"},"author":"Ingrid Fadelli","title":"Imaging the Wigner crystal state in a new type of quantum material - Phys.org","description":"In some solid materials under specific conditions, mutual Coulomb interactions shape electrons into many-body correlated states, such as Wigner crystals, which are essentially solids made of electrons. So far, the Wigner crystal state remains sensitive to var…","url":"https://phys.org/news/2026-01-imaging-wigner-crystal-state-quantum.html","urlToImage":"https://scx2.b-cdn.net/gfx/news/hires/2026/imaging-the-wigner-cry.jpg","publishedAt":"2026-02-01T15:50:01Z","content":"In some solid materials under specific conditions, mutual Coulomb interactions shape electrons into many-body correlated states, such as Wigner crystals, which are essentially solids made of electron… [+7906 chars]"},{"source":{"id":null,"name":"Futurism"},"author":"Frank Landymore","title":"Galactic Monsters Grew in Cocoons Like Giant Bugs, Scientists Say - Futurism","description":"Astronomers say that ancient almost impossibly massive \"Little Red Dots\" may be black holes trapped in \"cocoons.\"","url":"http://futurism.com/space/james-webb-red-dots","urlToImage":"https://futurism.com/wp-content/uploads/2026/01/james-webb-red-dots_e58e15.jpg?quality=85&w=1200","publishedAt":"2026-02-01T15:30:00Z","content":"How the most massive objects in the universe first formed is one of the biggest headscratchers in astrophysics. With more advanced telescopes, astronomers have found fully formed galaxies and colossa… [+3842 chars]"},{"source":{"id":null,"name":"Indiandefencereview.com"},"author":"Evelyn Hart","title":"What Is the Farmer’s Walk and Why Everyone’s Using It to Build Strength and Improve Balance - Indian Defence Review","description":"An old-school strength move used by farmers is quietly revolutionizing modern fitness and rehab. Trainers, doctors, and elite athletes are all turning to this brutally simple exercise for results machines can’t match.","url":"https://indiandefencereview.com/farmers-walk-benefits-strength-balance-workout/","urlToImage":"https://indiandefencereview.com/wp-content/uploads/2026/02/the-simple-weighted-walk-thats-quietly-taking-over-gyms-scaled.jpg","publishedAt":"2026-02-01T15:17:00Z","content":"An old-world technique rooted in agricultural labor is quietly redefining how strength and endurance are being built in modern fitness and rehabilitation settings. Once confined to strongman contests… [+5816 chars]"},{"source":{"id":null,"name":"Futurism"},"author":"Victor Tangermann","title":"This Photo of Mars at Night Is Straight Up Haunting - Futurism","description":"An image taken by NASA's Curiosity rover shows its LED lights lighting up a hole it drilled into the surface of the rock.","url":"http://futurism.com/space/photo-mars-night-curiosity","urlToImage":"https://futurism.com/wp-content/uploads/2026/01/photo-mars-night-curiosity.jpg?quality=85&w=1200","publishedAt":"2026-02-01T14:45:00Z","content":"The length of a night on Mars isn’t too different from here on Earth, lasting just over 12 hours on average. Thanks to its similar axial tilt, it also experiences longer nights in winter and shorter … [+2288 chars]"},{"source":{"id":null,"name":"Phys.Org"},"author":"Liu Jia","title":"Multi-agent AI and robots automate materials discovery in closed-loop lab system - Phys.org","description":"Traditional processes used to discover new materials are complex, time-consuming, and costly, often requiring years of sustained effort. Recent advances in large language models (LLMs) have demonstrated powerful capabilities in information processing, offerin…","url":"https://phys.org/news/2026-01-multi-agent-ai-robots-automate.html","urlToImage":"https://scx2.b-cdn.net/gfx/news/2026/knowledge-driven-auton.jpg","publishedAt":"2026-02-01T14:00:01Z","content":"Traditional processes used to discover new materials are complex, time-consuming, and costly, often requiring years of sustained effort. Recent advances in large language models (LLMs) have demonstra… [+2310 chars]"},{"source":{"id":null,"name":"Space.com"},"author":"Anthony Wood","title":"The Pelican Nebula shines near the Las Vegas Strip in gorgeous deep space photo - Space","description":"The Pelican Nebula is located in the constellation Cygnus, the swan.","url":"https://www.space.com/stargazing/astrophotography/the-pelican-nebula-shines-near-the-las-vegas-strip-in-gorgeous-deep-space-photo","urlToImage":"https://cdn.mos.cms.futurecdn.net/54jbrhwnMTzhjPXePJcGcC-1920-80.jpg","publishedAt":"2026-02-01T14:00:00Z","content":"A section of the Pelican Nebula captured shining with stars from the constellation Cygnus. (Image credit: Jason Livingston)\r\nNASA network engineer and astrophotographer Jason Livingston\r\n has capture… [+3040 chars]"},{"source":{"id":null,"name":"Science Daily"},"author":null,"title":"“Existential risk” – Why scientists are racing to define consciousness - ScienceDaily","description":"Scientists warn that rapid advances in AI and neurotechnology are outpacing our understanding of consciousness, creating serious ethical risks. New research argues that developing scientific tests for awareness could transform medicine, animal welfare, law, a…","url":"https://www.sciencedaily.com/releases/2026/01/260131084626.htm","urlToImage":"https://www.sciencedaily.com/images/1920/enlightenment-psychedelic-consciousness.webp","publishedAt":"2026-02-01T13:51:33Z","content":"As artificial intelligence continues to advance and ethical concerns grow alongside it, scientists say the need to understand consciousness has reached a critical point.In a new review published in F… [+7370 chars]"},{"source":{"id":"the-times-of-india","name":"The Times of India"},"author":"TOI Science Desk","title":"Meet Vandi Verma: Indian-origin NASA scientist behind the first-ever AI-planned rover drive on Mars - The Times of India","description":"Science News: Vandi Verma has emerged as one of the key figures behind a landmark moment in planetary exploration. On December 8 and 10, 2025, NASA’s Perseverance s.","url":"https://timesofindia.indiatimes.com/science/meet-vandi-verma-indian-origin-nasa-scientist-behind-the-first-ever-ai-planned-rover-drive-on-mars/articleshow/127842512.cms","urlToImage":"https://static.toiimg.com/thumb/msid-127842534,width-1280,height-720,imgsize-978256,resizemode-6,overlay-toi_sw,pt-32,y_pad-600/photo.jpg","publishedAt":"2026-02-01T13:36:00Z","content":null}]}