{"status":"ok","totalResults":68,"articles":[{"source":{"id":"ars-technica","name":"Ars Technica"},"author":"Stephen Clark","title":"SpaceX’s next-gen Super Heavy booster aces four days of “cryoproof” testing - Ars Technica","description":"The next Starship flight is a key precursor for more ambitious missions.","url":"https://arstechnica.com/space/2026/02/spacexs-starbase-is-coming-alive-again-after-a-lull-in-starship-testing/","urlToImage":"https://cdn.arstechnica.net/wp-content/uploads/2026/02/b19proof1-1152x648.jpg","publishedAt":"2026-02-10T23:35:30Z","content":null},{"source":{"id":null,"name":"ScienceAlert"},"author":"David Nield","title":"Scientists Have Discovered a Protein That Reverses Brain Aging in The Lab - ScienceAlert","description":"Our brains age along with the rest of our bodies, and as they do, they produce fewer new brain cells.","url":"https://www.sciencealert.com/scientists-have-discovered-a-protein-that-reverses-brain-aging-in-the-lab","urlToImage":"https://www.sciencealert.com/images/2026/02/LargeNeuron.jpg","publishedAt":"2026-02-10T23:34:16Z","content":"Our brains age along with the rest of our bodies, and as they do, they produce fewer new brain cells. Now, researchers have found a key mechanism through which the typical age-related decline in neur… [+4106 chars]"},{"source":{"id":null,"name":"Space.com"},"author":"Samantha Mathewson","title":"Life on Earth is lucky: A rare chemical fluke may have made our planet habitable - Space","description":"Without the right oxygen balance, phosphorus and nitrogen vanish — and life can't take hold.","url":"https://www.space.com/space-exploration/search-for-life/life-on-earth-is-lucky-a-rare-chemical-fluke-may-have-made-our-planet-habitable","urlToImage":"https://cdn.mos.cms.futurecdn.net/A2zZsEd4niP9KVPJFpMyfH-1920-80.jpg","publishedAt":"2026-02-10T22:00:00Z","content":null},{"source":{"id":null,"name":"BGR"},"author":"Talia Roepel","title":"NASA's Artemis II Keeps Leaking Liquid Hydrogen, And It's Starting To Cause Problems - bgr.com","description":"Artemis II was set to launch in February, but a leaky situation has caused a delay. Find out about the challenges NASA is facing with this moon mission.","url":"https://www.bgr.com/2094400/nasa-artemis-ii-leaking-liquid-hydrogen-launch-delayed-march/","urlToImage":"https://www.bgr.com/img/gallery/nasas-artemis-ii-keeps-leaking-liquid-hydrogen-and-its-starting-to-cause-problems/l-intro-1770335046.jpg","publishedAt":"2026-02-10T21:17:00Z","content":"NASA Administrator Jared Isaacman took to X to release a statement about the incident on February 3, 2026. In his post, he stated that NASA is \"moving off the February launch window and targeting Mar… [+1091 chars]"},{"source":{"id":null,"name":"Space.com"},"author":"Julian Dossett","title":"Earth orbit is getting crowded. Can this map of 1 million routes around our planet help prevent satellite collisions? - Space","description":"\"You can try to predict the lifetime of the orbit.\"","url":"https://www.space.com/space-exploration/satellites/earth-orbit-is-getting-crowded-can-this-map-of-1-million-routes-around-our-planet-help-prevent-satellite-collisions","urlToImage":"https://cdn.mos.cms.futurecdn.net/c2QjJX5BNhp2gCcxA6Lwm5-877-80.jpg","publishedAt":"2026-02-10T20:00:00Z","content":null},{"source":{"id":null,"name":"KSL.com"},"author":"Mindy Weisberger, CNN","title":"Earth's core may contain as much as 45 oceans' worth of hydrogen, scientists find - KSL News","description":"Picture all of Earth's oceans, which cover about 70% of the planet and are mostly made of hydrogen. Now multiply that by nine. That may be the amount of hydrogen in Earth's core.","url":"https://www.ksl.com/article/51446212/earths-core-may-contain-as-much-as-45-oceans-worth-of-hydrogen-scientists-find","urlToImage":"https://img.ksl.com/slc/3143/314396/31439664.jpg?filter=kslv2/responsive_story_lg","publishedAt":"2026-02-10T18:41:33Z","content":"LONDON Picture all of Earth's oceans, which cover about 70% of the planet and are mostly made of hydrogen. Now multiply that by nine. That may be the amount of hydrogen in Earth's core, possibly maki… [+5931 chars]"},{"source":{"id":null,"name":"Live Science"},"author":"Skyler Ware","title":"Something supercharged Uranus with radiation during Voyager flyby 40 years ago. Scientists now know what. - Live Science","description":"Forty years ago, Voyager 2 flew past Uranus and observed radiation levels that defied explanation. Now, scientists may finally know exactly what happened.","url":"https://www.livescience.com/space/planets/something-supercharged-uranus-with-radiation-during-voyager-flyby-40-years-ago-scientists-now-know-what","urlToImage":"https://cdn.mos.cms.futurecdn.net/snJtQeCcxKGCHMaGiAwN7T-1920-80.jpg","publishedAt":"2026-02-10T18:10:50Z","content":null},{"source":{"id":null,"name":"ScienceAlert"},"author":"Universe Today","title":"NASA Rover Drove Across Mars Without Human Control For Two Days - ScienceAlert","description":"In December, NASA took another small, incremental step towards autonomous surface rovers.","url":"https://www.sciencealert.com/nasa-rover-drove-across-mars-without-human-control-for-two-days","urlToImage":"https://www.sciencealert.com/images/2026/02/nasa_perserverance_header.jpg","publishedAt":"2026-02-10T18:02:25Z","content":"In December, NASA took another small, incremental step towards autonomous surface rovers.\r\nIn a demonstration, the Perseverance team used AI to generate the rover's waypoints. Perseverance used the A… [+5425 chars]"},{"source":{"id":null,"name":"Newser"},"author":"Arden Dier","title":"A Little Poop Could Keep Deer From Damaging Forests - Newser","description":"Predator scents could offer low-cost aid for forest regeneration","url":"https://www.newser.com/story/383047/a-little-poop-could-keep-deer-from-damaging-forests.html","urlToImage":"https://img2-azrcdn.newser.com/image/1663975-12-20260210113548.jpeg","publishedAt":"2026-02-10T17:15:00Z","content":"Scientists say they've found a simple way to protect young trees from hungry deer: make them smell like a predator. In forests in southeastern Germany, researchers found that spreading lynx and wolf … [+1334 chars]"},{"source":{"id":null,"name":"Earth.com"},"author":null,"title":"Uranus' moon 'Miranda' seems to have an ocean and possibly life - Earth.com","description":"A recent study points to an exciting possibility: that Uranus's moon Miranda, located in the far reaches of our solar system, may harbor a hidden ocean and life.","url":"https://www.earth.com/news/uranus-moon-miranda-may-have-hidden-ocean-possibly-extraterrestrial-life/","urlToImage":"https://cff2.earth.com/uploads/2024/10/31120724/uranus_rings_miranda-moon_other-moons_jwst_nasa_1.jpg","publishedAt":"2026-02-10T16:50:51Z","content":"A recent study points to an exciting possibility: that Uranus’s moon Miranda, located in the far reaches of our solar system, may harbor a hidden sea beneath its icy crust, making it hospitable to ex… [+5456 chars]"},{"source":{"id":null,"name":"Gizmodo.com"},"author":"Margherita Bassi","title":"Scientists Spot First Known Lava Tube on Venus - Gizmodo","description":"Until now, lava tubes on the second planet were purely theoretical.","url":"https://gizmodo.com/scientists-spot-first-known-lava-tube-on-venus-2000720125","urlToImage":"https://gizmodo.com/app/uploads/2026/02/lava-tube-venus-1200x675.jpg","publishedAt":"2026-02-10T16:35:43Z","content":"Researchers had only hypothesized the existence of underground lava tubes on Venusuntil now.\r\nUsing decades-old radar data, a team of scientists in Italy has discovered an empty, subsurface lava tube… [+4161 chars]"},{"source":{"id":null,"name":"Phys.Org"},"author":"Sam Jarman","title":"Current flows without heat loss in newly engineered fractional quantum material - Phys.org","description":"A team of US researchers has unveiled a device that can conduct electricity along its fractionally charged edges without losing energy to heat. Described in Nature Physics, the work, led by Xiaodong Xu at the University of Washington, marks the first demonstr…","url":"https://phys.org/news/2026-02-current-loss-newly-fractional-quantum.html","urlToImage":"https://scx2.b-cdn.net/gfx/news/2026/current-flows-without.jpg","publishedAt":"2026-02-10T16:30:01Z","content":"A team of US researchers has unveiled a device that can conduct electricity along its fractionally charged edges without losing energy to heat. Described in Nature Physics, the work, led by Xiaodong … [+5624 chars]"},{"source":{"id":null,"name":"Phys.Org"},"author":"Columbia University","title":"Discovery of a possible pulsar in the Milky Way's center could enable unprecedented tests of General Relativity - Phys.org","description":"Researchers from Columbia University and Breakthrough Listen, a scientific research program aimed at finding evidence of civilizations beyond Earth, have published new results from the Breakthrough Listen Galactic Center Survey, one of the most sensitive radi…","url":"https://phys.org/news/2026-02-discovery-pulsar-milky-center-enable.html","urlToImage":"https://scx2.b-cdn.net/gfx/news/2026/researchers-announce-d.jpg","publishedAt":"2026-02-10T15:50:04Z","content":"Researchers from Columbia University and Breakthrough Listen, a scientific research program aimed at finding evidence of civilizations beyond Earth, have published new results from the Breakthrough L… [+3094 chars]"},{"source":{"id":null,"name":"Phys.Org"},"author":"The University of Hong Kong","title":"A possible first-ever Einstein probe observation of a black hole tearing apart a white dwarf - Phys.org","description":"On July 2, 2025, the China-led Einstein Probe (EP) space telescope detected an exceptionally bright X-ray source whose brightness varied rapidly during a routine sky survey. Its unusual signal immediately set it apart from ordinary cosmic sources, triggering …","url":"https://phys.org/news/2026-02-einstein-probe-black-hole-white.html","urlToImage":"https://scx2.b-cdn.net/gfx/news/2026/a-possible-first-ever.jpg","publishedAt":"2026-02-10T15:27:44Z","content":"On July 2, 2025, the China-led Einstein Probe (EP) space telescope detected an exceptionally bright X-ray source whose brightness varied rapidly during a routine sky survey. Its unusual signal immedi… [+6809 chars]"},{"source":{"id":null,"name":"IFLScience"},"author":"James Felton","title":"NASA's Lunar Orbiter May Have Spotted Long-Lost Luna 9 Spacecraft, 60 Years After It Vanished - IFLScience","description":"The spacecraft made history, returning the first images from the surface of the Moon. But its whereabouts have become a mystery, and 60 years passed without a sighting.","url":"https://www.iflscience.com/nasas-lunar-orbiter-may-have-spotted-long-lost-luna-9-spacecraft-60-years-after-it-vanished-82507","urlToImage":"https://assets.iflscience.com/assets/articleNo/82507/aImg/88994/moon-meta.png","publishedAt":"2026-02-10T15:09:09Z","content":"Astronomers believe they may have found the final resting place of Luna 9, the Soviet spacecraft missing since it landed on the Moon on February 3, 1966.On January 31, 1966, the Soviet Union launched… [+3651 chars]"},{"source":{"id":null,"name":"Phys.Org"},"author":"Field Museum","title":"Football-sized fossil creature may have been one of the first land animals to eat plants - Phys.org","description":"Life on Earth started in the oceans. Sometime around 475 million years ago, plants began making their way from the water onto the land, and it took another 100 million years for the first animals with backbones to join them. But for tens of millions of years,…","url":"https://phys.org/news/2026-02-football-sized-fossil-creature-animals.html","urlToImage":"https://scx2.b-cdn.net/gfx/news/hires/2026/football-sized-fossil.jpg","publishedAt":"2026-02-10T15:04:45Z","content":"Life on Earth started in the oceans. Sometime around 475 million years ago, plants began making their way from the water onto the land, and it took another 100 million years for the first animals wit… [+6797 chars]"},{"source":{"id":null,"name":"Esahubble.org"},"author":"information@eso.org","title":"Hubble captures light show around rapidly dying star - ESA/Hubble","description":"This stunning image from the NASA/ESA Hubble Space Telescope reveals a dramatic interplay of light and shadow in the Egg Nebula, sculpted by freshly ejected stardust. Located approximately 1,000 light-years away in the constellation Cygnus, the Egg Nebula fea…","url":"https://esahubble.org/news/heic2604/","urlToImage":"http://cdn.esahubble.org/archives/images/screen/heic2604a.jpg","publishedAt":"2026-02-10T15:04:34Z","content":"10 February 2026\r\nThis stunning image from the NASA/ESA Hubble Space Telescope reveals a dramatic interplay of light and shadow in the Egg Nebula, sculpted by freshly ejected stardust. Located approx… [+3907 chars]"},{"source":{"id":null,"name":"Phys.Org"},"author":"Tejasri Gururaj","title":"Machine learning reveals hidden landscape of robust information storage - Phys.org","description":"In a new study published in Physical Review Letters, researchers used machine learning to discover multiple new classes of two-dimensional memories, systems that can reliably store information despite constant environmental noise. The findings indicate that r…","url":"https://phys.org/news/2026-02-machine-reveals-hidden-landscape-robust.html","urlToImage":"https://scx2.b-cdn.net/gfx/news/hires/2026/machine-learning-revea.jpg","publishedAt":"2026-02-10T15:00:05Z","content":"In a new study published in Physical Review Letters, researchers used machine learning to discover multiple new classes of two-dimensional memories, systems that can reliably store information despit… [+9022 chars]"},{"source":{"id":null,"name":"Phys.Org"},"author":"Jeff Heinrich","title":"Mauled by a bear, 27,500 years ago: What a lavish teen burial reveals - Phys.org","description":"A teenager's skeleton lay supine in a shallow pit on a bed of red ocher, his remains adorned with several ivory pendants, four perforated antler batons, mammoth ivory pendants, and a flint blade, his skull decorated with hundreds of perforated shells and seve…","url":"https://phys.org/news/2026-02-mauled-years-lavish-teen-burial.html","urlToImage":"https://scx2.b-cdn.net/gfx/news/hires/2026/mauled-by-a-bear-27500.jpg","publishedAt":"2026-02-10T14:48:20Z","content":"A teenager's skeleton lay supine in a shallow pit on a bed of red ocher, his remains adorned with several ivory pendants, four perforated antler batons, mammoth ivory pendants, and a flint blade, his… [+5698 chars]"}]}