{"status":"ok","totalResults":64,"articles":[{"source":{"id":"wired","name":"Wired"},"author":"Jorge Garay","title":"Two Titanic Structures Hidden Deep Within the Earth Have Altered the Magnetic Field for Millions of Years - WIRED","description":"A team of geologists found for the first time evidence linking regions of low seismic velocity and the shape of the Earth’s magnetic field.","url":"https://www.wired.com/story/titanic-structures-earth-magnetic-field-millions-of-years/","urlToImage":"https://media.wired.com/photos/698514546f54668694781045/191:100/w_1280,c_limit/sci-earth-magneticfield-1349223076.jpg","publishedAt":"2026-02-05T23:58:00Z","content":"A team of geologists has found for the first time evidence that two ancient, continent-sized, ultrahot structures hidden beneath the Earth have shaped the planet's magnetic field for the past 265 mil… [+2830 chars]"},{"source":{"id":null,"name":"Gizmodo.com"},"author":"Lightspeed Magazine","title":"Doom Overtakes 3 Very Different Planets, Earth Included, in This Eerie Sci-Fi Short Story - Gizmodo","description":"Read 'Death Echoes Overlapping' by Megan Chee, courtesy of Lightspeed Magazine, right here on io9.","url":"https://gizmodo.com/doom-overtakes-3-very-different-planets-earth-included-in-this-eerie-sci-fi-short-story-2000716898","urlToImage":"https://gizmodo.com/app/uploads/2026/02/Feb2026_Lightspeed_io9-1200x675.jpg","publishedAt":"2026-02-05T23:00:33Z","content":"io9 is proud to present fiction from Lightspeed Magazine. Once a month, we feature a story from Lightspeeds current issue. This months selection is Death Echoes Overlapping by Megan Chee. Enjoy!\r\nDea… [+30026 chars]"},{"source":{"id":null,"name":"Gizmodo.com"},"author":"Passant Rabie","title":"A Possible Lunar Impact in 2032 Could Spark Days of Meteor Showers on Earth - Gizmodo","description":"The space rock has a 4.3% chance of striking the Moon in six years—and it could generate a flash nearly as bright as Venus.","url":"https://gizmodo.com/a-possible-lunar-impact-in-2032-could-spark-days-of-meteor-showers-on-earth-2000718658","urlToImage":"https://gizmodo.com/app/uploads/2025/09/asteroid-2024-yr4-1200x675.jpg","publishedAt":"2026-02-05T21:50:42Z","content":"A large rocky asteroid will make a close approach to Earth in 2032, with the tantalizing prospect of smashing directly into the Moon. If it does, the lunar impact is likely to produce a bright flash … [+2767 chars]"},{"source":{"id":null,"name":"NASA"},"author":"Jessica Taveau","title":"NASA Selects Two Earth System Explorers Missions - NASA (.gov)","description":"These two missions were selected for continued development as part of NASA’s Earth System Explorers Program, which conducts principal investigator-led Earth","url":"https://www.nasa.gov/news-release/nasa-selects-two-earth-system-explorers-missions/","urlToImage":"https://www.nasa.gov/wp-content/uploads/2022/02/nasa_meatball_large.jpg","publishedAt":"2026-02-05T21:22:30Z","content":"Two next-generation satellite missions announced Thursday will help NASA better understand Earth and improve capabilities to foresee environmental events and mitigate disasters.\r\nNASA uses the unique… [+3004 chars]"},{"source":{"id":null,"name":"Boing Boing"},"author":"Ellsworth Toohey","title":"The fantasy of starships is no more realistic than magic - Boing Boing","description":"Even at 1/10th light speed, a grain of sand hitting the hull would detonate with nuclear force.","url":"https://boingboing.net/2026/02/05/the-fantasy-of-starships-is-no-more-realistic-than-magic.html","urlToImage":"https://boingboing.net/wp-content/uploads/2026/02/bester.jpg","publishedAt":"2026-02-05T21:16:38Z","content":"Interstellar travel the kind in Star Trek, Star Wars, Dune will never happen. The fantasy \"exists on the exact same level of plausibility as wizards,\" argues Jason Pargin, author of John Dies at the … [+1889 chars]"},{"source":{"id":null,"name":"Phys.Org"},"author":"Foundational Questions Institute, FQXi","title":"VIP-2 experiment narrows the search for exotic physics beyond the Pauli exclusion principle - Phys.org","description":"The Pauli exclusion principle is a cornerstone of the Standard Model of particle physics and is essential for the structure and stability of matter. Now an international collaboration of physicists has carried out one of the most stringent experimental tests …","url":"https://phys.org/news/2026-02-vip-narrows-exotic-physics-pauli.html","urlToImage":"https://scx2.b-cdn.net/gfx/news/hires/2026/vip-2-experiment-narro-1.jpg","publishedAt":"2026-02-05T21:10:24Z","content":"The Pauli exclusion principle is a cornerstone of the Standard Model of particle physics and is essential for the structure and stability of matter. Now an international collaboration of physicists h… [+6276 chars]"},{"source":{"id":null,"name":"Space.com"},"author":"Chris McMullen","title":"The 10 bleakest space movies of all time - Space","description":"From spaghettified convicts to doomed interplanetary liners, these space movies really pile on the misery.","url":"https://www.space.com/entertainment/space-movies-shows/bleakest-space-movies-of-all-time","urlToImage":"https://cdn.mos.cms.futurecdn.net/EAnyKvTdAR2m93VHZwkbKT-1920-80.jpg","publishedAt":"2026-02-05T21:00:00Z","content":null},{"source":{"id":null,"name":"Phys.Org"},"author":"Brian Maffly","title":"When Earth's magnetic field took its time flipping - Phys.org","description":"Earth's magnetic field is generated by the churn of its liquid nickel-iron outer core, but it is not a constant feature. Every so often, the magnetic north and south poles swap places in what are called geomagnetic reversals, and the record of these flips is …","url":"https://phys.org/news/2026-02-earth-magnetic-field-flipping.html","urlToImage":"https://scx2.b-cdn.net/gfx/news/hires/2026/when-earths-magnetic-f.jpg","publishedAt":"2026-02-05T20:39:28Z","content":"Earth's magnetic field is generated by the churn of its liquid nickel-iron outer core, but it is not a constant feature. Every so often, the magnetic north and south poles swap places in what are cal… [+5704 chars]"},{"source":{"id":null,"name":"Popular Mechanics"},"author":"Darren Orf","title":"Scientists Drilled So Deep Into the Center of the Earth, They Knocked on the Mantle’s Door - Yahoo","description":"Scientists drilled the deepest core yet, reaching near Earth's mantle, uncovering unique geological samples and offering new insights into Earth's structure.","url":"https://www.popularmechanics.com/science/environment/a70259672/scientist-drilled-into-earths-mantle-door/","urlToImage":"https://s.yimg.com/ny/api/res/1.2/pV93IkXifrIAJ84RZl_ECQ--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02NzU7Y2Y9d2VicA--/https://media.zenfs.com/en/popular_mechanics_642/7eb1ef8733816bc258c3f2482cdd37af","publishedAt":"2026-02-05T18:58:00Z","content":"\"Hearst Magazines and Yahoo may earn commission or revenue on some items through these links.\"\r\nHeres what youll learn when you read this story:\r\n<ul><li>To understand the mantlethe largest layer of … [+3921 chars]"},{"source":{"id":"cnn","name":"CNN"},"author":"Katie Hunt","title":"New analysis suggests puzzling fossil may have been an unknown life-form - CNN","description":"A bizarre fossil called Prototaxites, which was the largest life-form on land 400 million years ago, may have been a completely unknown form of multicellular life, according to a new study.","url":"https://www.cnn.com/2026/02/05/science/prototaxites-fossil-analysis-unknown-life-form","urlToImage":"https://media.cnn.com/api/v1/images/stellar/prod/prototaxites.jpg?c=16x9&q=w_800,c_fill","publishedAt":"2026-02-05T18:51:04Z","content":"Some 400 million years ago, long before dinosaurs or even trees had evolved, an enigmatic organismtowered over the landscape like a prehistoric monolith.\r\nNow, new research makes the case that the an… [+4886 chars]"},{"source":{"id":null,"name":"Theregister.com"},"author":"Richard Speed","title":"Stash or splash? NASA asked for ISS deorbit alternatives - theregister.com","description":": What about storing it in high orbit?","url":"https://www.theregister.com/2026/02/05/iss_stash_or_splash/","urlToImage":"https://regmedia.co.uk/2020/11/11/iss.jpg","publishedAt":"2026-02-05T18:50:00Z","content":"US lawmakers have asked NASA to look into storing the International Space Station (ISS) in a higher orbit at the end of its operational life, instead of sending the structure hurtling into the ocean … [+2502 chars]"},{"source":{"id":null,"name":"NASA"},"author":"Nathan Cranford","title":"NASA’s SpaceX Crew-12 to Study Adaptation to Altered Gravity - NASA (.gov)","description":"NASA’s SpaceX Crew-12 mission is preparing to launch for a long-duration science mission aboard the International Space Station. During the mission, select","url":"https://www.nasa.gov/humans-in-space/nasas-spacex-crew-12-to-study-adaptation-to-altered-gravity/","urlToImage":"https://www.nasa.gov/wp-content/uploads/2026/02/55065874866-7c923a326a-k-1.png","publishedAt":"2026-02-05T18:38:08Z","content":"NASAs SpaceX Crew-12 mission is preparing to launch for a long-duration science mission aboard the International Space Station. During the mission, select crew members will participate in human healt… [+4273 chars]"},{"source":{"id":null,"name":"Gizmodo.com"},"author":"Passant Rabie","title":"Scientists Tried Drilling Into Antarctica’s ‘Doomsday Glacier,’ But the Ice Had Other Plans - Gizmodo","description":"A project that has been years in the making came to an early halt about 3,000 feet deep in the ice.","url":"https://gizmodo.com/scientists-tried-drilling-into-the-doomsday-glacier-but-the-ice-had-other-plans-2000718421","urlToImage":"https://gizmodo.com/app/uploads/2024/09/thwaites-doomsday-glacier-report.jpg","publishedAt":"2026-02-05T18:05:45Z","content":"One of Earth’s most dangerous glaciers has claimed a victim: a suite of instruments that became trapped deep within the ice.\r\nA team of researchers from the British Antarctic Survey (BAS) and the Kor… [+3504 chars]"},{"source":{"id":null,"name":"Phys.Org"},"author":"Rudy Molinek","title":"Understanding the hazard potential of the Seattle fault zone: It's 'pretty close to home' - Phys.org","description":"In the Pacific Northwest, big faults like the Cascadian subduction zone located offshore, get a lot of attention. But big faults aren't the only ones that pose significant hazards, and a new study investigates the dynamics of a complex fault zone that runs ri…","url":"https://phys.org/news/2026-02-hazard-potential-seattle-fault-zone.html","urlToImage":"https://scx2.b-cdn.net/gfx/news/hires/2026/understanding-the-haza.jpg","publishedAt":"2026-02-05T17:52:38Z","content":"In the Pacific Northwest, big faults like the Cascadian subduction zone located offshore, get a lot of attention. But big faults aren't the only ones that pose significant hazards, and a new study in… [+4412 chars]"},{"source":{"id":null,"name":"Gizmodo.com"},"author":"Gayoung Lee","title":"Daring Theory Challenges the Black Hole’s Reign Over the Milky Way’s Core - Gizmodo","description":"There is a lot we have yet to understand about the center of the Milky Way—could it be due to a mass of invisible dark matter?","url":"https://gizmodo.com/daring-theory-challenges-the-black-holes-reign-over-the-milky-ways-core-2000718499","urlToImage":"https://gizmodo.com/app/uploads/2026/02/chandra-sagittarius-a-star-e1770306832603-1200x675.jpg","publishedAt":"2026-02-05T17:20:43Z","content":"Astronomers have yet to fully grasp the Galactic Centerthe heart of the Milky Wayalthough theyre fairly certain that Sagittarius A*, a supermassive black hole, exists and dictates the cosmic objects … [+3695 chars]"},{"source":{"id":null,"name":"Live Science"},"author":"Harry Baker","title":"Martian meteorite that fell to Earth is full of ancient water, new scans reveal - Live Science","description":"A new study has revealed that the iconic Black Beauty meteorite contains much more hidden water than previously suspected. The rock, which fell to Earth from Mars, could reveal clues about the Red Planet's watery past.","url":"https://www.livescience.com/space/mars/martian-meteorite-that-fell-to-earth-is-full-of-ancient-water-new-scans-reveal","urlToImage":"https://cdn.mos.cms.futurecdn.net/8r2N3vPagy3U2oViZxDMSZ-1600-80.jpg","publishedAt":"2026-02-05T17:06:33Z","content":null},{"source":{"id":null,"name":"Forbes"},"author":"Zachary Folk","title":"Northern Lights Forecast: Aurora Could Be Visible From These Northern States Tonight - Forbes","description":"A coronal mass ejection could interact with the Earth, causing geomagnetic storms and making the aurora potentially visible further south.","url":"https://www.forbes.com/sites/zacharyfolk/2026/02/05/northern-lights-forecast-aurora-could-be-visible-from-these-northern-states-tonight/","urlToImage":"https://imageio.forbes.com/specials-images/imageserve/664373804e8820ac8d733cf2/0x0.jpg?format=jpg&height=900&width=1600&fit=bounds","publishedAt":"2026-02-05T16:38:39Z","content":"The northern lights could be visible from northern states along the U.S.-Canadian border on Thursday night, forecasters at the National Oceanic and Atmospheric Administration said, as a coronal mass … [+2676 chars]"}]}