{"status":"ok","totalResults":46,"articles":[{"source":{"id":null,"name":"Phys.Org"},"author":"Maddie Stove","title":"Physicists develop new method to measure universe's expansion rate - Phys.org","description":"We have known for several decades that the universe is expanding. Scientists use multiple techniques to measure the present-day expansion rate of the universe, known as the Hubble constant. These methods are internally consistent and based on the same physics…","url":"https://phys.org/news/2026-02-physicists-method-universe-expansion.html","urlToImage":"https://scx2.b-cdn.net/gfx/news/2026/illinois-and-uchicago.jpg","publishedAt":"2026-02-24T21:40:01Z","content":"We have known for several decades that the universe is expanding. Scientists use multiple techniques to measure the present-day expansion rate of the universe, known as the Hubble constant. These met… [+8715 chars]"},{"source":{"id":null,"name":"Phys.Org"},"author":"Sara Webb","title":"One of the biggest stars in the universe might be getting ready to explode - Phys.org","description":"One of the largest known stars in the universe underwent a dramatic transformation in 2014, new research shows, and may be preparing to explode. A study led by Gonzalo Muñoz-Sanchez at the National Observatory of Athens, published in Nature Astronomy today, a…","url":"https://phys.org/news/2026-02-biggest-stars-universe-ready.html","urlToImage":"https://scx2.b-cdn.net/gfx/news/hires/2026/one-of-the-biggest-sta.jpg","publishedAt":"2026-02-24T16:03:45Z","content":"One of the largest known stars in the universe underwent a dramatic transformation in 2014, new research shows, and may be preparing to explode. A study led by Gonzalo Muñoz-Sanchez at the National O… [+3829 chars]"},{"source":{"id":null,"name":"Futurism"},"author":"Victor Tangermann","title":"Huge Plume of Pollution Linked to Something That Will Not Make Elon Musk Happy - Futurism","description":"A SpaceX Falcon 9 upper stage belched a massive cloud of lithium and other pollutants roughly 62 miles over Europe upon reentry.","url":"http://futurism.com/space/plume-pollution-spacex-falcon-9-rocket","urlToImage":"https://futurism.com/wp-content/uploads/2026/02/plume-pollution-spacex-falcon-9-rocket.jpg?w=1200","publishedAt":"2026-02-24T16:01:31Z","content":"Just over a year ago, the upper stage of a SpaceX Falcon 9 rocket plummeted back to the ground after delivering 23 Starlink satellites to low-Earth orbit.\r\nIt was a routine mission, one out of hundre… [+3575 chars]"},{"source":{"id":null,"name":"Phys.Org"},"author":"Holly Ober","title":"Chemists thought phosphorus had shown all its cards—until it surprised them with a new move - Phys.org","description":"A discovery by UCLA organic chemists may one day put catalytic converter thieves out of business. In new research, they've used abundant, inexpensive phosphorus as a catalyst in chemical reactions that usually require precious metals like platinum, one of the…","url":"https://phys.org/news/2026-02-chemists-thought-phosphorus-shown-cards.html","urlToImage":"https://scx2.b-cdn.net/gfx/news/2026/chemists-thought-phosp.jpg","publishedAt":"2026-02-24T14:37:39Z","content":"A discovery by UCLA organic chemists may one day put catalytic converter thieves out of business. In new research, they've used abundant, inexpensive phosphorus as a catalyst in chemical reactions th… [+5004 chars]"},{"source":{"id":"ars-technica","name":"Ars Technica"},"author":"Jennifer Ouellette","title":"Here’s why Scotch tape screeches when it’s peeled - Ars Technica","description":"Micro-cracks travel along the peeling tape at supersonic speeds, producing shock waves and sound pulses.","url":"https://arstechnica.com/science/2026/02/heres-why-scotch-tape-screeches-when-its-peeled/","urlToImage":"https://cdn.arstechnica.net/wp-content/uploads/2026/02/scotch1-1152x648.jpg","publishedAt":"2026-02-24T14:00:17Z","content":null},{"source":{"id":null,"name":"PetaPixel"},"author":"Matt Growcoot","title":"Artemis II Astronauts Will Bring 10-Year-Old DSLRs With Them to the Moon - PetaPixel","description":"Mirrorless is being left on terra firma.","url":"https://petapixel.com/2026/02/24/artemis-ii-astronauts-will-bring-10-year-old-dslrs-with-them-to-the-moon/","urlToImage":"https://petapixel.com/assets/uploads/2026/02/Nikon-D5-Moon.jpg","publishedAt":"2026-02-24T13:56:34Z","content":"The big, bulky Nikon D5 powerhouse DSLR from 2016 will be Artemis II’s camera of choice.\r\nThe four Artemis II astronauts set to make history by traveling further away from Earth than any human in his… [+3220 chars]"},{"source":{"id":"cnn","name":"CNN"},"author":"Jackie Wattles","title":"A new problem throws four astronauts’ impending moon journey into uncertainty - CNN","description":"NASA’s efforts to get the Artemis II mission off the ground have stalled once again, as engineers navigate a new issue with the rocket set to launch four astronauts around the moon.","url":"https://www.cnn.com/2026/02/24/science/artemis-2-roll-back-launch-date","urlToImage":"https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-2259771347.jpg?c=16x9&q=w_800,c_fill","publishedAt":"2026-02-24T13:46:16Z","content":"Efforts to get NASAs historic moon mission off the ground have stalled once again, as engineers navigate a new issue with the rocket set to propel four astronauts on an unprecedented path.\r\nThe agenc… [+6831 chars]"},{"source":{"id":null,"name":"WION"},"author":null,"title":"Scientist claims heaven lies in the physical universe, and tells its EXACT location - WION","description":"A scientist has claimed the place we cannot see beyond the observable universe is where heaven could be located. This place begins from where the Cosmic Horizon ends. However, critics have dismissed his theory.","url":"https://www.wionews.com/trending/scientist-claims-heaven-lies-in-the-physical-universe-and-tells-its-exact-location-1771939781638","urlToImage":"https://cdn1.wionews.com/prod/wion/images/2026/20260224/image-1771940388571.png?imwidth=1200&imheight=900","publishedAt":"2026-02-24T13:40:00Z","content":"A scientist has suggested that heaven might be a physical place in the universe and has even theorised its location. According to Michael Guillén, PhD, a former Harvard physics lecturer and science c… [+2533 chars]"},{"source":{"id":null,"name":"Space.com"},"author":"Daisy Dobrijevic","title":"Where to see the total lunar eclipse in the early hours of March 3 - Space","description":"The March 2026 total lunar eclipse will bring a dramatic blood moon to skies across North America, Australia, New Zealand and eastern Asia — if you know where to look.","url":"https://www.space.com/stargazing/lunar-eclipses/where-to-see-the-total-lunar-eclipse-in-the-early-hours-of-march-3","urlToImage":"https://cdn.mos.cms.futurecdn.net/SfZ5DjBjbBU8gyBgqdSGBF-1024-80.jpg","publishedAt":"2026-02-24T11:00:00Z","content":null},{"source":{"id":null,"name":"Space.com"},"author":"Jamie Carter","title":"Night sky tonight (Feb. 24) — See a half-lit moon grace the late winter sky - Space","description":"The night sky is full of wonder. Here's what to look out for tonight.","url":"https://www.space.com/news/live/night-sky-what-you-can-see-tonight-feb-24-2026","urlToImage":"https://cdn.mos.cms.futurecdn.net/5X2sZoxaezNcaBdxcUyizS-1920-80.jpg","publishedAt":"2026-02-24T10:43:01Z","content":"2026-02-24T10:43:01.756ZTuesday, Feb. 24: First-quarter perigee moon (after dark)\r\nSee the first quarter moon high in the south on Feb. 24. (Image credit: Dr K Kar via Getty Images)\r\nThe moon\r\n reach… [+50960 chars]"},{"source":{"id":null,"name":"Science Daily"},"author":null,"title":"Scientists engineer bacteria to eat cancer tumors from the inside out - ScienceDaily","description":"Researchers are engineering bacteria to invade tumors and consume them from the inside. Because tumor cores lack oxygen, they’re the perfect breeding ground for these microbes. The team added a genetic tweak that helps the bacteria survive longer near oxygen-…","url":"https://www.sciencedaily.com/releases/2026/02/260224023101.htm","urlToImage":"https://www.sciencedaily.com/images/1920/destroying-cancer-tumor-from-inside.webp","publishedAt":"2026-02-24T08:43:38Z","content":"Scientists at the University of Waterloo are working on a new cancer treatment that uses specially engineered bacteria to consume tumors from the inside. The strategy relies on microbes that naturall… [+3426 chars]"},{"source":{"id":null,"name":"Earth.com"},"author":null,"title":"Remote volcano is waking up after being dormant for 700,000 years - Earth.com","description":"Taftan volcano in southeastern Iran rose 3.5 inches over 10 months, signaling that it is waking up after 700,000 years of dormancy.","url":"https://www.earth.com/news/remote-vocano-taftan-iran-wakes-up-after-700000-year-dormancy/","urlToImage":"https://cff2.earth.com/uploads/2026/01/21131242/taftan-volcano_iran_wakes-up_700000-years-dormancy_1m.jpg","publishedAt":"2026-02-24T08:08:18Z","content":"A volcano in southeastern Iran has nudged upward by about 3.5 inches (9 centimeters) in 10 months. This might sound like a small rise but it has big significance. \r\nA new study used satellite data to… [+6398 chars]"},{"source":{"id":null,"name":"Live Science"},"author":"Harry Baker","title":"Incomplete remains of world's 'youngest' impact crater spotted lurking in Chinese forest — Earth from space - Live Science","description":"A 2021 satellite photo shows off the recently uncovered Yilan crater in China, which is most likely the youngest impact structure on Earth. The incomplete ring is also the largest of its kind and only the second impact crater ever found in the country.","url":"https://www.livescience.com/planet-earth/geology/incomplete-remains-of-worlds-youngest-impact-crater-spotted-lurking-in-chinese-forest-earth-from-space","urlToImage":"https://cdn.mos.cms.futurecdn.net/3s9zU9JVeUyFg8uGadFRxg-1600-80.jpg","publishedAt":"2026-02-24T08:00:00Z","content":null},{"source":{"id":null,"name":"SciTechDaily"},"author":null,"title":"Scientists Create Chip That Generates Brand-New Colors of Light, Cracking a Decades-Old Nonlinear Optics Challenge - SciTechDaily","description":"By harnessing two natural timescales in resonator arrays, researchers created photonic chips that reliably produce multiple harmonics without active compensation. For decades, scientists and engineers have steadily advanced technologies that control and manip…","url":"https://scitechdaily.com/scientists-create-chip-that-generates-brand-new-colors-of-light-cracking-a-decades-old-nonlinear-optics-challenge/","urlToImage":"https://scitechdaily.com/images/JQI-Photonic-Chip-Frequency-Conversion.jpg","publishedAt":"2026-02-24T04:55:02Z","content":"Researchers at JQI have designed and tested new chips that reliably convert one color of light (represented by the orange pulse in the lower left corner of the image above) into many colors (represen… [+12239 chars]"},{"source":{"id":null,"name":"Sci.news"},"author":"Enrico de Lazaro","title":"New Sauropod Dinosaur Species Identified in Brazil - Sci.News","description":"Paleontologists in Brazil have identified a previously unknown species of somphospondylan sauropod dinosaur with European affinities, hinting at ancient migration routes that once linked two continents now separated by the Atlantic Ocean.","url":"https://www.sci.news/paleontology/dasosaurus-tocantinensis-14577.html","urlToImage":"https://cdn.sci.news/images/2026/02/image_14577-Dasosaurus-tocantinensis.jpg","publishedAt":"2026-02-24T00:40:34Z","content":"Paleontologists in Brazil have identified a previously unknown species of somphospondylan sauropod dinosaur with European affinities, hinting at ancient migration routes that once linked two continen… [+2585 chars]"},{"source":{"id":null,"name":"SlashGear"},"author":"Syeda Laiba Alam","title":"13 Of The Coolest Vintage Motorcycle Helmets You Can Buy Today - SlashGear","description":"Motorcycle helmets can be just as stylish as motorcycles themselves, and looking to the aesthetics of the past shows there's plenty of variety on offer.","url":"https://www.slashgear.com/2105719/coolest-vintage-motorcycle-helmets-buy-today/","urlToImage":"https://www.slashgear.com/img/gallery/13-of-the-coolest-vintage-motorcycle-helmets-you-can-buy-today/l-intro-1771549841.jpg","publishedAt":"2026-02-23T23:30:00Z","content":"The Epicurist by Hedon is a premium retro-style motorcycle helmet with an open-face design. Available in three colors Signature Black, Glass Ash, and Knight White the helmet is priced at $599 on the … [+962 chars]"},{"source":{"id":null,"name":"Phys.Org"},"author":"King's College London","title":"A new form of aluminum unlocks sustainable and cheaper catalysts - Phys.org","description":"A research team at King's College London has isolated a new form of aluminum—a highly abundant metal, that could provide a far cheaper and more sustainable alternative to commonly used rare earth metals. Dr. Clare Bakewell, Senior Lecturer in the Department o…","url":"https://phys.org/news/2026-02-aluminum-sustainable-cheaper-catalysts.html","urlToImage":"https://scx2.b-cdn.net/gfx/news/hires/2026/scientists-create-sust.jpg","publishedAt":"2026-02-23T21:48:15Z","content":"A research team at King's College London has isolated a new form of aluminuma highly abundant metal, that could provide a far cheaper and more sustainable alternative to commonly used rare earth meta… [+3518 chars]"},{"source":{"id":null,"name":"ExtremeTech"},"author":"Graham Templeton","title":"James Webb Telescope Takes a First Peek Inside Uranus - extremetech.com","description":"The planet's upper atmosphere has been mapped for the first time, revealing one of the solar system's most enigmatic members.","url":"https://www.extremetech.com/science/james-webb-telescope-takes-a-first-peek-inside-uranus","urlToImage":"https://i.extremetech.com/imagery/content-types/06W9k8jtZ5xLnZnwCSdrtT5/hero-image.fill.size_1200x675.jpg","publishedAt":"2026-02-23T21:39:00Z","content":"The European Space Agency announced Thursday that a study using the joint NASA/ESA-built James Webb Space Telescope has peered into Uranus's upper atmosphere. It's an important first step in revealin… [+2019 chars]"},{"source":{"id":null,"name":"Indiandefencereview.com"},"author":"Rania Hadid","title":"Archaeologists Discover Mysterious Collections of Animal Skulls in Neanderthal Cave - Indian Defence Review","description":"Archaeologists have uncovered mysterious collections of animal skulls in a Neanderthal cave, raising new questions about their rituals and symbolic practices.","url":"https://indiandefencereview.com/collections-animal-skulls-neanderthal-cave/","urlToImage":"https://indiandefencereview.com/wp-content/uploads/2026/02/archaeologists-discover-mysterious-collections-of-animal-skulls-in-neanderthal-cave-scaled.png","publishedAt":"2026-02-23T21:30:00Z","content":"Archaeologists recently unearthed a series of animal skulls in a Neanderthal cave in Spain, sparking new questions about the rituals and symbolic practices of early humans. The skulls, some of which … [+5354 chars]"},{"source":{"id":null,"name":"NASA"},"author":"Lee Mohon","title":"Young ‘Sun’ Caught Blowing Bubbles by NASA’s Chandra - NASA (.gov)","description":"For the first time, a much younger version of the Sun has been caught red-handed blowing bubbles in the galaxy, by astronomers using NASA’s Chandra X-ray","url":"https://www.nasa.gov/missions/chandra/young-sun-caught-blowing-bubbles-by-nasas-chandra/","urlToImage":"https://www.nasa.gov/wp-content/uploads/2026/02/astrosphere-xray-infrared.jpg","publishedAt":"2026-02-23T20:07:28Z","content":"For the first time, a much younger version of the Sun has been caught red-handed blowing bubbles in the galaxy, by astronomers using NASAs Chandra X-ray Observatory.\r\nThe bubble called an astrosphere… [+7487 chars]"}]}