{"status":"ok","totalResults":57,"articles":[{"source":{"id":null,"name":"Phys.Org"},"author":"Thais Szegö","title":"Biofilm made from fish skin could be a sustainable alternative for food packaging - Phys.org","description":"Using the skin of an Amazonian fish known as tambatinga as the raw material, researchers at the University of São Paulo (USP) and EMBRAPA Pecuária Sudeste—a decentralized unit of the Brazilian Agricultural Research Corporation (EMBRAPA) located in São Carlos,…","url":"https://phys.org/news/2026-02-biofilm-fish-skin-sustainable-alternative.html","urlToImage":"https://scx2.b-cdn.net/gfx/news/2026/biofilm-made-from-fish.jpg","publishedAt":"2026-02-09T23:20:03Z","content":"Using the skin of an Amazonian fish known as tambatinga as the raw material, researchers at the University of São Paulo (USP) and EMBRAPA Pecuária Sudestea decentralized unit of the Brazilian Agricul… [+3405 chars]"},{"source":{"id":null,"name":"Phys.Org"},"author":"Johannes Seiler","title":"Stellar remnants may solve mystery of missing mass in galaxy clusters - Phys.org","description":"Under the leadership of the University of Bonn, a research team led by Prof. Dr. Pavel Kroupa from the Helmholtz Institute for Radiation and Nuclear Physics has discovered that galaxy clusters are about twice as heavy as previously assumed. The additional mas…","url":"https://phys.org/news/2026-02-stellar-remnants-mystery-mass-galaxy.html","urlToImage":"https://scx2.b-cdn.net/gfx/news/hires/2026/galaxy-cluster.jpg","publishedAt":"2026-02-09T23:00:04Z","content":"Under the leadership of the University of Bonn, a research team led by Prof. Dr. Pavel Kroupa from the Helmholtz Institute for Radiation and Nuclear Physics has discovered that galaxy clusters are ab… [+2341 chars]"},{"source":{"id":null,"name":"Gizmodo.com"},"author":"Ellyn Lapointe","title":"Deja Vu at the SLS Launchpad: Why Can’t NASA Shake Its Hydrogen Leak Curse? - Gizmodo","description":"Why is this still a problem?","url":"https://gizmodo.com/deja-vu-at-the-sls-launchpad-why-cant-nasa-shake-its-hydrogen-leak-curse-2000719899","urlToImage":"https://gizmodo.com/app/uploads/2026/02/Artemis-2-rocket-moon-1200x675.jpg","publishedAt":"2026-02-09T22:05:45Z","content":"During the lead-up to NASAs Artemis 1 mission back in 2022, recurring hydrogen leaks led to significant delays and a cancelled launch attempt. The agency had three years to address the underlying iss… [+3429 chars]"},{"source":{"id":null,"name":"Space.com"},"author":"Robert Z. Pearlman","title":"How long will the ISS operate with a skeleton crew? SpaceX’s Crew-12 astronaut mission delayed to Feb. 12 - Space","description":"If cleared, the launch to the International Space Station would proceed from Cape Canaveral at 5:38 a.m. ET on Thursday (Feb. 12).","url":"https://www.space.com/space-exploration/launches-spacecraft/how-long-will-the-iss-operate-with-a-skeleton-crew-spacexs-crew-12-astronaut-mission-delayed-to-feb-12","urlToImage":"https://cdn.mos.cms.futurecdn.net/PA9iXux9YXhFBQZ4ox6SJX-1920-80.jpg","publishedAt":"2026-02-09T21:00:00Z","content":null},{"source":{"id":null,"name":"Phys.Org"},"author":"Pennsylvania State University","title":"Building blocks of life discovered in Bennu asteroid rewrite origin story - Phys.org","description":"Amino acids, the building blocks necessary for life, were previously found in samples of 4.6-billion-year-old rocks from an asteroid called Bennu, delivered to Earth in 2023 by NASA's OSIRIS-REx mission. How those amino acids—the molecules that create protein…","url":"https://phys.org/news/2026-02-blocks-life-bennu-asteroid-rewrite.html","urlToImage":"https://scx2.b-cdn.net/gfx/news/hires/2026/building-blocks-of-lif.jpg","publishedAt":"2026-02-09T20:20:42Z","content":"Amino acids, the building blocks necessary for life, were previously found in samples of 4.6-billion-year-old rocks from an asteroid called Bennu, delivered to Earth in 2023 by NASA's OSIRIS-REx miss… [+5974 chars]"},{"source":{"id":null,"name":"Phys.Org"},"author":"Queen Mary, University of London","title":"Nature's 'engine is grinding to a halt' as climate change gains pace, says study - Phys.org","description":"Many ecologists hypothesize that, as global warming accelerates, change in nature must speed up. They assume that as temperatures rise and climatic zones shift, species will face local extinction and colonize new habitats at an ever-increasing rate, leading t…","url":"https://phys.org/news/2026-02-nature-halt-climate-gains-pace.html","urlToImage":"https://scx2.b-cdn.net/gfx/news/hires/2026/this-engine-is-grindin.jpg","publishedAt":"2026-02-09T19:58:22Z","content":"Many ecologists hypothesize that, as global warming accelerates, change in nature must speed up. They assume that as temperatures rise and climatic zones shift, species will face local extinction and… [+3984 chars]"},{"source":{"id":null,"name":"Live Science"},"author":"Harry Baker","title":"New 'sungrazing' comet could become visible to the naked eye during the day — if the sun doesn't destroy it - Live Science","description":"The newly discovered sungrazing comet C/2026 A1 (MAPS) will undergo an extremely close slingshot around our star in early April, and could become bright enough to be seen without a telescope during the day.","url":"https://www.livescience.com/space/comets/new-sungrazing-comet-could-become-visible-to-the-naked-eye-during-the-day-if-the-sun-doesnt-destroy-it","urlToImage":"https://cdn.mos.cms.futurecdn.net/m9cQPWiob8oBC98UXc3b7X-1600-80.jpg","publishedAt":"2026-02-09T19:53:30Z","content":null},{"source":{"id":null,"name":"Phys.Org"},"author":"Madeleine Gregory","title":"Satellite record shows boreal forests expanded 12% and shifted north since 1985 - Phys.org","description":"The boreal forest—the world's largest terrestrial biome—is warming faster than any other forest type. To understand the changing dynamics of boreal forests, Min Feng and colleagues analyzed the biome from 1985 to 2020, leveraging the longest and highest-resol…","url":"https://phys.org/news/2026-02-satellite-boreal-forests-shifted-north.html","urlToImage":"https://scx2.b-cdn.net/gfx/news/hires/2026/boreal-forests-are-shi.jpg","publishedAt":"2026-02-09T18:50:01Z","content":"The boreal forestthe world's largest terrestrial biomeis warming faster than any other forest type. To understand the changing dynamics of boreal forests, Min Feng and colleagues analyzed the biome f… [+2097 chars]"},{"source":{"id":null,"name":"Earth.com"},"author":null,"title":"Study claims the massive ocean on Jupiter's moon Europa is more likely 'dead' than teeming with life - Earth.com","description":"Europa has a deep ocean, but a new study suggests its seafloor may be too quiet to supply the energy life needs to survive.","url":"https://www.earth.com/news/jupiter-moon-europa-vast-ocean-may-lack-the-energy-to-support-life/","urlToImage":"https://cff2.earth.com/uploads/2026/01/11080842/Europa-ocean-life.jpg","publishedAt":"2026-02-09T18:47:20Z","content":"Europa has long stood out as a prime place to search for life beyond Earth, thanks to the global ocean hidden beneath its cracked ice shell. But water alone is not enough – life also needs energy.\r\nA… [+5040 chars]"},{"source":{"id":null,"name":"Columbia.edu"},"author":null,"title":"Researchers Announce Discovery of a Possible Pulsar in the Milky Way’s Center - Columbia University","description":"Confirming a pulsar star would enable unprecedented tests of General Relativity. Such a discovery would revolutionize physics.","url":"https://news.columbia.edu/news/researchers-announce-discovery-possible-pulsar-milky-ways-center","urlToImage":"https://news.columbia.edu/sites/news.columbia.edu/files/content/2026/pulsar-galactic-center.jpeg","publishedAt":"2026-02-09T18:16:17Z","content":"Any external influence on a pulsar, such as the gravitational pull of a massive object, would introduce anomalies in this steady arrival of pulses, which can be measured and modeled, said Slavko Bogd… [+1027 chars]"},{"source":{"id":null,"name":"Phys.Org"},"author":"Christoph Elhardt","title":"Why only a small number of planets are suitable for life - Phys.org","description":"For life to develop on a planet, certain chemical elements are needed in sufficient quantities. Phosphorus and nitrogen are essential. Phosphorus is vital for the formation of DNA and RNA, which store and transmit genetic information, and for the energy balan…","url":"https://phys.org/news/2026-02-small-planets-suitable-life.html","urlToImage":"https://scx2.b-cdn.net/gfx/news/hires/2026/why-only-a-small-numbe-1.jpg","publishedAt":"2026-02-09T18:12:42Z","content":"For life to develop on a planet, certain chemical elements are needed in sufficient quantities. Phosphorus and nitrogen are essential. Phosphorus is vital for the formation of DNA and RNA, which stor… [+4613 chars]"},{"source":{"id":null,"name":"ScienceAlert"},"author":"Universe Today","title":"Massive Survey of Runaway Stars Reveals a Surprise About Their Origin - ScienceAlert","description":"In the early 1960s, Dutch astronomer Adriaan Blaauw observed stars moving at unusually high speeds moving through the Milky Way.","url":"https://www.sciencealert.com/massive-survey-of-runaway-stars-reveals-a-surprise-about-their-origin","urlToImage":"https://www.sciencealert.com/images/2026/02/galaxy_arrows_runaway_stars_header.jpg","publishedAt":"2026-02-09T18:03:33Z","content":"In the early 1960s, Dutch astronomer Adriaan Blaauw observed stars moving at unusually high speeds moving through the Milky Way. These stars, as it turned out, were unbound objects that had been kick… [+5078 chars]"},{"source":{"id":null,"name":"Phys.Org"},"author":"Brookhaven National Laboratory","title":"A smashing success: Relativistic Heavy Ion Collider wraps up final collisions - Phys.org","description":"Just after 9 a.m. on Friday, Feb. 6, 2026, final beams of oxygen ions—oxygen atoms stripped of their electrons—circulated through the twin 2.4-mile-circumference rings of the Relativistic Heavy Ion Collider (RHIC) and crashed into one another at nearly the sp…","url":"https://phys.org/news/2026-02-success-relativistic-heavy-ion-collider.html","urlToImage":"https://scx2.b-cdn.net/gfx/news/2026/a-smashing-success-rel.jpg","publishedAt":"2026-02-09T18:00:23Z","content":"Just after 9 a.m. on Friday, Feb. 6, 2026, final beams of oxygen ionsoxygen atoms stripped of their electronscirculated through the twin 2.4-mile-circumference rings of the Relativistic Heavy Ion Col… [+15029 chars]"},{"source":{"id":null,"name":"Aps.org"},"author":null,"title":"Seeing the Quantum Butterfly Effect - American Physical Society","description":"A combined experimental and theoretical study reveals the emergence of quantum chaos in a complex system, suggesting that it can be described with a universal theoretical framework.","url":"https://physics.aps.org/articles/v19/12","urlToImage":"https://physics.aps.org/assets/ffea342a-48b0-4af2-94a1-f33e06103f97/e12_2_thumb.png","publishedAt":"2026-02-09T18:00:00Z","content":"Figure 1: Illustration of the experimental setup. A system of coupled nuclear spins evolves forward in time (blue horizontal arrow), undergoes a spin rotation by an angle 𝜑\r\n, and then evolves backw… [+9704 chars]"},{"source":{"id":null,"name":"Medium"},"author":"Avi Loeb","title":"Discovery of Two New Interstellar-Meteor Candidates - Avi Loeb – Medium","description":"In a new paper that I co-authored with my brilliant postdoc Richard Cloete, available here, we report the identification of two previously…","url":"https://avi-loeb.medium.com/discovery-of-two-new-interstellar-meteor-candidates-7d03a1b9e87a","urlToImage":"https://miro.medium.com/v2/resize:fit:980/1*-PjU6vDkHh77cAUw-5PFLA.avif","publishedAt":"2026-02-09T17:58:42Z","content":"(Image credit: Pete Saloutos/Getty Images)\r\nIn a new paper that I co-authored with my brilliant postdoc Richard Cloete, available here, we report the identification of two previously unrecognized int… [+9054 chars]"},{"source":{"id":null,"name":"Phys.Org"},"author":"Louise Lerner","title":"In Antarctica, balloon lands after 23-day search for particles from outer space - Phys.org","description":"After years of work building an exquisitely sensitive instrument, University of Chicago scientists stood and watched as it flew up and out of sight into the fiercely blue Antarctic sky. Launched on Dec. 20, it would travel for the next 23 days on a NASA ballo…","url":"https://phys.org/news/2026-02-antarctica-balloon-day-particles-outer.html","urlToImage":"https://scx2.b-cdn.net/gfx/news/hires/2026/in-antarctica-balloon.jpg","publishedAt":"2026-02-09T17:43:22Z","content":"After years of work building an exquisitely sensitive instrument, University of Chicago scientists stood and watched as it flew up and out of sight into the fiercely blue Antarctic sky. Launched on D… [+8937 chars]"},{"source":{"id":null,"name":"Phys.Org"},"author":"Phys.org","title":"Physicists clarify key mechanism behind energy release in molybdenum-93 - Phys.org","description":null,"url":"https://phys.org/news/2026-02-physicists-key-mechanism-energy-molybdenum.html","urlToImage":null,"publishedAt":"2026-02-09T17:00:06Z","content":null},{"source":{"id":null,"name":"The Daily Galaxy --Great Discoveries Channel"},"author":"Sarah Jones","title":"Dinosaurs Were Speed Demons, New Fossil Footprints Prove They Could Sprint Like Athletes! - The Daily Galaxy","description":"Dinosaurs weren't just about size and strength; some of them were also incredibly fast. Recent footprints discovered in Mongolia have revealed just how quick these creatures could really move.","url":"https://dailygalaxy.com/2026/02/footprints-fossils-reveal-dinosaur-speed/","urlToImage":"https://dailygalaxy.com/wp-content/uploads/2026/02/Dinosaurs-Were-Speed-Demons-New-Fossil-Footprints-Prove-They-Could-Sprint-Like-Athletes-scaled.jpg","publishedAt":"2026-02-09T16:45:00Z","content":"Newly discovered fossilized footprints in Mongolia reveal that some dinosaurs could run at speeds rivaling top cyclists. This surprising discovery is changing how scientists think about dinosaur move… [+2764 chars]"},{"source":{"id":null,"name":"Live Science"},"author":"Harry Baker","title":"Impossibly powerful 'ghost particle' that slammed into Earth may have come from an exploding black hole — and it could upend both particle physics and cosmology - Live Science","description":"A supercharged neutrino that smashed into our planet in 2023 may have been spit out by an exploding primordial black hole with a \"dark charge.\" If true, this theory could lead to a definitive catalog of all subatomic particles and unveil the elusive identity …","url":"https://www.livescience.com/space/black-holes/impossibly-powerful-ghost-particle-that-slammed-into-earth-may-have-come-from-an-exploding-black-hole-and-it-could-upend-both-particle-physics-and-cosmology","urlToImage":"https://cdn.mos.cms.futurecdn.net/fh9Psvca9EPcoHRhCgHTq-1600-80.jpg","publishedAt":"2026-02-09T16:26:18Z","content":null},{"source":{"id":null,"name":"Phys.Org"},"author":"Sanjukta Mondal","title":"Scientists harness nature's chirality bias to design series of complex mechanically interlocked molecules - Phys.org","description":"In nature, molecules often show a strong preference for partnering with other molecules that share the same chirality or handedness. A behavior that is quite evident in the phenomenon known as homochirality-driven entanglement, where molecules that are all le…","url":"https://phys.org/news/2026-02-scientists-harness-nature-chirality-bias.html","urlToImage":"https://scx2.b-cdn.net/gfx/news/hires/2026/scientists-harness-nat.jpg","publishedAt":"2026-02-09T16:20:05Z","content":"In nature, molecules often show a strong preference for partnering with other molecules that share the same chirality or handedness. A behavior that is quite evident in the phenomenon known as homoch… [+5136 chars]"}]}