{"status":"ok","totalResults":63,"articles":[{"source":{"id":null,"name":"ScienceAlert"},"author":"The Conversation","title":"Runaway Black Holes Are Real After All. Here's What We Know. - ScienceAlert","description":"Last year, astronomers were fascinated by a runaway asteroid passing through our Solar System from somewhere far beyond.","url":"https://www.sciencealert.com/runaway-black-holes-are-real-after-all-heres-what-we-know","urlToImage":"https://www.sciencealert.com/images/2026/02/black_hole_in_the_sky_header.jpg","publishedAt":"2026-02-08T01:01:27Z","content":"Last year, astronomers were fascinated by a runaway asteroid passing through our Solar System from somewhere far beyond. It was moving at around 68 kilometres per second, just over double Earth's spe… [+5740 chars]"},{"source":{"id":null,"name":"Spaceflight Now"},"author":null,"title":"SpaceX launches return to flight Falcon 9 mission following brief stand down - Spaceflight Now","description":null,"url":"https://spaceflightnow.com/2026/02/07/live-coverage-spacex-to-launch-return-to-flight-falcon-9-mission-following-brief-stand-down/","urlToImage":null,"publishedAt":"2026-02-07T22:06:54Z","content":"A SpaceX Falcon 9 rocket lifts off from Space Launch Complex 4 East (SLC-4E) at Vandenberg Space Force Base on Feb. 7, 2026. This mission marked a return to flight for the Falcon 9 rocket following a… [+6405 chars]"},{"source":{"id":null,"name":"Phys.Org"},"author":"ByOlivia Dimmer","title":"How eggs get built: Cells use actin and microtubules as a coordinated scaffold - Phys.org","description":"A Northwestern Medicine study has shed light on one of the most intricate construction projects in biology: how cells build and coordinate the internal scaffolding needed to create a healthy egg. The research, published in the Journal of Cell Biology, details…","url":"https://phys.org/news/2026-02-eggs-built-cells-actin-microtubules.html","urlToImage":"https://scx2.b-cdn.net/gfx/news/hires/2026/cells-systems-cooperat.jpg","publishedAt":"2026-02-07T21:00:04Z","content":"A Northwestern Medicine study has shed light on one of the most intricate construction projects in biology: how cells build and coordinate the internal scaffolding needed to create a healthy egg. The… [+3730 chars]"},{"source":{"id":null,"name":"ScienceAlert"},"author":"Tessa Koumoundouros","title":"When Termites Became Monogamous, A Surprising Thing Happened to Their Sperm - ScienceAlert","description":"Termites reveal a startling consequence of long-term monogamy – the resulting lack of competition between the reproductive sperm of rival males led to the loss of tails in their sperm.","url":"https://www.sciencealert.com/when-termites-became-monogamous-a-surprising-thing-happened-to-their-sperm","urlToImage":"https://www.sciencealert.com/images/2026/02/TermiteSoldierCloseUp.jpg","publishedAt":"2026-02-07T20:15:15Z","content":"Termites reveal a startling consequence of long-term monogamy the resulting lack of competition between the reproductive sperm of rival males led to the loss of tails in their sperm.\r\nThis involved l… [+2869 chars]"},{"source":{"id":null,"name":"NASASpaceflight.com"},"author":"Ryan Weber","title":"Starbase’s launch site lays groundwork to double in size - NASASpaceFlight.com -","description":"While pushing for Flight 12, SpaceX has received approval to nearly double the launch site’s…","url":"https://www.nasaspaceflight.com/2026/02/starbases-launch-site-double-size/","urlToImage":"https://www.nasaspaceflight.com/wp-content/uploads/2026/02/Starbase-Launch-Site-with-Expansion-Outlined-622x350.jpg","publishedAt":"2026-02-07T19:57:50Z","content":"1While pushing for Flight 12, SpaceX has received approval to nearly double the launch sites size at Starbase. With this approval, SpaceX will be able to complete the redesign of Pad 1 and add additi… [+4844 chars]"},{"source":{"id":null,"name":"Phys.Org"},"author":"Keiichi Ohnaka, Jacco van Loon","title":"A giant star is changing before our eyes and astronomers are watching in real time - Phys.org","description":"For decades, astronomers have been watching WOH G64, an enormous heavyweight star in the Large Magellanic Cloud, a galaxy visible with the naked eye from the Southern Hemisphere. This star is more than 1,500 times larger than the sun and emitting over 100,000…","url":"https://phys.org/news/2026-02-giant-star-eyes-astronomers-real.html","urlToImage":"https://scx2.b-cdn.net/gfx/news/hires/2026/a-giant-star-is-changi.jpg","publishedAt":"2026-02-07T19:10:01Z","content":"For decades, astronomers have been watching WOH G64, an enormous heavyweight star in the Large Magellanic Cloud, a galaxy visible with the naked eye from the Southern Hemisphere. This star is more th… [+6328 chars]"},{"source":{"id":null,"name":"Futurism"},"author":"Frank Landymore","title":"NASA Telescope Discovers Nearby Planet With Deep Similarities to Earth - Futurism","description":"A new candidate exoplanet appears to almost uncanny similarities to Earth — but may differ in at least one major way.","url":"http://futurism.com/space/far-away-planet-earth-chilling","urlToImage":"https://futurism.com/wp-content/uploads/2026/02/far-away-planet-earth-chilling.jpg?quality=85&w=1200","publishedAt":"2026-02-07T18:30:00Z","content":"Astronomers have discovered what appears to be an exoplanet that could be a distant Earthly paradise. Or it could be a frigid realm even chillier than Mars, incapable of supporting life.\r\nThe margins… [+3015 chars]"},{"source":{"id":null,"name":"Discoverwildlife.com"},"author":"Stuart Blackman","title":"\"22% of US men believe they could beat a chimpanzee in a fight\" – Here’s how humans actually stack up against the world’s 10 strongest primates - BBC Wildlife Magazine","description":"Discover the strongest primates on the planet…","url":"https://www.discoverwildlife.com/animal-facts/mammals/worlds-strongest-primates","urlToImage":"https://c02.purpledshub.com/uploads/sites/62/2026/02/strongest-primates.jpg?w=1200","publishedAt":"2026-02-07T16:45:00Z","content":"From nut-cracking monkeys to tree-bending apes, primates come in an astonishing range of shapes, sizes and strength styles. Some rely on brute mass, others on explosive power, iron grips or slow, rel… [+7439 chars]"},{"source":{"id":null,"name":"Science Daily"},"author":null,"title":"Something supercharged Uranus when Voyager 2 flew past - ScienceDaily","description":"Voyager 2’s flyby of Uranus in 1986 recorded radiation levels so extreme they baffled scientists for nearly 40 years. New research suggests the spacecraft caught Uranus during a rare solar wind event that flooded the planet’s radiation belts with extra energy…","url":"https://www.sciencedaily.com/releases/2026/02/260206012217.htm","urlToImage":"https://www.sciencedaily.com/images/1920/uranus-planet-moon-orbits.webp","publishedAt":"2026-02-07T16:43:26Z","content":"Scientists at Southwest Research Institute (SwRI) say they may have found an answer to a puzzle that has lingered for nearly four decades involving the radiation belts surrounding Uranus.When NASA's … [+2647 chars]"},{"source":{"id":null,"name":"Space.com"},"author":"Ben Mather, Adriana Dutkiewicz, Dietmar Müller, Sabin Zahirovic","title":"The way Earth's surface moves has a bigger impact on shifting the climate than we knew - Space","description":"New research reveals the source of this carbon – and the driving forces behind it – are far more complex than previously thought.","url":"https://www.space.com/astronomy/earth/the-way-earths-surface-moves-has-a-bigger-impact-on-shifting-the-climate-than-we-knew","urlToImage":"https://cdn.mos.cms.futurecdn.net/n587iTqPMX6heN544QvWHQ-1920-80.jpg","publishedAt":"2026-02-07T15:00:00Z","content":null},{"source":{"id":null,"name":"The Daily Galaxy --Great Discoveries Channel"},"author":"Melissa Ait Lounis","title":"What Scientists Discovered in This Remote Cave Was Buried for 3,700 Years, and It’s Finally Been Revealed - The Daily Galaxy","description":"A quiet cave seemed like any other archaeological site, until one genetic pattern turned routine research into something far more gripping.","url":"https://dailygalaxy.com/2026/02/remote-cave-discovery-buried-3700-years/","urlToImage":"https://dailygalaxy.com/wp-content/uploads/2026/02/What-Scientists-Discovered-in-This-Remote-Cave-Was-Buried-for-3700-Years-and-Its-Finally-Been-Revealed-scaled.jpg","publishedAt":"2026-02-07T14:45:00Z","content":"In a cave nestled high in the Calabrian mountains, ancient bones have revealed a shocking genetic discovery: a child born from a father-daughter union over 3,700 years ago. The rare finding, backed b… [+2886 chars]"},{"source":{"id":null,"name":"Phys.Org"},"author":"Jutta Witte","title":"New type of magnetism discovered in 2D materials - Phys.org","description":"In collaboration with international partners, researchers at the University of Stuttgart have experimentally demonstrated a previously unknown form of magnetism in atomically thin material layers. The discovery is highly relevant for future magnetic data stor…","url":"https://phys.org/news/2026-02-magnetism-2d-materials.html","urlToImage":"https://scx2.b-cdn.net/gfx/news/hires/2026/a-new-type-of-magnetis-1.jpg","publishedAt":"2026-02-07T14:00:06Z","content":"In collaboration with international partners, researchers at the University of Stuttgart have experimentally demonstrated a previously unknown form of magnetism in atomically thin material layers. Th… [+3797 chars]"},{"source":{"id":null,"name":"The Daily Galaxy --Great Discoveries Channel"},"author":"Lydia Amazouz","title":"Andromeda Is Heading Straight for the Milky Way, and Scientists Finally Know Why - The Daily Galaxy","description":"A new study uncovers the reason why Andromeda is speeding toward the Milky Way, revealing the powerful influence of dark matter on galactic movement.","url":"https://dailygalaxy.com/2026/02/andromeda-heading-for-the-milky-way/","urlToImage":"https://dailygalaxy.com/wp-content/uploads/2026/02/Andromeda-Is-Heading-Straight-for-the-Milky-Way-and-Scientists-Finally-Know-Why-scaled.png","publishedAt":"2026-02-07T13:45:00Z","content":"For years, astronomers have observed the strange motion of Andromeda, the Milky Way’s closest large galactic neighbor. While most galaxies in the universe are receding due to the expansion of space, … [+4264 chars]"},{"source":{"id":null,"name":"Interesting Engineering"},"author":"Aman Tripathi","title":"‘Impossible’ material: Researchers create glass-plastic hybrid that defies physics theory - Interesting Engineering","description":"Scientists have finally combined the best of both worlds into a new, impact-resistant material called a compleximer.","url":"https://interestingengineering.com/science/impossible-material-glass-plastic-hybrid","urlToImage":"https://cms.interestingengineering.com/wp-content/uploads/2026/02/Plastic.jpg","publishedAt":"2026-02-07T12:13:00Z","content":"Researchers at Wageningen University &amp; Research (WUR) have defied long-standing material theories by developing a brand-new class of material known as a “compleximer.” \r\nThis amber-colored substa… [+3195 chars]"},{"source":{"id":null,"name":"Forbes"},"author":"Jamie Carter","title":"Northern Lights Alert: 10 States May See Aurora Saturday Night - Forbes","description":"NOAA warns of likely G1-class geomagnetic storming on Saturday, Feb. 7, through Sunday, Feb. 8, as a coronal mass ejection from an X-class solar flare approaches Earth","url":"https://www.forbes.com/sites/jamiecartereurope/2026/02/07/northern-lights-alert-10-states-may-see-aurora-saturday-night/","urlToImage":"https://imageio.forbes.com/specials-images/imageserve/5f719b705d322bfa863f2fdc/0x0.jpg?format=jpg&crop=3398,1910,x1694,y1170,safe&height=900&width=1600&fit=bounds","publishedAt":"2026-02-07T11:30:51Z","content":"NOAA warns of likely G1-class geomagnetic storming on Saturday, Feb. 7, through Sunday, Feb. 8, as a coronal mass ejection from an X-class solar flare approaches Earth. (Photo by Alex Kormann/Star Tr… [+3438 chars]"},{"source":{"id":null,"name":"Indiandefencereview.com"},"author":"Evelyn Hart","title":"Submarine Disappears Beneath Antarctic Ice After Spotting Bizarre Structures No Scientist Has Seen Before - Indian Defence Review","description":"A groundbreaking Antarctic mission ended in mystery after a high-tech sub vanished beneath the ice, just moments after uncovering bizarre structures hidden below a melting glacier.","url":"https://indiandefencereview.com/submarine-lost-under-antarctic-ice-after-discovering-glacier-secrets/","urlToImage":"https://indiandefencereview.com/wp-content/uploads/2026/02/this-under-ice-sub-saw-something-scientists-cant-explain-scaled.jpg","publishedAt":"2026-02-07T11:30:00Z","content":"A robotic submersible operating beneath one of Antarcticas most closely monitored ice shelves vanished in January 2024 during a scheduled mission. The vehicle, part of a long-running international ef… [+5699 chars]"},{"source":{"id":null,"name":"IFLScience"},"author":"James Felton","title":"Severnaya Zemlya May Be The Last Major Land Discovery On Planet Earth - IFLScience","description":"\"I strained my eyes and peered intently into the darkness. No, there could be no mistake. I could definitely see land.\"","url":"https://www.iflscience.com/severnaya-zemlya-may-be-the-last-major-land-discovery-on-planet-earth-82450","urlToImage":"https://assets.iflscience.com/assets/articleNo/82450/aImg/88894/severnaya-zemlya-archipelago-meta.jpg","publishedAt":"2026-02-07T10:02:20Z","content":"With satellite imagery of pretty much every corner of Earth readily available, we are used to the whole of planet Earth being known to humans. But it wasn't that long ago, in the grand scheme of thin… [+4744 chars]"},{"source":{"id":null,"name":"SciTechDaily"},"author":null,"title":"Why Scientists Are Rethinking 60 Years of Arctic Snow Data - SciTechDaily","description":"Decades of advances in satellite observation made it seem as though Arctic snow cover was growing, when in reality satellites were simply becoming better at detecting smaller and shrinking amounts of snow.","url":"https://scitechdaily.com/why-scientists-are-rethinking-60-years-of-arctic-snow-data/","urlToImage":"https://scitechdaily.com/images/Abandoned-Fishing-Boat-Heavy-Storm-Arctic.jpg","publishedAt":"2026-02-07T05:30:27Z","content":"New research suggests that long-standing satellite records may have been quietly misleading scientists about Arctic snow cover. What once appeared to be a surprising increase turns out to be an illus… [+5126 chars]"},{"source":{"id":null,"name":"SciTechDaily"},"author":null,"title":"New Research Rewrites the Life History of the World’s Most Famous Dinosaur - SciTechDaily","description":"The largest study ever conducted on the growth of Tyrannosaurus rex reveals that the dinosaur took a far longer and slower route to adulthood than scientists had previously believed.","url":"https://scitechdaily.com/new-research-rewrites-the-life-history-of-the-worlds-most-famous-dinosaur/","urlToImage":"https://scitechdaily.com/images/Tyrannosaurus-rex-Skeleton-Museum.jpg","publishedAt":"2026-02-07T04:20:10Z","content":"A new analysis of fossil bone growth suggests Tyrannosaurus rex grew far more slowly than scientists once thought, taking nearly 40 years to reach full size. Using advanced statistical methods and ne… [+5555 chars]"}]}