{"status":"ok","totalResults":50,"articles":[{"source":{"id":null,"name":"Gizmodo.com"},"author":"Ellyn Lapointe","title":"Deja Vu at the SLS Launchpad: Why Can’t NASA Shake Its Hydrogen Leak Curse? - Gizmodo","description":"Why is this still a problem?","url":"https://gizmodo.com/deja-vu-at-the-sls-launchpad-why-cant-nasa-shake-its-hydrogen-leak-curse-2000719899","urlToImage":"https://gizmodo.com/app/uploads/2026/02/Artemis-2-rocket-moon-1200x675.jpg","publishedAt":"2026-02-09T22:05:45Z","content":"During the lead-up to NASAs Artemis 1 mission back in 2022, recurring hydrogen leaks led to significant delays and a cancelled launch attempt. The agency had three years to address the underlying iss… [+3429 chars]"},{"source":{"id":null,"name":"Phys.Org"},"author":"Phys.org","title":"Building blocks of life discovered in Bennu asteroid rewrite origin story - Phys.org","description":null,"url":"https://phys.org/news/2026-02-blocks-life-bennu-asteroid-rewrite.html","urlToImage":null,"publishedAt":"2026-02-09T20:20:42Z","content":null},{"source":{"id":null,"name":"Phys.Org"},"author":"Queen Mary, University of London","title":"Nature's 'engine is grinding to a halt' as climate change gains pace, says study - Phys.org","description":"Many ecologists hypothesize that, as global warming accelerates, change in nature must speed up. They assume that as temperatures rise and climatic zones shift, species will face local extinction and colonize new habitats at an ever-increasing rate, leading t…","url":"https://phys.org/news/2026-02-nature-halt-climate-gains-pace.html","urlToImage":"https://scx2.b-cdn.net/gfx/news/hires/2026/this-engine-is-grindin.jpg","publishedAt":"2026-02-09T19:58:22Z","content":"Many ecologists hypothesize that, as global warming accelerates, change in nature must speed up. They assume that as temperatures rise and climatic zones shift, species will face local extinction and… [+3984 chars]"},{"source":{"id":null,"name":"Phys.Org"},"author":"Phys.org","title":"Satellite record shows boreal forests expanded 12% and shifted north since 1985 - Phys.org","description":null,"url":"https://phys.org/news/2026-02-satellite-boreal-forests-shifted-north.html","urlToImage":null,"publishedAt":"2026-02-09T18:50:01Z","content":null},{"source":{"id":null,"name":"Columbia.edu"},"author":null,"title":"Researchers Announce Discovery of a Possible Pulsar in the Milky Way’s Center - Columbia University","description":"Confirming a pulsar star would enable unprecedented tests of General Relativity. Such a discovery would revolutionize physics.","url":"https://news.columbia.edu/news/researchers-announce-discovery-possible-pulsar-milky-ways-center","urlToImage":"https://news.columbia.edu/sites/news.columbia.edu/files/content/2026/pulsar-galactic-center.jpeg","publishedAt":"2026-02-09T18:16:17Z","content":"Any external influence on a pulsar, such as the gravitational pull of a massive object, would introduce anomalies in this steady arrival of pulses, which can be measured and modeled, said Slavko Bogd… [+1027 chars]"},{"source":{"id":null,"name":"Phys.Org"},"author":"Christoph Elhardt","title":"Why only a small number of planets are suitable for life - Phys.org","description":"For life to develop on a planet, certain chemical elements are needed in sufficient quantities. Phosphorus and nitrogen are essential. Phosphorus is vital for the formation of DNA and RNA, which store and transmit genetic information, and for the energy balan…","url":"https://phys.org/news/2026-02-small-planets-suitable-life.html","urlToImage":"https://scx2.b-cdn.net/gfx/news/hires/2026/why-only-a-small-numbe-1.jpg","publishedAt":"2026-02-09T18:12:42Z","content":"For life to develop on a planet, certain chemical elements are needed in sufficient quantities. Phosphorus and nitrogen are essential. Phosphorus is vital for the formation of DNA and RNA, which stor… [+4613 chars]"},{"source":{"id":null,"name":"ScienceAlert"},"author":"Universe Today","title":"Massive Survey of Runaway Stars Reveals a Surprise About Their Origin - ScienceAlert","description":"In the early 1960s, Dutch astronomer Adriaan Blaauw observed stars moving at unusually high speeds moving through the Milky Way.","url":"https://www.sciencealert.com/massive-survey-of-runaway-stars-reveals-a-surprise-about-their-origin","urlToImage":"https://www.sciencealert.com/images/2026/02/galaxy_arrows_runaway_stars_header.jpg","publishedAt":"2026-02-09T18:03:33Z","content":"In the early 1960s, Dutch astronomer Adriaan Blaauw observed stars moving at unusually high speeds moving through the Milky Way. These stars, as it turned out, were unbound objects that had been kick… [+5078 chars]"},{"source":{"id":null,"name":"Phys.Org"},"author":"Phys.org","title":"A smashing success: Relativistic Heavy Ion Collider wraps up final collisions - Phys.org","description":null,"url":"https://phys.org/news/2026-02-success-relativistic-heavy-ion-collider.html","urlToImage":null,"publishedAt":"2026-02-09T18:00:23Z","content":null},{"source":{"id":null,"name":"Medium"},"author":"Avi Loeb","title":"Discovery of Two New Interstellar-Meteor Candidates - Avi Loeb – Medium","description":"In a new paper that I co-authored with my brilliant postdoc Richard Cloete, available here, we report the identification of two previously…","url":"https://avi-loeb.medium.com/discovery-of-two-new-interstellar-meteor-candidates-7d03a1b9e87a","urlToImage":"https://miro.medium.com/v2/resize:fit:980/1*-PjU6vDkHh77cAUw-5PFLA.avif","publishedAt":"2026-02-09T17:58:42Z","content":"(Image credit: Pete Saloutos/Getty Images)\r\nIn a new paper that I co-authored with my brilliant postdoc Richard Cloete, available here, we report the identification of two previously unrecognized int… [+9054 chars]"},{"source":{"id":null,"name":"Phys.Org"},"author":"Anita Heward","title":"Tiny Enceladus exercises giant electromagnetic influence at Saturn - Phys.org","description":"A major study by an international team of researchers using data from the NASA/ESA/ASI Cassini spacecraft has revealed a lattice-like structure of crisscrossing reflected waves that flow downstream behind the moon in Saturn's equatorial plane, but also reach …","url":"https://phys.org/news/2026-02-tiny-enceladus-giant-electromagnetic-saturn.html","urlToImage":"https://scx2.b-cdn.net/gfx/news/hires/2026/tiny-enceladus-exercis.jpg","publishedAt":"2026-02-09T17:49:10Z","content":"A major study by an international team of researchers using data from the NASA/ESA/ASI Cassini spacecraft has revealed a lattice-like structure of crisscrossing reflected waves that flow downstream b… [+3840 chars]"},{"source":{"id":null,"name":"The Daily Galaxy --Great Discoveries Channel"},"author":"Sarah Jones","title":"Dinosaurs Were Speed Demons, New Fossil Footprints Prove They Could Sprint Like Athletes! - The Daily Galaxy","description":"Dinosaurs weren't just about size and strength; some of them were also incredibly fast. Recent footprints discovered in Mongolia have revealed just how quick these creatures could really move.","url":"https://dailygalaxy.com/2026/02/footprints-fossils-reveal-dinosaur-speed/","urlToImage":"https://dailygalaxy.com/wp-content/uploads/2026/02/Dinosaurs-Were-Speed-Demons-New-Fossil-Footprints-Prove-They-Could-Sprint-Like-Athletes-scaled.jpg","publishedAt":"2026-02-09T16:45:00Z","content":"Newly discovered fossilized footprints in Mongolia reveal that some dinosaurs could run at speeds rivaling top cyclists. This surprising discovery is changing how scientists think about dinosaur move… [+2764 chars]"},{"source":{"id":null,"name":"Live Science"},"author":"Harry Baker","title":"Impossibly powerful 'ghost particle' that slammed into Earth may have come from an exploding black hole — and it could upend both particle physics and cosmology - Live Science","description":"A supercharged neutrino that smashed into our planet in 2023 may have been spit out by an exploding primordial black hole with a \"dark charge.\" If true, this theory could lead to a definitive catalog of all subatomic particles and unveil the elusive identity …","url":"https://www.livescience.com/space/black-holes/impossibly-powerful-ghost-particle-that-slammed-into-earth-may-have-come-from-an-exploding-black-hole-and-it-could-upend-both-particle-physics-and-cosmology","urlToImage":"https://cdn.mos.cms.futurecdn.net/fh9Psvca9EPcoHRhCgHTq-1600-80.jpg","publishedAt":"2026-02-09T16:26:18Z","content":null},{"source":{"id":null,"name":"Space.com"},"author":"Paul Sutter","title":"Interstellar comet 3I/ATLAS survived its flyby of the sun — and gave up some secrets in the process - Space","description":"We're getting an exciting look at the building blocks of alien worlds.","url":"https://www.space.com/astronomy/comets/interstellar-comet-3i-atlas-survived-its-flyby-of-the-sun-and-gave-up-some-secrets-in-the-process","urlToImage":"https://cdn.mos.cms.futurecdn.net/Pvmi4MNsFrESjVVcU94qGE-1920-80.jpg","publishedAt":"2026-02-09T16:00:00Z","content":null},{"source":{"id":null,"name":"Phys.Org"},"author":"Stanford University","title":"Quantum dots reveal entropy production, a key measure of nanoscale energy dissipation - Phys.org","description":"In order to build the computers and devices of tomorrow, we have to understand how they use energy today. That's harder than it sounds. Memory storage, information processing, and energy use in these technologies involve constant energy flow—systems never set…","url":"https://phys.org/news/2026-02-quantum-dots-reveal-entropy-production.html","urlToImage":"https://scx2.b-cdn.net/gfx/news/hires/2026/new-method-measures-en.jpg","publishedAt":"2026-02-09T15:40:01Z","content":"In order to build the computers and devices of tomorrow, we have to understand how they use energy today. That's harder than it sounds. Memory storage, information processing, and energy use in these… [+6090 chars]"},{"source":{"id":null,"name":"Quanta Magazine"},"author":null,"title":"Fed on Reams of Cell Data, AI Maps New Neighborhoods in the Brain - Quanta Magazine","description":"Machine learning is helping neuroscientists organize vast quantities of cells’ genetic data in the latest neurobiological cartography effort.","url":"https://www.quantamagazine.org/fed-on-reams-of-cell-data-ai-maps-new-neighborhoods-in-the-brain-20260209/","urlToImage":"https://www.quantamagazine.org/wp-content/uploads/2026/02/Brain-Cartography-cr-Irena-Gajic-Social.jpg","publishedAt":"2026-02-09T15:21:46Z","content":"The algorithm was also able to identify new neighborhoods, regions that previous neuroscience methods, including the Allen Mouse Brain Common Coordinate Framework, had missed. Take the striatum, a st… [+3615 chars]"},{"source":{"id":null,"name":"The Daily Galaxy --Great Discoveries Channel"},"author":"Kouceila Rekik","title":"JWST Unveils Massive Galaxy From Only 400 Million Years After Big Bang - The Daily Galaxy","description":"Scientists have discovered a massive, metal-rich galaxy, CEERS2-588, formed just 400 million years after the Big Bang, challenging current theories of early galaxy formation.","url":"https://dailygalaxy.com/2026/02/jwst-galaxy-400-m-years-after-big-bang/","urlToImage":"https://dailygalaxy.com/wp-content/uploads/2026/02/JWST-Unveils-Massive-Galaxy-From-Only-400-Million-Years-After-Big-Bang-scaled.png","publishedAt":"2026-02-09T15:15:00Z","content":"Astronomers from the University of Tokyo and other institutions have utilized the James Webb Space Telescope (JWST) to study the distant and ultraviolet-luminous galaxy CEERS2-588, one of the most in… [+4843 chars]"},{"source":{"id":null,"name":"Phys.Org"},"author":"Tomasz Nowakowski","title":"Third exoplanet detected in the planetary system HD 176986 - Phys.org","description":"Using HARPS and HARPS-N spectrographs, astronomers have observed a nearby K-type star designated HD 176986, known to host two super-Earth exoplanets. The observations resulted in the discovery of another planet in the system at least several times more massiv…","url":"https://phys.org/news/2026-02-exoplanet-planetary-hd.html","urlToImage":"https://scx2.b-cdn.net/gfx/news/2026/third-exoplanet-detect.jpg","publishedAt":"2026-02-09T14:40:01Z","content":"Using HARPS and HARPS-N spectrographs, astronomers have observed a nearby K-type star designated HD 176986, known to host two super-Earth exoplanets. The observations resulted in the discovery of ano… [+3845 chars]"},{"source":{"id":null,"name":"Phys.Org"},"author":"Michelle Franklin","title":"How big can a planet be? With very large gas giants, it can be hard to tell - Phys.org","description":"Gas giants are large planets mostly composed of helium and/or hydrogen. Although these planets have dense cores, they don't have hard surfaces. Jupiter and Saturn are the gas giants in our solar system, but there are many other gas giant exoplanets in our gal…","url":"https://phys.org/news/2026-02-big-planet-large-gas-giants.html","urlToImage":"https://scx2.b-cdn.net/gfx/news/2026/how-big-can-a-planet-b.jpg","publishedAt":"2026-02-09T14:39:51Z","content":"Gas giants are large planets mostly composed of helium and/or hydrogen. Although these planets have dense cores, they don't have hard surfaces. Jupiter and Saturn are the gas giants in our solar syst… [+6676 chars]"},{"source":{"id":null,"name":"Phys.Org"},"author":"Cal Poly Humboldt","title":"How an ancient seafloor turned Arkansas into 'Sharkansas,' a shark fossil hotspot - Phys.org","description":"Most shark fossils are just teeth—their cartilage skeletons usually decay long before they can fossilize. But in northwestern Arkansas, a series of geological sites known as the Fayetteville Shale has preserved dozens of rare, three-dimensional shark skeleton…","url":"https://phys.org/news/2026-02-ancient-seafloor-arkansas-sharkansas-shark.html","urlToImage":"https://scx2.b-cdn.net/gfx/news/2026/how-an-ancient-seafloo.jpg","publishedAt":"2026-02-09T14:31:39Z","content":"Most shark fossils are just teeththeir cartilage skeletons usually decay long before they can fossilize. But in northwestern Arkansas, a series of geological sites known as the Fayetteville Shale has… [+3537 chars]"},{"source":{"id":null,"name":"Theregister.com"},"author":"Richard Speed","title":"SpaceX resumes Falcon 9 launches after second-stage mishap - theregister.com","description":": FAA signs off on rocket's return and CEO floats ambitious lunar settlement plan","url":"https://www.theregister.com/2026/02/09/spacex_resumes_falcon_9/","urlToImage":"https://regmedia.co.uk/2025/03/13/crew-10.jpg","publishedAt":"2026-02-09T14:23:00Z","content":"SpaceX resumed launching Falcon 9 rockets this weekend after last week's second stage incident. At the same time, CEO Elon Musk claimed that the company has shifted its focus from Mars to \"building a… [+2594 chars]"}]}