{"status":"ok","totalResults":53,"articles":[{"source":{"id":null,"name":"ScienceAlert"},"author":"Universe Today","title":"Huge Web of Hidden Electromagnetic Waves Discovered Around Tiny Ice World - ScienceAlert","description":"At just 500 kilometers across, Saturn's sixth-largest moon would fit comfortably inside the United Kingdom, with room to spare.","url":"https://www.sciencealert.com/huge-web-of-hidden-electromagnetic-waves-discovered-around-tiny-ice-world","urlToImage":"https://www.sciencealert.com/images/2026/02/A-Web-of-Hidden-Electromagnetic-Waves-Surrounds-Enceladus.jpg","publishedAt":"2026-02-18T03:34:13Z","content":"At just 500 kilometers across, Saturn's sixth-largest moon would fit comfortably inside the United Kingdom, with room to spare.\r\nYet new research reveals this tiny ice world wields electromagnetic in… [+3275 chars]"},{"source":{"id":null,"name":"ScienceAlert"},"author":"Associated Press","title":"NASA Restarts Countdown After Fixing Hydrogen Leaks on Its Moon Rocket - ScienceAlert","description":"CAPE CANAVERAL, Fla.","url":"https://www.sciencealert.com/nasa-restarts-countdown-after-fixing-hydrogen-leaks-on-its-moon-rocket","urlToImage":"https://www.sciencealert.com/images/2026/02/Full-Moon-over-NASAs-SLS-and-Orion.jpg","publishedAt":"2026-02-18T02:59:05Z","content":"CAPE CANAVERAL, Fla. (AP) NASA began another practice launch countdown Tuesday for its first moonshot with astronauts in decades, after making repairs to fix dangerous fuel leaks that already have bu… [+1895 chars]"},{"source":{"id":null,"name":"The Conversation Africa"},"author":"Gregory Radisic, Samantha Lawler","title":"Too many satellites? Earth’s orbit is on track for a catastrophe – but we can stop it - The Conversation","description":"Cultural, spiritual, and most environmental impacts aren’t taken into account when launching thousands of satellites.","url":"https://theconversation.com/too-many-satellites-earths-orbit-is-on-track-for-a-catastrophe-but-we-can-stop-it-275430","urlToImage":"https://images.theconversation.com/files/718652/original/file-20260216-56-9ha7s1.jpg?ixlib=rb-4.1.0&rect=0%2C320%2C3840%2C1920&q=45&auto=format&w=1356&h=668&fit=crop","publishedAt":"2026-02-18T01:04:00Z","content":"On January 30 2026, SpaceX filed an application with the US Federal Communications Commission for a megaconstellation of up to one million satellites to power data centres in space.\r\nThe proposal env… [+6794 chars]"},{"source":{"id":null,"name":"Gizmodo.com"},"author":"Gayoung Lee","title":"Antarctica’s ‘Gravity Hole’ Has Been Quietly Growing Stronger - Gizmodo","description":"Scientists aren't fully sure what this means for Antarctica's future, however.","url":"https://gizmodo.com/antarcticas-gravity-hole-has-been-quietly-growing-stronger-2000722955","urlToImage":"https://gizmodo.com/app/uploads/2026/02/antarctica-seen-from-space-nasa-e1771361418464-1200x675.jpg","publishedAt":"2026-02-18T00:00:55Z","content":"For a long time, scientists knew of a gravity hole beneath Antarcticaan area with particularly weak gravitational force. Considering the various threats currently faced by the region, scientists are … [+3219 chars]"},{"source":{"id":null,"name":"Phys.Org"},"author":"University of Basel","title":"A bacterium's built-in compass, explained: Single-cell magnetometry confirms Earth-field alignment - Phys.org","description":"Some bacterial species possess an astonishing ability: They use Earth's magnetic field to orient themselves. To better understand this mechanism, the team led by Argovia-Professor Martino Poggio from the Swiss Nanoscience Institute and the Department of Physi…","url":"https://phys.org/news/2026-02-bacterium-built-compass-cell-magnetometry.html","urlToImage":"https://scx2.b-cdn.net/gfx/news/hires/2026/bacteria-with-built-in.jpg","publishedAt":"2026-02-17T23:20:01Z","content":"Some bacterial species possess an astonishing ability: They use Earth's magnetic field to orient themselves. To better understand this mechanism, the team led by Argovia-Professor Martino Poggio from… [+3990 chars]"},{"source":{"id":null,"name":"Indiandefencereview.com"},"author":"Emily Carter","title":"Scientists Investigate 'Bright Green' Wall Deep in New Mexico Caves: A Hidden World for 49 Million Years - Indian Defence Review","description":"Deep within the remote caves of New Mexico, a bright green wall has been discovered, untouched for an astonishing 49 million years.","url":"https://indiandefencereview.com/green-wall-new-mexico-caves-49-m-years/","urlToImage":"https://indiandefencereview.com/wp-content/uploads/2026/02/scientists-investigate-bright-green-wall-deep-in-new-mexico-caves-a-hidden-world-for-49-million-years-scaled.png","publishedAt":"2026-02-17T22:20:00Z","content":"Deep within the caves of New Mexico, researchers have uncovered a mysterious phenomenon that could change how scientists search for life beyond Earth. In 2018, a team of scientists, led by Hazel Bart… [+4600 chars]"},{"source":{"id":null,"name":"Space.com"},"author":"Keith Cooper","title":"Did a titanic moon crash create Saturn's iconic rings? - Space","description":"Debris from the collision could have formed another moon of Saturn called Hyperion, and affected the tilt of Saturn itself.","url":"https://www.space.com/astronomy/saturn/did-a-titanic-moon-crash-create-saturns-iconic-rings","urlToImage":"https://cdn.mos.cms.futurecdn.net/D54ZATN5Xkf9TtvhhbsBfh-800-80.jpg","publishedAt":"2026-02-17T22:00:00Z","content":null},{"source":{"id":null,"name":"SciTechDaily"},"author":null,"title":"Scientists Say Your Fingers Hold a Secret of Brain Evolution - SciTechDaily","description":"The secret to how our brains grew may be hidden in our fingers before we are even born.","url":"https://scitechdaily.com/scientists-say-your-fingers-hold-a-secret-of-brain-evolution/","urlToImage":"https://scitechdaily.com/images/Hands-Different-Finger-Lengths-Index-Ring.jpg","publishedAt":"2026-02-17T21:47:38Z","content":"Finger length may reveal more than you think about human evolution. Boys with higher prenatal estrogen exposure showed larger head sizes at birth, pointing to a possible hormonal boost behind the gro… [+3366 chars]"},{"source":{"id":null,"name":"Phys.Org"},"author":"Bernard Rizk","title":"Strong Field Spin-Boson model revises how intense lasers drive electrons in dense matter - Phys.org","description":"A team of physicists from the University of Ottawa have developed a new theoretical model that shines new light on how scientists understand the way lasers interact with dense matter, such as solids and liquids. This could unlock advances in ultrafast physics…","url":"https://phys.org/news/2026-02-strong-field-boson-intense-lasers.html","urlToImage":"https://scx2.b-cdn.net/gfx/news/2026/researchers-develop-be-1.jpg","publishedAt":"2026-02-17T21:34:26Z","content":"A team of physicists from the University of Ottawa have developed a new theoretical model that shines new light on how scientists understand the way lasers interact with dense matter, such as solids … [+3193 chars]"},{"source":{"id":null,"name":"Phys.Org"},"author":"Daegan Miller","title":"Astronomers may have just found one of the missing links in galaxy evolution - Phys.org","description":"A team of 48 astronomers from 14 countries, led by the University of Massachusetts Amherst, has discovered a population of dusty, star-forming galaxies at the far edges of the universe that formed only a billion years after the Big Bang, believed to have occu…","url":"https://phys.org/news/2026-02-astronomers-links-galaxy-evolution.html","urlToImage":"https://scx2.b-cdn.net/gfx/news/hires/2026/an-international-team.jpg","publishedAt":"2026-02-17T21:03:39Z","content":"A team of 48 astronomers from 14 countries, led by the University of Massachusetts Amherst, has discovered a population of dusty, star-forming galaxies at the far edges of the universe that formed on… [+4087 chars]"},{"source":{"id":null,"name":"The Daily Galaxy --Great Discoveries Channel"},"author":"Arezki Amiri","title":"Buried for 30,000 Years, One Ice Age Traveler’s Toolkit Is Altering Human History - The Daily Galaxy","description":"A 30,000-year-old blade cluster may be the closest we’ve ever come to meeting one individual from the Ice Age.","url":"https://dailygalaxy.com/2026/02/30000-years-ice-age-travelers-toolkit-is-altering-human-history/","urlToImage":"https://dailygalaxy.com/wp-content/uploads/2026/02/a-cluster-of-stone-blades-finally-surrenders-the-secrets-of-the-person-who-carried-them-scaled.jpg","publishedAt":"2026-02-17T19:46:00Z","content":"The hills of South Moravia have yielded thousands of Stone Age artifacts over decades of excavation, most of them anonymous fragments of a distant past. But a cluster of 29 stones found in 2021 at th… [+5398 chars]"},{"source":{"id":null,"name":"Phys.Org"},"author":"Camilla Brodam Galacho","title":"Nitrogen pollution is rising: What a new global map means for forest carbon - Phys.org","description":"On a cool spring morning in a northern forest, the ground feels soft underfoot. Mist hangs between the trunks, and the air smells of wet leaves and old humus; the slow alchemy that keeps a forest alive. Beneath the surface, billions of microbes break down org…","url":"https://phys.org/news/2026-02-nitrogen-pollution-global-forest-carbon.html","urlToImage":"https://scx2.b-cdn.net/gfx/news/hires/2026/increasing-nitrogen-po-1.jpg","publishedAt":"2026-02-17T19:16:36Z","content":"On a cool spring morning in a northern forest, the ground feels soft underfoot. Mist hangs between the trunks, and the air smells of wet leaves and old humus; the slow alchemy that keeps a forest ali… [+5977 chars]"},{"source":{"id":"usa-today","name":"USA Today"},"author":"Mike Snider","title":"Dire wolves at Colossal growing up in pictures - USA Today","description":"The first dire wolves produced at Colossal Biosciences are now more than a year old. Here are pictures of Romulus and Remus showing their development.","url":"https://www.usatoday.com/picture-gallery/news/nation/2026/02/17/colossal-biosciences-dire-wolves-pictures/88717914007/","urlToImage":"https://www.usatoday.com/gcdn/authoring/authoring-images/2026/02/16/USAT/88709395007-remus-03.jpg?crop=5995,3374,x0,y306&width=3200&height=1801&format=pjpg&auto=webp","publishedAt":"2026-02-17T18:48:00Z","content":"Feb. 17, 2026, 1:48 p.m. ET\r\nIn 'Game of Thrones,' the dire wolf is the sigil, or mascot, of House Stark. Colossal Biosciences has born three dire wolf pups using the ancient DNA from the extinct spe… [+2082 chars]"},{"source":{"id":null,"name":"Gizmodo.com"},"author":"Passant Rabie","title":"Could Water Be the Future of Space Propulsion? This Startup Thinks So - Gizmodo","description":"General Galactic is aiming to fly a satellite using a water-powered propulsion system.","url":"https://gizmodo.com/space-startup-plans-to-turn-water-into-orbital-propellant-2000722824","urlToImage":"https://gizmodo.com/app/uploads/2026/01/Starlink-launch-1200x675.jpg","publishedAt":"2026-02-17T18:30:46Z","content":"Humanity’s plans for deep-space exploration hinge on the ability to use basic resources, such as water, to propel rockets to farther destinations in the solar system. Despite decades of experimentati… [+3281 chars]"},{"source":{"id":null,"name":"Live Science"},"author":"Patrick Pester","title":"Our adorable, noodle-like ancestor had 4 eyes, half-a-billion-year-old fossils reveal - Live Science","description":"The earliest recorded vertebrates had four eyes to escape predators in the ancient Cambrian ocean, according to half-a-billion-year-old fossils from China that shed light on our evolutionary origins.","url":"https://www.livescience.com/animals/extinct-species/our-adorable-noodle-like-ancestor-had-4-eyes-half-a-billion-year-old-fossils-reveal","urlToImage":"https://cdn.mos.cms.futurecdn.net/4LCaQZxPBWLwHwoHG4xVJP-1920-80.jpg","publishedAt":"2026-02-17T18:15:21Z","content":null},{"source":{"id":"buzzfeed","name":"Buzzfeed"},"author":"Arsheen Kaur Sahni","title":"Sorry, But These 30 Mind Blowing Space Facts Will Completely Change How You See The Universe - BuzzFeed","description":"My brain's officially in orbit and yours will be too.","url":"https://www.buzzfeed.com/arsheenkaur44/30-mind-blowing-space-facts","urlToImage":"https://img.buzzfeed.com/buzzfeed-static/static/2026-02/17/12/thumb/0ZTHX1o4G.jpg?crop=2988:1992;6,0&resize=1250:830","publishedAt":"2026-02-17T17:01:02Z","content":"All the normal matter, like the stars, gas, dust, and people, is called baryonic matter, and its basically the tiny visible fraction of a universe thats mostly invisible and still not fully understoo… [+1 chars]"},{"source":{"id":null,"name":"Phys.Org"},"author":"Ludwig Maximilian University of Munich","title":"Physicists observe polaron formation for the first time - Phys.org","description":"When an electron travels through a polar crystalline solid, its negative charge attracts the positively charged atomic cores, causing the surrounding crystal lattice to deform. The electron and lattice distortion then move together through the material—like a…","url":"https://phys.org/news/2026-02-physicists-polaron-formation.html","urlToImage":"https://scx2.b-cdn.net/gfx/news/hires/2026/physicists-observe-pol.jpg","publishedAt":"2026-02-17T16:53:36Z","content":"When an electron travels through a polar crystalline solid, its negative charge attracts the positively charged atomic cores, causing the surrounding crystal lattice to deform. The electron and latti… [+4747 chars]"},{"source":{"id":null,"name":"The Daily Galaxy --Great Discoveries Channel"},"author":"Melissa Ait Lounis","title":"Scientists Have Uncovered Embryos Older Than Most Dinosaur Fossils, Did They Give Birth to Live Young? - The Daily Galaxy","description":"Ancient embryos have just been uncovered, older than dinosaurs! What secrets could these fossils hold?","url":"https://dailygalaxy.com/2026/02/ancient-embryos-older-than-dinosaur-found/","urlToImage":"https://dailygalaxy.com/wp-content/uploads/2026/02/Scientists-Have-Uncovered-Embryos-Older-Than-Most-Dinosaur-Fossils-scaled.jpg","publishedAt":"2026-02-17T16:45:00Z","content":"An international team of paleontologists has uncovered the oldest known fossil reptile embryos, dating back approximately 280 million years. This discovery, featuring well-preserved embryos of mesosa… [+3185 chars]"},{"source":{"id":null,"name":"Nature.com"},"author":null,"title":"Ectopic expression of cytosolic DHODH uncouples de novo pyrimidine biosynthesis from mitochondrial electron transport - Nature","description":"Cytosolic ScURA uncouples de novo pyrimidine synthesis from mitochondrial electron transport, and rescues pyrimidine production and cell proliferation under pharmacological or genetic mETC disruption.","url":"https://www.nature.com/articles/s42255-026-01454-7","urlToImage":"https://media.springernature.com/m685/springer-static/image/art%3A10.1038%2Fs42255-026-01454-7/MediaObjects/42255_2026_1454_Fig1_HTML.png","publishedAt":"2026-02-17T16:36:50Z","content":"Cell culture\r\nCells were grown in complete DMEM medium (D5796, containing 4,500mgl1 glucose, 2mM L-glutamine) supplemented with dialysed 10% FBS (Sigma-Aldrich, F7524), 1% penicillinstreptomycin (Pen… [+20989 chars]"},{"source":{"id":null,"name":"Phys.Org"},"author":"University of Waterloo","title":"JWST spots most distant jellyfish galaxy to date - Phys.org","description":"Astrophysicists from the University of Waterloo have observed a new jellyfish galaxy, the most distant one of its kind ever captured. Jellyfish galaxies are named for the long, tentacle-like streams that trail behind them. They move quickly through their hot,…","url":"https://phys.org/news/2026-02-jwst-distant-jellyfish-galaxy-date.html","urlToImage":"https://scx2.b-cdn.net/gfx/news/hires/2026/scientists-observe-dis.jpg","publishedAt":"2026-02-17T16:24:44Z","content":"Astrophysicists from the University of Waterloo have observed a new jellyfish galaxy, the most distant one of its kind ever captured. Jellyfish galaxies are named for the long, tentacle-like streams … [+3597 chars]"}]}