{"status":"ok","totalResults":49,"articles":[{"source":{"id":"cnn","name":"CNN"},"author":"Jacopo Prisco","title":"Scientists discover molecule in space that hints at origin of life - CNN","description":"A 13-atom molecule containing sulfur has been discovered in interstellar space for the first time, providing insight into the origins of the chemistry of life.","url":"https://www.cnn.com/2026/01/30/science/sulfur-molecule-space-discovery","urlToImage":"https://media.cnn.com/api/v1/images/stellar/prod/c6h6s-blender-out-best-landscape.jpeg?c=16x9&q=w_800,c_fill","publishedAt":"2026-01-30T17:39:16Z","content":"Scientists have discovered the largest organic molecule containing sulfur a key ingredient for life ever identified in interstellar space. The researchers call the discovery a missing link in scienti… [+6470 chars]"},{"source":{"id":null,"name":"Phys.Org"},"author":"Robert Sanders","title":"Why are Tatooine planets rare? General relativity explains why binary star systems rarely host planets - Phys.org","description":"Astronomers have found thousands of exoplanets around single stars, but few around binary stars—even though both types of stars are equally common. Physicists can now explain the dearth.","url":"https://phys.org/news/2026-01-tatooine-planets-rare-general-binary.html","urlToImage":"https://scx2.b-cdn.net/gfx/news/2026/why-are-tatooine-plane.jpg","publishedAt":"2026-01-30T17:27:18Z","content":"Astronomers have found thousands of exoplanets around single stars, but few around binary starseven though both types of stars are equally common. Physicists can now explain the dearth.\r\nOf the more … [+10257 chars]"},{"source":{"id":null,"name":"Space.com"},"author":"Josh Dinner","title":"NASA delays critical Artemis 2 rocket fueling test due to below-freezing temperatures, launch no earlier than Feb. 8 - Space","description":"Arctic cold is chilling the Artemis 2 timeline.","url":"https://www.space.com/space-exploration/artemis/nasa-delays-critical-artemis-2-rocket-fueling-test-due-to-below-freezing-temperatures-launch-no-earlier-than-feb-8","urlToImage":"https://cdn.mos.cms.futurecdn.net/ivgtCLrCm3betRhcq4T3cV-2560-80.jpg","publishedAt":"2026-01-30T15:52:13Z","content":"NASA has been forced to delay a critical fueling test for its Artemis 2 moon rocket due to unusually cold weather forecasted to hit the Space Coast this weekend.\r\nThe wet dress rehearsal for the Spac… [+4237 chars]"},{"source":{"id":null,"name":"Medium"},"author":"Avi Loeb","title":"The Massive Nucleus of 3I/ATLAS and its Puzzling Methane Outgassing, Based on New Data from the… - Avi Loeb – Medium","description":"What a glorious day! Today, new data on the interstellar object 3I/ATLAS was released from the Hubble and Webb space telescopes in two…","url":"https://avi-loeb.medium.com/the-massive-nucleus-of-3i-atlas-and-its-puzzling-methane-outgassing-based-on-new-data-from-the-72e540d8fe46","urlToImage":"https://miro.medium.com/v2/resize:fit:1200/1*MMFtBQhnvuX03OLtX-4gCA.png","publishedAt":"2026-01-30T15:08:35Z","content":"New data from the Hubble Space Telescope. Detection of the nucleus of 3I/ATLAS (third panel from the left) through the subtraction of the best-fit coma model (second panel) from the observed Hubble i… [+7233 chars]"},{"source":{"id":null,"name":"Popular Mechanics"},"author":"Darren Orf","title":"Scientists Just Watched These Entities Rapidly Evolve In Space. They Could Save Our Lives. - Yahoo","description":"Scientists analyzed how a biological battle played out between E. coli and a T7 bacteriophage, both on Earth and aboard the International Space Station.","url":"https://www.popularmechanics.com/science/health/a70147165/space-bacteriophage/","urlToImage":"https://s.yimg.com/ny/api/res/1.2/xQ26Lmt81HMAhT6UH3uIUw--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02NzU7Y2Y9d2VicA--/https://media.zenfs.com/en/popular_mechanics_642/1afd4e292b4cbf9e71349080098f3e92","publishedAt":"2026-01-30T14:30:00Z","content":"Heres what youll learn when you read this story:\r\n<ul><li>As bacteria become increasingly (and worryingly) resistant to antibiotics, scientists are recruiting bacteriophagesa bacterias sworn evolutio… [+4142 chars]"},{"source":{"id":null,"name":"Medium"},"author":"Avi Loeb","title":"Black Hole Formation from a Disappearing Star in the Andromeda Galaxy - Avi Loeb – Medium","description":"A new paper led by Kishalay De (accessible here), on which I was privileged to be a co-author, reports the discovery of a disappearing star…","url":"https://avi-loeb.medium.com/black-hole-formation-from-a-disappearing-star-in-the-andromeda-galaxy-d01dc708c380","urlToImage":"https://miro.medium.com/v2/resize:fit:1156/1*LinqB8UZZBZry7GiQOW2pw.png","publishedAt":"2026-01-30T13:14:16Z","content":"JWST/MIRI RGB composite image of the disappearing star M312014-DS1 (with color channels shown in the label). The spatial scale (10 arcseconds=37.8 parsecs=123.3 light years) and North-East orientatio… [+6462 chars]"},{"source":{"id":null,"name":"Space.com"},"author":"Elizabeth Howell","title":"Comet C/2025 K1 (ATLAS) crumbles apart in stunning new telescope images - Space","description":"The comet broke into pieces after making a close approach around the sun in October 2025.","url":"https://www.space.com/astronomy/comets/comet-c-2025-k1-atlas-crumbles-apart-in-stunning-new-telescope-images","urlToImage":"https://cdn.mos.cms.futurecdn.net/QrqFdH6v6HfBTmPaE8t8db-1920-80.jpg","publishedAt":"2026-01-30T13:00:00Z","content":"A comet was caught falling apart on camera, using a powerful telescope in Hawaii.\r\nComet C/2025 K1 (ATLAS) crumbled in high-resolution footage captured by the Gemini North telescope atop Mauna Kea in… [+3177 chars]"},{"source":{"id":null,"name":"Live Science"},"author":"Alan Bradley","title":"Watch awkward Chinese humanoid robot lay it all down on the dance floor - Live Science","description":"The model demonstrated remarkable precision, stability and speed across a highly complex dance routine.","url":"https://www.livescience.com/technology/robotics/watch-chinese-humanoid-robot-adam-u-ultra-dance-without-missing-a-beat-in-eerie-new-video","urlToImage":"https://cdn.mos.cms.futurecdn.net/3Hj8AH3oH3gqHgW4NTswPn-1600-80.png","publishedAt":"2026-01-30T13:00:00Z","content":"In a striking display of agility and grace, a humanoid robot named \"Adam-U Ultra\" has danced its way through a complex, highly energetic routine without faltering, slipping or missing a beat.\r\nIn a n… [+3428 chars]"},{"source":{"id":null,"name":"SciTechDaily"},"author":null,"title":"“Unlike Anything We Have Seen Before” – An Unexplained Space Object Is Sending Powerful Signals Across the Galaxy - SciTechDaily","description":"Astronomers at the International Centre for Radio Astronomy Research (ICRAR), working with international collaborators, have made a striking discovery involving a previously unknown type of cosmic phenomenon. A strange astronomical object known as ASKAP J1832…","url":"https://scitechdaily.com/unlike-anything-we-have-seen-before-an-unexplained-space-object-is-sending-powerful-signals-across-the-galaxy/","urlToImage":"https://scitechdaily.com/images/Artists-Illustration-of-NASAs-Chandra-X-Ray-Observatory-in-Space-scaled.jpg","publishedAt":"2026-01-30T12:16:47Z","content":"This artist’s illustration depicts NASA’s Chandra X-ray Observatory in space. Credit: NASA/CXC &amp; J. Vaughan\r\nAstronomers at the International Centre for Radio Astronomy Research (ICRAR), working … [+5271 chars]"},{"source":{"id":null,"name":"The Daily Galaxy --Great Discoveries Channel"},"author":"Arezki Amiri","title":"The \"Special Regions\" on Mars Where It Is Totally Forbidden to Explore, for a Haunting Reason - The Daily Galaxy","description":"A secret map of Mars exists, one that space agencies are forbidden to follow. Hidden within its surface are regions so scientifically sensitive that even NASA rovers are ordered to keep out.","url":"https://dailygalaxy.com/2026/01/the-special-regions-on-mars-where-it-is-totally-forbidden-to-explore-for-a-haunting-reason/","urlToImage":"https://dailygalaxy.com/wp-content/uploads/2026/01/NASA-rovers-are-banned-from-exploring-parts-of-Mars-scaled.jpg","publishedAt":"2026-01-30T11:45:00Z","content":"Even as momentum builds toward sending humans to Mars in the next decade, several regions on the Red Planet remain off-limits to robotic exploration. The reason has nothing to do with distance or ter… [+5527 chars]"},{"source":{"id":null,"name":"Nature.com"},"author":null,"title":"How DeepMind's genome AI could help solve rare disease mysteries - Nature","description":"Hackathons using AlphaGenome and other AI models are hunting down the genetic causes of devastating conditions that have evaded diagnosis.","url":"https://www.nature.com/articles/d41586-026-00302-8","urlToImage":"https://media.nature.com/lw1200/magazine-assets/d41586-026-00302-8/d41586-026-00302-8_51994484.jpg","publishedAt":"2026-01-30T11:29:06Z","content":"Researchers at a Hackathon used AlphaGenome to search for the genetic causes of 29 undiagnosed diseases.Credit: Peter Ková/Alamy\r\nWhen more than 100 researchers voluntarily locked themselves in a roo… [+2368 chars]"},{"source":{"id":null,"name":"Technology.org"},"author":"https://www.facebook.com/technologijos.lt/, https://www.facebook.com/technologijos.lt/","title":"Colossal Biosciences Announces Historic Breakthrough: The Woolly Mammoth Is Back, Meet Baby Manny - Technology Org","description":"DALLAS, TX — January 27, 2026 — Colossal Biosciences, the world’s leading de-extinction company, proudly announces the successful","url":"https://www.technology.org/2026/01/30/colossal-biosciences-announces-historic-breakthrough-the-woolly-mammoth-is-back-meet-baby-manny/","urlToImage":"https://www.technology.org/texorgwp/wp-content/uploads/2026/01/1000068858-1.jpg-720x538.jpeg","publishedAt":"2026-01-30T08:41:33Z","content":"DALLAS, TX January 27, 2026 Colossal Biosciences, the worlds leading de-extinction company, proudly announces the successful culmination of its flagship mission: the resurrection of the woolly mammot… [+3110 chars]"},{"source":{"id":null,"name":"Skyatnightmagazine.com"},"author":"Iain Todd","title":"If asteroid YR4 hits our Moon, it'll cause a bright flash and meteors as debris hits Earth, say scientists - BBC Sky at Night Magazine","description":"Scientists have worked out the effects of asteroid 2024 YR4 hitting our Moon in 2032, including what we'll see in the days after the event.","url":"https://www.skyatnightmagazine.com/news/effects-asteroid-2024-yr4-hitting-moon","urlToImage":"https://c02.purpledshub.com/uploads/sites/48/2026/01/asteroid-hitting-moon.jpg?w=1200","publishedAt":"2026-01-30T08:29:40Z","content":"If asteroid 2024 YR4 does hit the Moon, it could produce a bright flash on the lunar surface that would be visible from Earth, and spray debris into our planet's atmosphere.\r\nSuch an impact may even … [+7884 chars]"},{"source":{"id":null,"name":"Neurosciencenews.com"},"author":"Neuroscience News","title":"Hippocampus Predicts Rewards by Reorganizing Memories - Neuroscience News","description":"A new study finds the hippocampus reorganizes memories to predict rewards. This discovery explains how the brain learns and why Alzheimer's affects decision-making.","url":"https://neurosciencenews.com/hippocampus-reward-prediction-learning-alzheimers-30089/","urlToImage":"https://neurosciencenews.com/files/2026/01/hippocampal-neurons-nuerosciencenews-public.jpg","publishedAt":"2026-01-29T23:14:44Z","content":"Summary: A new preclinical study reveals that the hippocampus does more than just store memories; it actively reorganizes them to predict future rewards. By tracking brain activity over several weeks… [+6394 chars]"},{"source":{"id":null,"name":"Space.com"},"author":"Robert Lea","title":"Astronomers watch 1st black hole ever imaged launch a 3,000‑light‑year‑long cosmic jet from its glowing 'shadow' - Space","description":"\"It is amazing to see that we are gradually moving towards combining these breakthrough observations across multiple frequencies and completing the picture of the jet launching region.\"","url":"https://www.space.com/astronomy/black-holes/astronomers-watch-1st-black-hole-ever-imaged-launch-a-3-000-light-year-long-cosmic-jet-from-its-glowing-shadow","urlToImage":"https://cdn.mos.cms.futurecdn.net/hpLw8QjLxtFpwGinGSiYF7-1600-80.png","publishedAt":"2026-01-29T22:00:00Z","content":"Using the Event Horizon Telescope (EHT), astronomers have tracked a 3,000 light-years-long cosmic blowtorch back to its source, the supermassive black hole M87*, which bears the distinction of being … [+3781 chars]"},{"source":{"id":null,"name":"Live Science"},"author":"Joanna Thompson","title":"Halley wasn't the first to figure out the famous comet. An 11th-century monk did it first, new research suggests. - Live Science","description":"An 11th-century monk saw the famous \"Halley's comet\" first as a child and later as an adult, new research finds.","url":"https://www.livescience.com/archaeology/halley-wasnt-the-first-to-figure-out-the-famous-comet-an-11th-century-monk-did-it-first-new-research-suggests","urlToImage":"https://cdn.mos.cms.futurecdn.net/mR7j4LdXbrVtqyVKX3TfoT-1920-80.jpg","publishedAt":"2026-01-29T21:30:10Z","content":"Halley's comet bears the name of the astronomer who famously first described its movements through space, but he wasn't the first to discover its periodic orbit past Earth, new research suggests.\r\nHa… [+3830 chars]"},{"source":{"id":null,"name":"Gizmodo.com"},"author":"Passant Rabie","title":"Whoa, Why Has This Frozen Lake Turned Green? - Gizmodo","description":"Scientists say it's a rare natural phenomenon driven by pollution and—yep—climate change.","url":"https://gizmodo.com/whoa-why-has-this-frozen-lake-turned-green-2000715701","urlToImage":"https://gizmodo.com/app/uploads/2026/01/greren-frozen-lake-1200x675.jpg","publishedAt":"2026-01-29T21:15:13Z","content":"A frozen lake in Czechia turned an ominous green color, a warning sign of ecological changes due to a warming climate.\r\nResearchers from the Biology Center of the Czech Academy of Sciences collected … [+3004 chars]"},{"source":{"id":null,"name":"Futurism"},"author":"Victor Tangermann","title":"NASA’s Moon Spacesuits Are Plagued With Issues - Futurism","description":"NASA's Moon astronauts will be using a new spacesuit to explore the lunar surface. Unfortunately, experts say, it has problems.","url":"http://futurism.com/space/nasa-moon-spacesuits-issues","urlToImage":"https://futurism.com/wp-content/uploads/2026/01/nasa-moon-spacesuits-issues.jpg?quality=85&w=1200","publishedAt":"2026-01-29T21:05:00Z","content":"NASA is gearing up for the first crewed journey to the Moon in over half a century, a mission that could launch as soon as two weeks from now.\r\nAnd next year, the agency will finally attempt to retur… [+3217 chars]"},{"source":{"id":null,"name":"Phys.Org"},"author":"Patty Wellborn","title":"New map of the Milky Way's magnetism offers insights into cosmic evolution - Phys.org","description":"A UBC Okanagan-led research project has given a group of international scientists their clearest view yet of the Milky Way's magnetic field, revealing that it is far more complex than previously believed.","url":"https://phys.org/news/2026-01-milky-magnetism-insights-cosmic-evolution.html","urlToImage":"https://scx2.b-cdn.net/gfx/news/hires/2026/new-map-of-the-milky-w-1.jpg","publishedAt":"2026-01-29T20:20:31Z","content":"A UBC Okanagan-led research project has given a group of international scientists their clearest view yet of the Milky Way's magnetic field, revealing that it is far more complex than previously beli… [+6156 chars]"},{"source":{"id":null,"name":"Phys.Org"},"author":"University of Sydney","title":"Why termite kings and queens are monogamous: Scientists uncover surprising answer - Phys.org","description":"Termites are among the most successful animals on Earth, forming vast societies that can number in the millions. But how did such complex social systems evolve from solitary ancestors that looked much like today's cockroaches?","url":"https://phys.org/news/2026-01-termite-kings-queens-monogamous-scientists.html","urlToImage":"https://scx2.b-cdn.net/gfx/news/2026/scientists-solve-the-m-3.jpg","publishedAt":"2026-01-29T19:00:12Z","content":"Termites are among the most successful animals on Earth, forming vast societies that can number in the millions. But how did such complex social systems evolve from solitary ancestors that looked muc… [+5470 chars]"}]}