{"status":"ok","totalResults":58,"articles":[{"source":{"id":"ars-technica","name":"Ars Technica"},"author":"Stephen Clark","title":"Unable to tame hydrogen leaks, NASA delays launch of Artemis II until March - Ars Technica","description":"NASA spent most of Monday trying to overcome hydrogen leaks on the Artemis II rocket.","url":"https://arstechnica.com/space/2026/02/unable-to-tame-hydrogen-leaks-nasa-delays-launch-of-artemis-ii-until-march/","urlToImage":"https://cdn.arstechnica.net/wp-content/uploads/2026/02/AFRC2026-0017-15orig-1152x648.jpg","publishedAt":"2026-02-03T08:06:50Z","content":null},{"source":{"id":null,"name":"The Conversation Africa"},"author":"Rebecca Allen, Sara Webb","title":"We ate space mushrooms and survived to tell the tale - The Conversation","description":"The mushrooms lived in space for over a month – and could be key to the health of astronauts in the future.","url":"https://theconversation.com/we-ate-space-mushrooms-and-survived-to-tell-the-tale-274112","urlToImage":"https://images.theconversation.com/files/715123/original/file-20260129-56-76ytdl.png?ixlib=rb-4.1.0&rect=0%2C0%2C857%2C428&q=45&auto=format&w=1356&h=668&fit=crop","publishedAt":"2026-02-03T00:01:00Z","content":"The mushrooms spread out on the chopping board seemed normal enough. They were rich and dense, and had a strong earthy aroma. In the saucepan, they melted along with the cheese to form a creamy pasta… [+4091 chars]"},{"source":{"id":null,"name":"Space.com"},"author":"Sharmila Kuthunur","title":"Bleached Martian rocks offer fresh evidence of a wetter and warmer Mars: 'But where did they come from? - Space","description":"\"You need so much water that we think these could be evidence of an ancient warmer and wetter climate where there was rain falling for millions of years.\"","url":"https://www.space.com/astronomy/mars/bleached-martian-rocks-offer-fresh-evidence-of-a-wetter-and-warmer-mars-but-where-did-they-come-from","urlToImage":"https://cdn.mos.cms.futurecdn.net/Fjho7kEjkK6BoiFQwZmzg8-876-80.jpg","publishedAt":"2026-02-02T22:00:00Z","content":"NASA's Perseverance rover has discovered thousands of strangely bleached rocks on Mars that are rich in a mineral difficult to form without long-term exposure to water, adding fresh evidence that the… [+3592 chars]"},{"source":{"id":null,"name":"Phys.Org"},"author":"Wesley Poon","title":"Newly identified RNA molecule may drive cancer patient survival - Phys.org","description":"In a recent study, researchers at the Texas A&amp;M University Health Science Center (Texas A&amp;M Health) identify a novel RNA molecule that plays a crucial role in preserving the integrity of a key cellular structure, the nucleolus . Their findings also su…","url":"https://phys.org/news/2026-02-newly-rna-molecule-cancer-patient.html","urlToImage":"https://scx2.b-cdn.net/gfx/news/2026/researchers-discover-a-1.jpg","publishedAt":"2026-02-02T21:46:23Z","content":"In a recent study, researchers at the Texas A&amp;M University Health Science Center (Texas A&amp;M Health) identify a novel RNA molecule that plays a crucial role in preserving the integrity of a ke… [+4029 chars]"},{"source":{"id":null,"name":"Indiandefencereview.com"},"author":"Emily Carter","title":"Scientists Uncover Thousands Of Mysterious Creatures Lurking Near A Deep-Sea Volcano - Indian Defence Review","description":"A newly studied deep-sea hotspot reveals thousands of creatures lurking in warmth and darkness near an underwater volcano.","url":"https://indiandefencereview.com/thousands-creatures-deep-sea-volcano/","urlToImage":"https://indiandefencereview.com/wp-content/uploads/2026/02/scientists-uncover-thousands-of-mysterious-creatures-lurking-near-a-deep-sea-volcano-scaled.png","publishedAt":"2026-02-02T21:21:25Z","content":"A vast aggregation of deep-sea octopuses has been documented nearly two miles beneath the surface off the coast of California, close to an underwater volcano. Observed and analyzed by the Monterey Ba… [+3364 chars]"},{"source":{"id":null,"name":"Space.com"},"author":"Julian Dossett","title":"AI finds hundreds of never-before-seen 'cosmic anomalies' in old Hubble Telescope images - Space","description":"\"This is a powerful demonstration of how AI can enhance the scientific return of archival datasets.\"","url":"https://www.space.com/astronomy/hubble-space-telescope/ai-finds-hundreds-of-never-before-seen-cosmic-anomalies-in-old-hubble-telescope-images","urlToImage":"https://cdn.mos.cms.futurecdn.net/J3xdZShS5z7HP4VRa9HSYo-1920-80.jpg","publishedAt":"2026-02-02T20:00:00Z","content":"The Hubble Space Telescope takes a lot of pictures. In fact, NASA estimates Hubble has snapped 1.7 million images since it launched in 1990. But this poses a unique issue: It's almost impossible for … [+2506 chars]"},{"source":{"id":null,"name":"Phys.Org"},"author":"Okayama University of Science","title":"Earth's largest volcanic event reshaped an oceanic plate, seismic wave analysis reveals - Phys.org","description":"A research group has revealed through seismic wave analysis that the oceanic plate beneath the Ontong Java Plateau—the world's largest oceanic plateau—was extensively altered by massive volcanic activity during its formation. The study is published in Geophys…","url":"https://phys.org/news/2026-02-earth-largest-volcanic-event-reshaped.html","urlToImage":"https://scx2.b-cdn.net/gfx/news/hires/2026/earths-largest-volcani-1.jpg","publishedAt":"2026-02-02T19:35:26Z","content":"A research group has revealed through seismic wave analysis that the oceanic plate beneath the Ontong Java Plateauthe world's largest oceanic plateauwas extensively altered by massive volcanic activi… [+3939 chars]"},{"source":{"id":null,"name":"PetaPixel"},"author":"Matt Growcoot","title":"What Kind of Photos Will the Artemis II Astronauts Take? And Who Will Take Them? - PetaPixel","description":"Blastoff could be less than one week away.","url":"https://petapixel.com/2026/02/02/artemis-ii-astronauts-photography-christina-koch/","urlToImage":"https://petapixel.com/assets/uploads/2026/02/Artemis2-Photography.jpg","publishedAt":"2026-02-02T17:29:04Z","content":"A computer render of the kind of photo Artemis II astronauts might capture, left, Artemis II astronauts Christina Koch and Victor Glover, right.\r\nPhotography is of vital importance to NASA. The space… [+3352 chars]"},{"source":{"id":null,"name":"Aps.org"},"author":"American Physical Society","title":"Exposing Nuclear Magic - American Physical Society","description":null,"url":"https://physics.aps.org/articles/v19/11","urlToImage":null,"publishedAt":"2026-02-02T17:26:41Z","content":null},{"source":{"id":null,"name":"Phys.Org"},"author":"Krystal Kasal","title":"91-qubit processor accurately simulates many-body quantum chaos - Phys.org","description":"Quantum chaos describes chaotic classical dynamical systems in terms of quantum theory, but simulations of these systems are limited by computational resources. However, one team seems to have found a way by leveraging error mitigation and specialized circuit…","url":"https://phys.org/news/2026-02-qubit-processor-accurately-simulates-body.html","urlToImage":"https://scx2.b-cdn.net/gfx/news/hires/2026/quantum-computer-accur.jpg","publishedAt":"2026-02-02T17:16:16Z","content":"Quantum chaos describes chaotic classical dynamical systems in terms of quantum theory, but simulations of these systems are limited by computational resources. However, one team seems to have found … [+4913 chars]"},{"source":{"id":null,"name":"Gizmodo.com"},"author":"Gayoung Lee","title":"The Baby Universe Really Was a Goopy Soup, Research Suggests - Gizmodo","description":"The early universe is full of mysteries, but we can now at least be sure it was soupy.","url":"https://gizmodo.com/the-baby-universe-really-was-a-goopy-soup-research-suggests-2000716678","urlToImage":"https://gizmodo.com/app/uploads/2026/02/quark-gluon-plasma-wake-visualization-1200x675.jpg","publishedAt":"2026-02-02T17:15:21Z","content":"In the moments following the Big Bang, the extreme heat and pressure coerced matter into a goopy mix of tiny particles. But how goopy? The answer had remained rather unclear to physicistsuntil now.\r\n… [+3611 chars]"},{"source":{"id":null,"name":"Noaa.gov"},"author":null,"title":"NASA's IMAP Active Link for Real-Time Data now Available - Space Weather Prediction Center (.gov)","description":null,"url":"https://www.swpc.noaa.gov/news/nasas-imap-active-link-real-time-data-now-available","urlToImage":null,"publishedAt":"2026-02-02T16:51:00Z","content":"After launching on September 24, 2025, NASAs Interstellar Mapping and Acceleration Probe (IMAP) observatory recently entered orbit around the Sun-Earth L1 Lagrange point. In addition to new heliophys… [+1203 chars]"},{"source":{"id":null,"name":"Quanta Magazine"},"author":null,"title":"How Modern and Antique Technologies Reveal a Dynamic Cosmos - Quanta Magazine","description":"Today’s observatories document every pulse and flash in the sky each night. To understand how the cosmos has changed over longer periods, scientists rely on a more tactile technology.","url":"https://www.quantamagazine.org/how-modern-and-antique-technologies-reveal-a-dynamic-cosmos-20260202/","urlToImage":"https://www.quantamagazine.org/wp-content/uploads/2026/02/Digitizing-Glass-Plates-cr-Kayleigh-MacDonald-Social.jpg","publishedAt":"2026-02-02T16:48:37Z","content":"Bradley Schaefer, an astronomer at Louisiana State University, focuses on cataclysmic variable stars, objects that vary in brightness over time due to some type of major turmoil. His favorites are re… [+4945 chars]"},{"source":{"id":null,"name":"SpaceNews"},"author":"Jeff Foust","title":"House NASA bill seeks details on lunar lander and spacesuit development - SpaceNews","description":"A NASA authorization bill the House Science Committee is scheduled to take up this week would require closer scrutiny of lunar lander and spacesuit work.","url":"http://spacenews.com/house-nasa-bill-seeks-details-on-lunar-lander-and-spacesuit-development/","urlToImage":"https://spacenews.com/wp-content/uploads/2025/10/starshiphls25.jpeg","publishedAt":"2026-02-02T16:43:33Z","content":"WASHINGTON A NASA authorization bill the House Science Committee is scheduled to take up this week would require closer scrutiny of lunar lander and spacesuit development for the Artemis program.\r\nTh… [+4504 chars]"},{"source":{"id":null,"name":"Futurism"},"author":"Victor Tangermann","title":"There’s Something Hiding Under Jupiter’s Clouds, Scientists Find - Futurism","description":"Scientists have created a highly detailed computational model of Jupiter's atmosphere to peer below its thick clouds.","url":"http://futurism.com/space/something-hiding-jupiter-clouds","urlToImage":"https://futurism.com/wp-content/uploads/2026/02/something-hiding-jupiter-clouds.jpg?w=1200","publishedAt":"2026-02-02T16:00:33Z","content":"The enormous storms of impenetrable clouds covering Jupiter’s surface make it nearly impossible for us to get a glimpse of what lies below. Any spacecraft attempting to get a closer look would be vap… [+2800 chars]"},{"source":{"id":null,"name":"Space.com"},"author":"Jamie Carter","title":"See the moon eclipse one of the brightest stars in the sky during rare alignment tonight - Space","description":"One of the brightest stars in the night sky will vanish as seen from North America and Europe in a rare event.","url":"https://www.space.com/stargazing/see-the-moon-eclipse-one-of-the-brightest-stars-in-the-sky-during-rare-alignment-feb-2-2026","urlToImage":"https://cdn.mos.cms.futurecdn.net/FMEddte6KFXhxxnPV3otXd-1920-80.jpg","publishedAt":"2026-02-02T16:00:00Z","content":"If you've never seen the moon occult a bright star, tonight (Feb. 2, 2026) could be a night to remember — if geography is kind to you.\r\nSkywatchers in parts of North America and northwest Africa will… [+4847 chars]"},{"source":{"id":null,"name":"Phys.Org"},"author":"Anne J. Manning","title":"Focusing and defocusing light without a lens: First demonstration of the structured Montgomery effect in free space - Phys.org","description":"Applied physicists in the Harvard John A. Paulson School of Engineering and Applied Sciences (SEAS) have demonstrated a new way to structure light in custom, repeatable, three-dimensional patterns, all without the use of traditional optical elements like lens…","url":"https://phys.org/news/2026-02-focusing-defocusing-lens-montgomery-effect.html","urlToImage":"https://scx2.b-cdn.net/gfx/news/hires/2026/focusing-and-defocusin.jpg","publishedAt":"2026-02-02T15:39:53Z","content":"Applied physicists in the Harvard John A. Paulson School of Engineering and Applied Sciences (SEAS) have demonstrated a new way to structure light in custom, repeatable, three-dimensional patterns, a… [+5488 chars]"},{"source":{"id":null,"name":"Phys.Org"},"author":"Naman Kumar","title":"Infrared running of gravity offers a field-theoretic route to dark matter phenomena - Phys.org","description":"The mystery of dark matter—unseen, pervasive, and essential in standard cosmology—has loomed over physics for decades. In new research, I explore a different possibility: Rather than postulating new particles, I propose that perhaps gravity itself behaves dif…","url":"https://phys.org/news/2026-02-infrared-gravity-field-theoretic-route.html","urlToImage":"https://scx2.b-cdn.net/gfx/news/hires/2026/infrared-running-of-gr.jpg","publishedAt":"2026-02-02T14:40:09Z","content":"The mystery of dark matterunseen, pervasive, and essential in standard cosmologyhas loomed over physics for decades. In new research, I explore a different possibility: Rather than postulating new pa… [+4246 chars]"},{"source":{"id":null,"name":"Phys.Org"},"author":"Marcus Strom","title":"A student made cosmic dust in her lab—what she found could help us understand how life started on Earth - Phys.org","description":"A Sydney Ph.D. student has recreated a tiny piece of the universe inside a bottle in her laboratory, producing cosmic dust from scratch. The results shed new light on how the chemical building blocks of life may have formed long before Earth existed. Linda Lo…","url":"https://phys.org/news/2026-02-student-cosmic-lab-life-earth.html","urlToImage":"https://scx2.b-cdn.net/gfx/news/2026/this-student-made-cosm.jpg","publishedAt":"2026-02-02T14:40:02Z","content":"A Sydney Ph.D. student has recreated a tiny piece of the universe inside a bottle in her laboratory, producing cosmic dust from scratch. The results shed new light on how the chemical building blocks… [+5711 chars]"},{"source":{"id":null,"name":"Indiandefencereview.com"},"author":"Sarah Talbi","title":"600-Million-Year-Old Mystery Solved: Scientists Identify the First Branch on the Tree of Life - Indian Defence Review","description":"Scientists settle a major evolutionary mystery as new research reveals the comb jelly, not the sea sponge, was the first animal to branch off on Earth","url":"https://indiandefencereview.com/scientists-identify-first-branch-tree-of-life/","urlToImage":"https://indiandefencereview.com/wp-content/uploads/2026/02/tree-of-life-concept-scaled.jpg","publishedAt":"2026-02-02T14:30:00Z","content":"For decades, biologists have attempted to trace the earliest split on the animal tree of life, one that occurred approximately 600 million years ago. All living animals, from mammals to mollusks, des… [+3449 chars]"}]}