{"status":"ok","totalResults":42,"articles":[{"source":{"id":null,"name":"Space.com"},"author":"Mike Wall","title":"'Fully unlocking the orbital economy': California company will fly astronauts to the space station in 2027 - Space","description":"As the International Space Station nears the end of its life, private companies are racing to fill the impending void.","url":"https://www.space.com/space-exploration/human-spaceflight/fully-unlocking-the-orbital-economy-california-company-will-fly-astronauts-to-the-space-station-in-2027","urlToImage":"https://cdn.mos.cms.futurecdn.net/cPkP4ezcLtfrApTcGamu5n-1890-80.jpg","publishedAt":"2026-02-16T13:00:00Z","content":null},{"source":{"id":null,"name":"The Daily Galaxy --Great Discoveries Channel"},"author":"Arezki Amiri","title":"Forget Concrete: Scientists Created a Living Building Material That Grows, Breathes, and Repairs Its Own Cracks - The Daily Galaxy","description":"Backed by 400 days of lab data, this radical “living material” could transform how buildings fight climate change.","url":"https://dailygalaxy.com/2026/02/scientists-create-living-self-healing-building-material-capture-carbon/","urlToImage":"https://dailygalaxy.com/wp-content/uploads/2026/02/This-Living-Building-Material-Captures-Carbon-in-Sunlight-scaled.jpg","publishedAt":"2026-02-16T12:15:00Z","content":"For the next nine months, caretakers inside the Canada Pavilion at the 2025 Venice Architecture Biennale will tend to something unusual: the walls themselves. The installation, called Picoplanktonics… [+5979 chars]"},{"source":{"id":null,"name":"Indiandefencereview.com"},"author":"Evelyn Hart","title":"Meet the Spectre Bat: The World's Largest Carnivorous Bat, Feared for Decades Until Cameras Revealed the Truth - Indian Defence Review","description":"Infrared footage from Costa Rica reveals the secret social life of the world’s largest carnivorous bat, and it’s nothing like its fearsome reputation.","url":"https://indiandefencereview.com/spectral-bat-largest-carnivorous-bat-secret-life/","urlToImage":"https://indiandefencereview.com/wp-content/uploads/2026/02/the-largest-carnivorous-bat-on-earth-isnt-what-scientists-believed-for-years-scaled.jpg","publishedAt":"2026-02-16T12:00:00Z","content":"The spectral bat has long occupied an awkward space in the scientific literature. Too rare to study systematically, too intimidating to approach casually, it existed for most of the twentieth century… [+5917 chars]"},{"source":{"id":null,"name":"The Daily Galaxy --Great Discoveries Channel"},"author":"Arezki Amiri","title":"A 300,000-Year-Old Ancient Greek Skull Was neither Human nor Neanderthal. It Belonged to Someone Unexpected - The Daily Galaxy","description":"For 60 years, a skull fused to a Greek cave wall defied science, too human, yet not human enough.","url":"https://dailygalaxy.com/2026/02/ancient-greek-skull-not-human-nor-neanderthal/","urlToImage":"https://dailygalaxy.com/wp-content/uploads/2026/02/An-Ancient-Skull-in-Greece-Didnt-Match-Humans-or-Neanderthals-scaled.jpg","publishedAt":"2026-02-16T11:45:00Z","content":"A human skull hung on a cave wall in northern Greece for more than 300,000 years. When a villager spotted it in 1960, cemented in place by mineral deposits, it launched a scientific mystery that woul… [+6270 chars]"},{"source":{"id":null,"name":"Indiandefencereview.com"},"author":"Evelyn Hart","title":"A 307-Million-Year-Old Creature Found in a Fossilized Tree Is Turning Early Animal History on Its Head - Indian Defence Review","description":"A 307-million-year-old skull from Nova Scotia is overturning a core assumption about when animals first began eating plants.","url":"https://indiandefencereview.com/307-million-year-old-fossil-rewrites-animal-evolution/","urlToImage":"https://indiandefencereview.com/wp-content/uploads/2026/02/ct-scans-of-an-ancient-skull-reveal-a-surprising-twist-in-early-animal-evolution-scaled.jpg","publishedAt":"2026-02-16T11:30:00Z","content":"A chunky, four-legged creature the size of a football has forced a reconsideration of one of evolution’s more practical questions: when did land animals first develop a taste for plants.\r\nThe answer,… [+5744 chars]"},{"source":{"id":null,"name":"Aeon.co"},"author":"Graham Shields","title":"How the harsh, icy world of Snowball Earth shaped life today - Aeon","description":"Our planet was once a harsh, alien, icy world. Yet this deep freeze may have shaped you, me and all life on Earth","url":"https://aeon.co/essays/how-the-harsh-icy-world-of-snowball-earth-shaped-life-today","urlToImage":"https://images.aeonmedia.co/images/8a7f96ff-a3d1-4d5a-ac21-f18295349146/essay-final-e4020116-snowball_earth.jpg?width=1200&quality=75&format=jpg","publishedAt":"2026-02-16T11:04:47Z","content":"As Scotlands west coast recedes from view, the ocean resembles a mirror, broken only by the swash of the boat and the dolphins chasing us. Were headed to the craggy, uninhabited islands known as the … [+22270 chars]"},{"source":{"id":null,"name":"BBC News"},"author":"Melissa Hogenboom","title":"The myth that women are more naturally empathetic than men - BBC","description":"Scientific research is up-ending age-old gender stereotypes about empathy – and revealing new ways of thinking about masculinity.","url":"https://www.bbc.com/future/article/20260213-are-women-naturally-more-empathetic-than-men","urlToImage":"https://ychef.files.bbci.co.uk/624x351/p0n0zczr.jpg","publishedAt":"2026-02-16T10:00:00Z","content":"Girls and women are often said to be more attuned to the faces of others, an important skillset needed for empathy, but results are mixed, and recent research suggests this preference is not somethin… [+1578 chars]"},{"source":{"id":null,"name":"SpaceNews"},"author":"Jeff Foust","title":"Isaacman planning to meet with head of Roscosmos - SpaceNews","description":"NASA Administrator Jared Isaacman said he is interested in meeting with his Russian counterpart and attending an upcoming Soyuz launch.","url":"http://spacenews.com/isaacman-planning-to-meet-with-head-of-roscosmos/","urlToImage":"https://spacenews.com/wp-content/uploads/2026/02/isaacman-crew12.jpeg","publishedAt":"2026-02-16T00:08:20Z","content":"WASHINGTON NASA Administrator Jared Isaacman said he is interested in meeting with his Russian counterpart and attending an upcoming Soyuz launch.\r\nAsked about cooperation with Roscosmos during a new… [+3476 chars]"},{"source":{"id":"ars-technica","name":"Ars Technica"},"author":"Eric Berger","title":"Space Station returns to a full crew complement after a month - Ars Technica","description":"It's only possible because of the incredibly talented workforce we have.\"","url":"https://arstechnica.com/space/2026/02/space-station-returns-to-a-full-crew-complement-after-a-month/","urlToImage":"https://cdn.arstechnica.net/wp-content/uploads/2026/02/crew-12-1152x648.jpg","publishedAt":"2026-02-15T21:11:54Z","content":null},{"source":{"id":null,"name":"SciTechDaily"},"author":null,"title":"This Bonobo Just Did Something Scientists Thought Only Humans Could Do - SciTechDaily","description":"A bonobo demonstrated the ability to track imaginary objects in controlled tests, challenging the belief that imagination is uniquely human and hinting at deep evolutionary roots. In a set of carefully designed experiments modeled on children’s tea parties, r…","url":"https://scitechdaily.com/this-bonobo-just-did-something-scientists-thought-only-humans-could-do/","urlToImage":"https://scitechdaily.com/images/Kanzi-Bonobo-Tea-Party.jpg","publishedAt":"2026-02-15T20:12:20Z","content":"Kanzi, a 43-year-old bonobo living at Ape Initiative, who had been anecdotally reported to engage in pretense and could respond to verbal prompts by pointing. Credit: Ape Initiative\r\nA bonobo demonst… [+6215 chars]"},{"source":{"id":null,"name":"Phys.Org"},"author":"Ingrid Fadelli","title":"Strong correlations and superconductivity observed in a supermoiré lattice - Phys.org","description":"Two or more graphene layers that are stacked with a small twist angle in relation to each other form a so-called moiré lattice. This characteristic pattern influences the movement of electrons inside materials, which can give rise to strongly correlated state…","url":"https://phys.org/news/2026-02-strong-superconductivity-supermoir-lattice.html","urlToImage":"https://scx2.b-cdn.net/gfx/news/hires/2026/study-observes-strong.jpg","publishedAt":"2026-02-15T18:00:03Z","content":"Two or more graphene layers that are stacked with a small twist angle in relation to each other form a so-called moiré lattice. This characteristic pattern influences the movement of electrons inside… [+8254 chars]"},{"source":{"id":null,"name":"Phys.Org"},"author":"Ingrid Fadelli","title":"How a certain form of dark matter may lead to the generation of cosmological magnetic fields - Phys.org","description":"Tiny highly uniform magnetic fields are known to pervade the universe, influencing various cosmological processes. To date, however, the physical mechanisms underpinning the generation of these fields remain poorly understood. Recently, researchers at McGill …","url":"https://phys.org/news/2026-02-dark-generation-cosmological-magnetic-fields.html","urlToImage":"https://scx2.b-cdn.net/gfx/news/hires/2019/magneticfield.jpg","publishedAt":"2026-02-15T17:00:01Z","content":"Tiny highly uniform magnetic fields are known to pervade the universe, influencing various cosmological processes. To date, however, the physical mechanisms underpinning the generation of these field… [+7828 chars]"},{"source":{"id":null,"name":"Phys.Org"},"author":"Levon Pogosian, Karsten Jedamzik, Tom Abel","title":"The Hubble tension: How magnetic fields could help solve one of the universe's biggest mysteries - Phys.org","description":"It's well established that the universe is expanding, but there's serious disagreement among scientists over how fast it's happening.","url":"https://phys.org/news/2026-02-hubble-tension-magnetic-fields-universe.html","urlToImage":"https://scx2.b-cdn.net/gfx/news/hires/2026/the-hubble-tension-how.jpg","publishedAt":"2026-02-15T16:30:01Z","content":"It's well established that the universe is expanding, but there's serious disagreement among scientists over how fast it's happening.\r\nTwo of our best ways of measuring the cosmic expansion rate, the… [+6803 chars]"},{"source":{"id":null,"name":"Phys.Org"},"author":"Claire Loewen","title":"Would you take the bigger share? Study shows people can learn to say no - Phys.org","description":"A new study co-authored by McGill University researchers suggests people can be taught to reject unfair advantages. \"We often benefit personally from an unequal distribution of resources, a phenomenon known as advantageous inequity—for example, receiving a hi…","url":"https://phys.org/news/2026-02-bigger-people.html","urlToImage":"https://scx2.b-cdn.net/gfx/news/hires/2026/people-can-learn-to-re.jpg","publishedAt":"2026-02-15T16:00:01Z","content":"A new study co-authored by McGill University researchers suggests people can be taught to reject unfair advantages. \"We often benefit personally from an unequal distribution of resources, a phenomeno… [+3398 chars]"},{"source":{"id":null,"name":"The Daily Galaxy --Great Discoveries Channel"},"author":"Melissa Ait Lounis","title":"Scientists Just Discovered a Fish That Sees in a Way No Other Animal Can - The Daily Galaxy","description":"Researchers have identified a third type of visual cell in deep-sea fish larvae, shaking up 150 years of vision science.","url":"https://dailygalaxy.com/2026/02/deep-sea-fish-hybrid-eye-cell-discovery/","urlToImage":"https://dailygalaxy.com/wp-content/uploads/2026/02/Scientists-Just-Discovered-a-Fish-That-Sees-in-a-Way-No-Other-Animal-Can-scaled.jpg","publishedAt":"2026-02-15T15:15:00Z","content":"A team of scientists has revealed a previously unknown type of visual cell in deep-sea fish larvae, an unexpected finding that reshapes more than 150 years of scientific thinking about vertebrate eye… [+2131 chars]"},{"source":{"id":null,"name":"Forbes"},"author":"Zachary Folk","title":"Northern Lights Forecast: Aurora Could Be Visible in These 15 States - Forbes","description":"Minor to moderate geomagnetic storms could make the aurora visible further south, forecasters said.","url":"https://www.forbes.com/sites/zacharyfolk/2026/02/15/northern-lights-could-be-visible-from-these-15-states-sunday/","urlToImage":"https://imageio.forbes.com/specials-images/imageserve/6991e16f030207da9b57c377/0x0.jpg?format=jpg&height=900&width=1600&fit=bounds","publishedAt":"2026-02-15T15:09:28Z","content":"The northern lights could be visible from the northern U.S. on Sunday night, according to a forecast from the National Oceanic and Atmospheric Administration, as periods of minor and moderate geomagn… [+2665 chars]"},{"source":{"id":null,"name":"Phys.Org"},"author":"Autonomous University of Barcelona","title":"Microscopic plankton reveal tropicalization of the Mediterranean Sea - Phys.org","description":"The Mediterranean Sea is rapidly changing under ongoing climate change. In the eastern basin, tropicalization is already well documented and driven by a combination of strong warming and the influx of tropical species through the Suez Canal. In contrast, the …","url":"https://phys.org/news/2026-02-microscopic-plankton-reveal-tropicalization-mediterranean.html","urlToImage":"https://scx2.b-cdn.net/gfx/news/hires/2026/microscopic-plankton-r.jpg","publishedAt":"2026-02-15T15:00:01Z","content":"The Mediterranean Sea is rapidly changing under ongoing climate change. In the eastern basin, tropicalization is already well documented and driven by a combination of strong warming and the influx o… [+5373 chars]"},{"source":{"id":null,"name":"The Daily Galaxy --Great Discoveries Channel"},"author":"Sarah Jones","title":"NASA Spotted This Comet as It Exploded, and It’s Full of Organic Chemicals - The Daily Galaxy","description":"A rare interstellar visitor, comet 3I/ATLAS, was caught by SPHEREx releasing organic chemicals and large debris into space.","url":"https://dailygalaxy.com/2026/02/nasa-spotted-comet-full-organic-chemicals/","urlToImage":"https://dailygalaxy.com/wp-content/uploads/2026/02/NASA-Spotted-This-Comet-as-It-Exploded-and-Its-Full-of-Organic-Chemicals-scaled.jpg","publishedAt":"2026-02-15T14:15:00Z","content":"NASAs SPHEREx space telescope has observed interstellar comet 3I/ATLAS flaring dramatically months after its closest pass by the Sun. Only the third confirmed interstellar object ever detected in our… [+3272 chars]"},{"source":{"id":null,"name":"Live Science"},"author":"Olivia Ferrari","title":"Snakes keep evolving into cannibals — here's what scientists think is going on - Live Science","description":"A review of over 500 reports of cannibalistic behavior in snakes finds it's appeared multiple times in different evolutionary lineages, leading researchers to hypothesize it's beneficial for snakes under certain circumstances.","url":"https://www.livescience.com/animals/snakes/snakes-keep-evolving-into-cannibals-heres-what-scientists-think-is-going-on","urlToImage":"https://cdn.mos.cms.futurecdn.net/bfBPoosV3bUkMvVGq9XHTk-1920-80.jpg","publishedAt":"2026-02-15T14:10:00Z","content":null},{"source":{"id":null,"name":"Jalopnik"},"author":"Collin Woodard","title":"Space Babies Are Going To Be Harder To Make Than You Think - Jalopnik","description":"Space is full of radiation, which is bad for both babies and non-babies alike, but we also have to worry about how microgravity affects the human body, too.","url":"https://www.jalopnik.com/2100310/space-babies-harder-to-make/","urlToImage":"https://www.jalopnik.com/img/gallery/space-babies-are-going-to-be-harder-to-make-than-you-think/l-intro-1770993045.jpg","publishedAt":"2026-02-15T14:05:00Z","content":"According to the paper, \"NASA has identified five hazards of space travel: space radiation; isolation and confinement; distance from Earth; gravity (or lack of gravity); and hostile environments.\" An… [+1965 chars]"}]}